[
{
  "entity": "Boolean Expression",
  "uht_code": "4080FFCF",
  "image_url": "/validation_set/images/boolean_expression.png",
  "traits": {
    "physical": [
      "Man-made / synthetic"
    ],
    "functional": [
      "Purposeful / intentional"
    ],
    "abstract": [
      "Symbolic / representational",
      "Communicative",
      "Logical / rule-based",
      "Hierarchical / modular",
      "Behavior-guiding",
      "Self-referential / meta-conceptual",
      "Temporal",
      "Contextual abstraction"
    ],
    "social": [
      "Socially / culturally constructed",
      "Defined by a group/system",
      "Teachable / transmissible",
      "Visible",
      "Context-sensitive",
      "Widely known"
    ]
  },
  "feedback": {
    "Physical object": "Excluded — A Boolean expression is an abstract formalism, not a material thing.",
    "Man-made / synthetic": "Included — Boolean logic is a human-created symbolic system.",
    "Biological or biologically-inspired": "Excluded — Not based on biological models.",
    "Fixed/static": "Excluded — Boolean expressions are formalisms, not static entities.",
    "Structural": "Excluded — Logical, not physical, structure.",
    "Perceptible": "Excluded — Only visible when rendered, not inherently perceptible.",
    "Material form": "Excluded — Exists independently of any medium.",
    "Passive": "Excluded — Not a physically passive entity.",
    
    "Purposeful / intentional": "Included — Constructed to represent binary logic and enable formal reasoning.",
    "Emits output / produces effect": "Excluded — Alone, it encodes logic but does not execute or produce output.",
    "Processes or regulates logic/signals": "Excluded — Describes logic, but does not perform processing.",
    "Transforms or modifies internal state": "Excluded — Not a dynamic entity.",
    "Interacts with humans directly": "Excluded — Understood by humans, but not interactive.",
    "Part of a larger system": "Excluded — Used in systems, but not a system component in itself.",
    "Autonomous in function": "Excluded — Passive structure; requires evaluation context.",
    "System-critical": "Excluded — Foundational, but not critical on its own.",
    
    "Symbolic / representational": "Included — Uses symbolic variables and operators (AND, OR, NOT).",
    "Communicative": "Included — Encodes logical conditions or constraints.",
    "Logical / rule-based": "Included — Entirely governed by formal logical syntax and semantics.",
    "Hierarchical / modular": "Included — Boolean expressions can be nested and composed modularly.",
    "Behavior-guiding": "Included — Guides program control flow, system design, and decisions.",
    "Self-referential / meta-conceptual": "Included — Can describe logic about logic (e.g., tautologies, contradictions).",
    "Temporal": "Included — Expression evaluation depends on time-based input states (e.g., in circuits or execution).",
    "Contextual abstraction": "Included — Meaning depends on interpretation context, variable assignment, etc.",
    
    "Socially / culturally constructed": "Included — Formalized and maintained within mathematics and computer science.",
    "Defined by a group/system": "Included — Standardized in digital logic, formal methods, and programming.",
    "Linked to identity or role": "Excluded — Not inherently tied to personal or group identity.",
    "Regulated / governed": "Excluded — No legal or institutional enforcement.",
    "Teachable / transmissible": "Included — Taught in logic, mathematics, and programming curricula.",
    "Visible": "Included — Expressed in symbols, text, or circuit diagrams.",
    "Context-sensitive": "Included — Interpretation depends on logical context or variable state.",
    "Widely known": "Included — Commonly taught and understood in technical domains."
  },
  "encoding_notes": "A Boolean Expression is a symbolic, logical, and culturally embedded abstraction with formal purpose and syntactic clarity. It is not a processor or emitter but a representational structure used for reasoning and control. This encoding mirrors the UHT profile of other abstract formal entities such as 'Proof (in Logic)'.",
  "image": "images/boolean_expression.png"
}

,
{
  "entity": "Budget Spreadsheet",
  "uht_code": "448CF7DF",
  "image_url": "/validation_set/images/budget_spreadsheet.png",
  "traits": {
    "physical": [
      "Man-made / synthetic",
      "Perceptible"
    ],
    "functional": [
      "Purposeful / intentional",
      "Interacts with humans directly",
      "Part of a larger system"
    ],
    "abstract": [
      "Symbolic / representational",
      "Communicative",
      "Logical / rule-based",
      "Hierarchical / modular",
      "Behavior-guiding",
      "Temporal",
      "Contextual abstraction"
    ],
    "social": [
      "Socially / culturally constructed",
      "Defined by a group/system",
      "Regulated / governed",
      "Teachable / transmissible",
      "Visible",
      "Context-sensitive",
      "Widely known"
    ]
  },
  "feedback": {
    "Physical object": "Excluded — A budget spreadsheet is a conceptual and digital entity, not a tangible object.",
    "Man-made / synthetic": "Included — It is a human-created software artifact with a defined structure and purpose.",
    "Biological or biologically-inspired": "Excluded — It has no connection to biological systems or processes.",
    "Fixed/static": "Excluded — A spreadsheet is a dynamic file that can be moved or copied; it is not physically fixed.",
    "Structural": "Excluded — Its structure (cells, rows, columns) is a conceptual organization, not a physical or load-bearing one.",
    "Perceptible": "Included — It is perceived visually through a screen or printed copy.",
    "Material form": "Excluded — It is a logical entity (software, data) that exists only on hardware, not as a physical material form itself.",
    "Passive": "Excluded — It is an active tool that performs calculations and manipulations on data.",
    "Purposeful / intentional": "Included — Designed with the explicit purpose of managing and tracking financial data.",
    "Emits output / produces effect": "Excluded — While it displays results, it does not generate external signals or effects. The output is conceptual and visual.",
    "Processes or regulates logic/signals": "Excluded — It represents logic but requires human initiation; it is not an autonomous process or regulator.",
    "Transforms or modifies internal state": "Excluded — Changes in cell values and formulas are data mutation, not intrinsic state transformation in the sense of a self-modifying system.",
    "Interacts with humans directly": "Included — Designed for direct user input and real-time feedback via a user interface.",
    "Part of a larger system": "Included — Functions within a broader financial management or personal accounting ecosystem.",
    "Autonomous in function": "Excluded — It requires human input and direction to perform its core function.",
    "System-critical": "Excluded — It is a personal or organizational tool, not an essential component of a broader infrastructure.",
    "Symbolic / representational": "Included — Numbers and cells represent financial concepts and real-world transactions.",
    "Communicative": "Included — It conveys financial status and information to its users.",
    "Logical / rule-based": "Included — Its operations are governed by logical formulas and rules (e.g., `IF` statements, `SUM` functions).",
    "Hierarchical / modular": "Included — Composed of a clear hierarchy (e.g., tabs, rows, columns, cells) and modular components (formulas).",
    "Behavior-guiding": "Included — The financial data it presents is designed to guide and inform user decisions and behavior.",
    "Self-referential / meta-conceptual": "Excluded — It does not typically reflect on its own structure or purpose.",
    "Temporal": "Included — It is used to track and analyze financial data over periods of time.",
    "Contextual abstraction": "Included — Its meaning and validity are entirely dependent on the specific context of the budget it represents.",
    "Socially / culturally constructed": "Included — The very concept of budgeting and financial management is a social and cultural construct.",
    "Defined by a group/system": "Included — Its structure and use are often defined by accounting, business, or financial standards.",
    "Linked to identity or role": "Excluded — A spreadsheet user may have a role, but the spreadsheet itself does not semantically embody that role.",
    "Regulated / governed": "Included — Its use may be subject to legal and regulatory compliance (e.g., tax law, accounting standards).",
    "Teachable / transmissible": "Included — The concept and skills for using a budget spreadsheet are a fundamental part of financial education.",
    "Visible": "Included — It is a visual interface designed to be viewed and manipulated on a screen.",
    "Context-sensitive": "Included — Its interpretation depends on its specific use, audience, and data.",
    "Widely known": "Included — The idea of a budget spreadsheet is globally recognized and foundational."
  },
  "encoding_notes": "This encoding reflects a highly compressed and minimalist view of a budget spreadsheet as a purely abstract, conceptual tool. Physical and functional traits are excluded unless absolutely core to its identity as a non-autonomous software agent, while its abstract and social traits are fully represented due to its role in human knowledge and cultural systems. The resulting code is optimized for semantic density, excluding traits that are merely a result of its interpretation or use rather than its intrinsic nature.",
  "image": "images/budget_spreadsheet.png"
}
,
{
  "entity": "Calendar",
  "uht_code": "4480F7CF",
  "image_url": "/validation_set/images/calendar.png",
  "traits": {
    "physical": [
      "Man-made / synthetic",
      "Perceptible"
    ],
    "functional": [
      "Purposeful / intentional"
    ],
    "abstract": [
      "Symbolic / representational",
      "Communicative",
      "Logical / rule-based",
      "Hierarchical / modular",
      "Behavior-guiding",
      "Temporal",
      "Contextual abstraction"
    ],
    "social": [
      "Socially / culturally constructed",
      "Defined by a group/system",
      "Teachable / transmissible",
      "Visible",
      "Context-sensitive",
      "Widely known"
    ]
  },
  "feedback": {
    "Physical object": "Excluded — A calendar system is not a physical object; wall calendars and apps are its representations.",
    "Man-made / synthetic": "Included — Calendar systems are invented and maintained by human cultures.",
    "Biological or biologically-inspired": "Excluded — While inspired by astronomical cycles, their structure is synthetic.",
    "Fixed/static": "Excluded — Calendar systems evolve over time and differ by culture.",
    "Structural": "Excluded — Its structure is formal and conceptual, not architectural.",
    "Perceptible": "Included — Calendars are visually rendered to support their use.",
    "Material form": "Excluded — The concept of a calendar is not made of matter.",
    "Passive": "Excluded — It has no reactive or dynamic function in itself.",
    
    "Purposeful / intentional": "Included — Created for coordinating events and structuring time.",
    "Emits output / produces effect": "Excluded — Does not autonomously generate results; output depends on interpretation.",
    "Processes or regulates logic/signals": "Excluded — Encodes logic, but is not a processor.",
    "Transforms or modifies internal state": "Excluded — Its use does not involve internal transformation.",
    "Interacts with humans directly": "Excluded — The system itself is static; interaction is through media.",
    "Part of a larger system": "Excluded — Can be integrated but is not inherently part of another system.",
    "Autonomous in function": "Excluded — Requires human use to function.",
    "System-critical": "Excluded — Helpful but not structurally essential to a system’s operation.",
    
    "Symbolic / representational": "Included — Uses symbolic structures to represent temporal information.",
    "Communicative": "Included — Expresses dates, durations, and cycles to others.",
    "Logical / rule-based": "Included — Built on formalized leap-year rules, cycles, and sequences.",
    "Hierarchical / modular": "Included — Days form weeks, weeks form months, months form years.",
    "Behavior-guiding": "Included — Used to guide planning, rituals, and deadlines.",
    "Self-referential / meta-conceptual": "Excluded — The system does not encode itself or refer to its own principles.",
    "Temporal": "Included — Its entire domain is the structure of time.",
    "Contextual abstraction": "Included — Calendars differ by religion, culture, and purpose.",
    
    "Socially / culturally constructed": "Included — Calendars are culturally maintained artifacts.",
    "Defined by a group/system": "Included — Institutionalized by religious or governmental bodies.",
    "Linked to identity or role": "Excluded — Not specific to personal or group identity.",
    "Regulated / governed": "Excluded — While adopted officially, calendar logic is not formally enforced everywhere.",
    "Teachable / transmissible": "Included — Core knowledge taught in basic education worldwide.",
    "Visible": "Included — Always instantiated in a visible form for use.",
    "Context-sensitive": "Included — Varies across geopolitical and cultural contexts.",
    "Widely known": "Included — Universal across human societies."
  },
  "encoding_notes": "This encoding treats the calendar as a symbolic, logic-based, culturally constructed abstraction designed for temporal organization. It is not a physical object or a processor, but a framework used to coordinate and guide behavior within human systems. The uht_code reflects its highly abstract and socially embedded nature with minimal functional operation.",
  "image": "images/calendar.png"
}

,
{
  "entity": "Chess Strategy",
  "uht_code": "4088FFCB",
  "image_url": "/validation_set/images/chess_strategy.png",
  "traits": {
    "physical": [
      "Man-made / synthetic"
    ],
    "functional": [
      "Purposeful / intentional",
      "Part of a larger system"
    ],
    "abstract": [
      "Symbolic / representational",
      "Communicative",
      "Logical / rule-based",
      "Hierarchical / modular",
      "Behavior-guiding",
      "Self-referential / meta-conceptual",
      "Temporal",
      "Contextual abstraction"
    ],
    "social": [
      "Socially / culturally constructed",
      "Defined by a group/system",
      "Teachable / transmissible",
      "Context-sensitive",
      "Widely known"
    ]
  },
  "feedback": {
    "Physical object": "Excluded — A strategy is a conceptual plan, not a physical object.",
    "Man-made / synthetic": "Included — Chess strategies are entirely human-invented constructs.",
    "Biological or biologically-inspired": "Excluded — Rooted in logic and planning, not biological principles.",
    "Fixed/static": "Excluded — Strategies are adaptable and change with conditions.",
    "Structural": "Excluded — Has no physical structure.",
    "Perceptible": "Excluded — Strategies are inferred from moves, not directly observed.",
    "Material form": "Excluded — Not composed of matter.",
    "Passive": "Excluded — Not a passive entity; it implies decision-making but does not enact it.",
    "Purposeful / intentional": "Included — Strategies are devised with specific goals in mind (e.g., control center, exploit weakness).",
    "Emits output / produces effect": "Excluded — The strategy itself does not produce output, though it influences it.",
    "Processes or regulates logic/signals": "Excluded — A strategy informs reasoning, but does not process logic actively.",
    "Transforms or modifies internal state": "Excluded — It modifies behavior, not its own state.",
    "Interacts with humans directly": "Excluded — Understood and used by humans, but not interacted with directly.",
    "Part of a larger system": "Included — Strategies exist within the larger system of chess play and training.",
    "Autonomous in function": "Excluded — Requires human application; not self-operating.",
    "System-critical": "Excluded — Not essential to the existence of chess, though often important for success.",
    "Symbolic / representational": "Included — Strategic patterns and ideas are encoded in language, notation, and conceptual models.",
    "Communicative": "Included — Can be described, taught, and debated.",
    "Logical / rule-based": "Included — Strategy is constrained and shaped by the rules of chess.",
    "Hierarchical / modular": "Included — Composed of smaller ideas and phases (e.g., openings, middlegame, endgame).",
    "Behavior-guiding": "Included — Core function is to guide player decisions.",
    "Self-referential / meta-conceptual": "Included — Strategies often reflect on or counter other strategies (e.g., meta-game planning).",
    "Temporal": "Included — Strategies evolve over the course of a match and are phase-dependent.",
    "Contextual abstraction": "Included — Validity of a strategy depends on opponent, position, and phase of game.",
    "Socially / culturally constructed": "Included — Strategies evolve through human discourse and competition.",
    "Defined by a group/system": "Included — Recognized and categorized by the chess community.",
    "Linked to identity or role": "Excluded — Strategies are not tied to personal or group identity.",
    "Regulated / governed": "Excluded — No formal governing body enforces strategy use.",
    "Teachable / transmissible": "Included — Central to chess education.",
    "Visible": "Excluded — The strategic intent is inferred, not directly perceived.",
    "Context-sensitive": "Included — Effectiveness depends on many surrounding conditions.",
    "Widely known": "Included — Well-known strategies (e.g., King's Indian Defense) are broadly familiar."
  },
  "encoding_notes": "This encoding represents chess strategy as a symbolic, abstract, and socially-evolved conceptual tool. It is not a physical or autonomous system but one designed to guide human behavior within a formal ruleset. Its role in structured play, education, and community discourse is well reflected in the inclusion of nearly all abstract and social traits.",
  "image": "images/chess_strategy.png"
}

,
{
  "entity": "Concept of Zero",
  "uht_code": "4080FFCF",
  "image_url": "/validation_set/images/concept_of_zero.png",
  "traits": {
    "physical": [
      "Man-made / synthetic"
    ],
    "functional": [
      "Purposeful / intentional"
    ],
    "abstract": [
      "Symbolic / representational",
      "Communicative",
      "Logical / rule-based",
      "Hierarchical / modular",
      "Behavior-guiding",
      "Self-referential / meta-conceptual",
      "Temporal",
      "Contextual abstraction"
    ],
    "social": [
      "Socially / culturally constructed",
      "Defined by a group/system",
      "Teachable / transmissible",
      "Visible",
      "Context-sensitive",
      "Widely known"
    ]
  },
  "feedback": {
    "Physical object": "Excluded — Zero is a conceptual abstraction, not a tangible or physical object.",
    "Man-made / synthetic": "Included — Zero was invented and formalized by humans in multiple historical contexts.",
    "Biological or biologically-inspired": "Excluded — It has no biological basis or origin.",
    "Fixed/static": "Excluded — It is a symbolic placeholder and not inherently fixed in form or function.",
    "Structural": "Excluded — It has no material or spatial structure.",
    "Perceptible": "Excluded — It is not inherently perceptible; it must be represented visually or symbolically.",
    "Material form": "Excluded — It is not composed of physical matter.",
    "Passive": "Excluded — Not a passive entity in any material or functional sense.",
    "Purposeful / intentional": "Included — Zero was created intentionally to solve numeric, positional, and representational problems.",
    "Emits output / produces effect": "Excluded — It does not generate any intrinsic output or effect.",
    "Processes or regulates logic/signals": "Excluded — It is not an agent or system for processing anything.",
    "Transforms or modifies internal state": "Excluded — It has no state to transform.",
    "Interacts with humans directly": "Excluded — It is accessed through representation or language, not via direct interaction.",
    "Part of a larger system": "Excluded — While it is used in systems (e.g., mathematics), it is not itself modular or systemic.",
    "Autonomous in function": "Excluded — It does not act or operate independently.",
    "System-critical": "Excluded — It is foundational but not functionally critical in any operational sense.",
    "Symbolic / representational": "Included — Zero is a symbolic construct used to represent absence, quantity, and position.",
    "Communicative": "Included — Enables efficient numeric communication, especially in positional systems.",
    "Logical / rule-based": "Included — Zero is used in and defined by formal logic systems and arithmetic rules.",
    "Hierarchical / modular": "Included — Zero operates at various conceptual levels (e.g., positional value, null quantity).",
    "Behavior-guiding": "Included — The concept influences mathematical and computational reasoning.",
    "Self-referential / meta-conceptual": "Included — It can be referenced in terms of itself (e.g., 'zero of zero'), and has meta-conceptual uses.",
    "Temporal": "Included — It plays a role in representing time (e.g., zero point, starting state).",
    "Contextual abstraction": "Included — Its meaning varies by domain (e.g., null vs zero vs origin).",
    "Socially / culturally constructed": "Included — Zero emerged through specific historical and cultural developments (e.g., India, Babylon, Mesoamerica).",
    "Defined by a group/system": "Included — It is standardized within mathematical systems and formal education.",
    "Linked to identity or role": "Excluded — Zero does not reflect social identity or personal roles.",
    "Regulated / governed": "Excluded — Its use is widespread and standardized, but not governed by legal or institutional regulation.",
    "Teachable / transmissible": "Included — It is universally taught and foundational in mathematics.",
    "Visible": "Included — It is rendered in symbols (e.g., 0) across notation systems.",
    "Context-sensitive": "Included — Its interpretation depends on domain and symbolic framework.",
    "Widely known": "Included — Zero is known and used across nearly all cultures and systems."
  },
  "encoding_notes": "This encoding captures the Concept of Zero as an intentional, symbolic, logical abstraction with cultural and pedagogical significance. It is not a functional agent but plays a critical representational role across disciplines. The code correctly places weight in the abstract and social layers, with minimal physical or functional attribution.",
  "image": "images/concept_of_zero.png"
}

,
{
  "entity": "Coordinate System",
  "uht_code": "4000FBDF",
  "image_url": "/validation_set/images/coordinate_system.png",
  "traits": {
    "physical": [
      "Man-made / synthetic"
    ],
    "functional": [],
    "abstract": [
      "Symbolic / representational",
      "Communicative",
      "Logical / rule-based",
      "Hierarchical / modular",
      "Behavior-guiding",
      "Self-referential / meta-conceptual",
      "Contextual abstraction"
    ],
    "social": [
      "Socially / culturally constructed",
      "Defined by a group/system",
      "Teachable / transmissible",
      "Visible",
      "Context-sensitive",
      "Widely known"
    ]
  },
  "feedback": {
    "Physical object": "Excluded — It is a conceptual framework for defining relationships in space, not a tangible object.",
    "Man-made / synthetic": "Included — The concept of a coordinate system and its notation are human-created conventions.",
    "Biological or biologically-inspired": "Excluded — It is based on mathematical principles, not biological systems.",
    "Fixed/static": "Excluded — As a conceptual entity, it has no physical immobility.",
    "Structural": "Excluded — Its structure is a conceptual framework, not a physical or load-bearing one.",
    "Perceptible": "Excluded — It is perceived through its representation (e.g., on a graph), not as a physical entity itself.",
    "Material form": "Excluded — It is a formal concept and is not composed of matter.",
    "Passive": "Excluded — This trait is not meaningfully applicable to a conceptual entity.",
    "Purposeful / intentional": "Excluded — Its purpose is to represent, not to act; intentionality is applied by the user.",
    "Emits output / produces effect": "Excluded — It provides a framework for output, but does not produce effects itself.",
    "Processes or regulates logic/signals": "Excluded — It is a representation of a logical system, not a process that executes logic.",
    "Transforms or modifies internal state": "Excluded — It is a static, unchanging concept.",
    "Interacts with humans directly": "Excluded — It is a static concept, not an interactive interface.",
    "Part of a larger system": "Excluded — It is a foundational component of many systems, but its identity is not system-bound.",
    "Autonomous in function": "Excluded — It has no autonomous function.",
    "System-critical": "Excluded — While foundational, it is a conceptual tool, not a critical part of a system's operation.",
    "Symbolic / representational": "Included — It uses symbols (e.g., x, y, z) to represent a spatial relationship.",
    "Communicative": "Included — Its primary purpose is to communicate location and spatial relationships.",
    "Logical / rule-based": "Included — It is defined by and operates on strict mathematical and logical rules.",
    "Hierarchical / modular": "Included — It can be scaled and has a nested structure (e.g., 2D within 3D).",
    "Behavior-guiding": "Included — Its primary purpose is to guide behavior, such as navigation or design.",
    "Self-referential / meta-conceptual": "Included — It can be used to describe its own axes or origin point.",
    "Temporal": "Excluded — The concept itself is atemporal, even when used to represent time.",
    "Contextual abstraction": "Included — Its meaning and validity are dependent on the context (e.g., Cartesian vs. polar, geographic vs. celestial).",
    "Socially / culturally constructed": "Included — The concept and notation of coordinate systems are human-created and agreed upon.",
    "Defined by a group/system": "Included — The standards for its use are defined by scientific and mathematical communities.",
    "Linked to identity or role": "Excluded — It does not define the identity or role of a person or group.",
    "Regulated / governed": "Excluded — While standardized, there’s no global regulatory enforcement across all domains.",
    "Teachable / transmissible": "Included — The knowledge and application of it are a fundamental part of education.",
    "Visible": "Included — It is presented in a visual form (e.g., a graph, a map) to be understood.",
    "Context-sensitive": "Included — Interpretation depends on mathematical context (e.g., `x = y` in algebra vs. logic).",
    "Widely known": "Included — The concept of a coordinate system is globally recognized and foundational."
  },
  "encoding_notes": "This encoding captures the Coordinate System as a purely abstract, human-created conceptual entity. It is defined by its symbolic, logical, and social properties, and its core function is to guide behavior and communicate spatial relationships. Functional traits are excluded based on UHT standards for non-executing frameworks. The inclusion of both Contextual abstraction (24) and Context-sensitive (31) reflects its dual epistemic and interpretive dependencies.",
  "image": "images/coordinate_system.png"
}
,
{
  "entity": "Encryption Algorithm",
  "uht_code": "40F7FDDF",
  "image_url": "/validation_set/images/encryption_algorithm.png",
  "traits": {
    "physical": [
      "Man-made / synthetic"
    ],
    "functional": [
      "Purposeful / intentional",
      "Emits output / produces effect",
      "Processes or regulates logic/signals",
      "Transforms or modifies internal state",
      "Part of a larger system",
      "Autonomous in function",
      "System-critical"
    ],
    "abstract": [
      "Symbolic / representational",
      "Communicative",
      "Logical / rule-based",
      "Hierarchical / modular",
      "Behavior-guiding",
      "Self-referential / meta-conceptual",
      "Contextual abstraction"
    ],
    "social": [
      "Socially / culturally constructed",
      "Defined by a group/system",
      "Regulated / governed",
      "Teachable / transmissible",
      "Visible",
      "Context-sensitive",
      "Widely known"
    ]
  },
  "feedback": {
    "Physical object": "Excluded — An algorithm is a formal procedure, not a tangible object.",
    "Man-made / synthetic": "Included — It is an entirely human-designed construct.",
    "Biological or biologically-inspired": "Excluded — Most are based on mathematical principles, not biological models.",
    "Fixed/static": "Excluded — Algorithms are abstract and exist independently of a fixed instantiation.",
    "Structural": "Excluded — The structure is logical, not physical.",
    "Perceptible": "Excluded — Not directly observable outside of representation.",
    "Material form": "Excluded — It is abstract and not made of matter.",
    "Passive": "Excluded — Not applicable to a symbolic system.",
    "Purposeful / intentional": "Included — Created with the explicit goal of securing data.",
    "Emits output / produces effect": "Included — Produces encrypted or hashed output.",
    "Processes or regulates logic/signals": "Included — Executes logical transformations on input data.",
    "Transforms or modifies internal state": "Included — The algorithm's state changes in a predictable way in response to input and key, and it fundamentally transforms data (state).",
    "Interacts with humans directly": "Excluded — Interaction is mediated via interfaces or code; not intrinsic to the algorithm.",
    "Part of a larger system": "Included — A foundational component of secure systems and protocols.",
    "Autonomous in function": "Included — Once implemented, performs its function without human intervention.",
    "System-critical": "Included — In secure systems, failure of the algorithm breaks trust or functionality.",
    "Symbolic / representational": "Included — Uses formal symbolic rules to define transformations.",
    "Communicative": "Included — Enables secure communication by design.",
    "Logical / rule-based": "Included — Defined entirely by logical structure and deterministic operations.",
    "Hierarchical / modular": "Included — Many algorithms are composed of layered steps (e.g., rounds, key expansion).",
    "Behavior-guiding": "Included — Guides how systems and users structure secure data exchange.",
    "Self-referential / meta-conceptual": "Included — Algorithms often invoke themselves recursively or are designed using meta-principles.",
    "Temporal": "Excluded — Not inherently time-based, though execution occurs in time.",
    "Contextual abstraction": "Included — Behavior depends on key length, mode of operation, input format, etc.",
    "Socially / culturally constructed": "Included — Developed within academic, military, or corporate communities.",
    "Defined by a group/system": "Included — Standardized by institutions (e.g., NIST, IETF).",
    "Linked to identity or role": "Excluded — Does not define personal or group identity.",
    "Regulated / governed": "Included — Subject to export restrictions, compliance standards, and cryptographic regulations.",
    "Teachable / transmissible": "Included — Foundational part of education in computer science and cybersecurity.",
    "Visible": "Included — Often published in papers, RFCs, code libraries, and documentation.",
    "Context-sensitive": "Included — Implementation behavior depends on context of use.",
    "Widely known": "Included — Major algorithms are widely disseminated and scrutinized."
  },
  "encoding_notes": "This encoding captures the Encryption Algorithm as a symbolic, logical, and socially governed construct with real functional significance. It is not a physical object but operates within highly structured technical and cultural frameworks. It is distinct from software *implementations* which would include more physical and functional traits.",
  "image": "images/encryption_algorithm.png"
}
,
{
  "entity": "Flowchart",
  "uht_code": "4488F9CF",
  "image_url": "/validation_set/images/flowchart.png",
  "traits": {
    "physical": [
      "Man-made / synthetic",
      "Perceptible"
    ],
    "functional": [
      "Purposeful / intentional",
      "Interacts with humans directly"
    ],
    "abstract": [
      "Symbolic / representational",
      "Communicative",
      "Logical / rule-based",
      "Hierarchical / modular",
      "Behavior-guiding",
      "Contextual abstraction"
    ],
    "social": [
      "Socially / culturally constructed",
      "Defined by a group/system",
      "Teachable / transmissible",
      "Visible",
      "Context-sensitive",
      "Widely known"
    ]
  },
  "feedback": {
    "Physical object": "Excluded — A flowchart is a conceptual diagram, not a tangible object.",
    "Man-made / synthetic": "Included — Flowcharts are constructed using agreed-upon symbolic conventions.",
    "Biological or biologically-inspired": "Excluded — There is no biological basis in its structure or logic.",
    "Fixed/static": "Excluded — While instances may be fixed, the concept itself is abstract and modifiable.",
    "Structural": "Excluded — It does not have a physical or material structure.",
    "Perceptible": "Included — A flowchart is explicitly visual and designed to be seen and interpreted.",
    "Material form": "Excluded — The diagram is abstract; it may be drawn on material, but is not material itself.",
    "Passive": "Excluded — The concept of passivity is not meaningfully applicable to a static diagram.",
    "Purposeful / intentional": "Included — Created with the intent to convey process logic or workflow.",
    "Emits output / produces effect": "Excluded — It does not intrinsically generate output.",
    "Processes or regulates logic/signals": "Excluded — It represents processing but does not execute logic.",
    "Transforms or modifies internal state": "Excluded — It has no internal state to change.",
    "Interacts with humans directly": "Included — Designed for humans to view, interpret, and use in real-time.",
    "Part of a larger system": "Excluded — While often embedded in documents or systems, its identity is not system-bound.",
    "Autonomous in function": "Excluded — It requires interpretation; does not operate independently.",
    "System-critical": "Excluded — Rarely a critical system component; a tool for understanding and design.",
    "Symbolic / representational": "Included — Encodes logic or decision flows using abstract symbols.",
    "Communicative": "Included — The primary purpose is to communicate structure or logic.",
    "Logical / rule-based": "Included — Follows conventions like decision trees, branching logic.",
    "Hierarchical / modular": "Included — Can represent nested or modular processes.",
    "Behavior-guiding": "Included — Used to instruct or constrain actions (e.g., in training or design).",
    "Self-referential / meta-conceptual": "Excluded — Does not describe or encode itself.",
    "Temporal": "Excluded — It shows sequencing but is not inherently time-based.",
    "Contextual abstraction": "Included — Meaning can change across software engineering, business analysis, etc.",
    "Socially / culturally constructed": "Included — Diagram conventions arise from shared technical and communicative norms.",
    "Defined by a group/system": "Included — Standardized symbols are maintained by technical communities.",
    "Linked to identity or role": "Excluded — A flowchart does not define the identity of users or groups.",
    "Regulated / governed": "Excluded — No institutional regulation governs flowcharts directly.",
    "Teachable / transmissible": "Included — Widely taught in education and training contexts.",
    "Visible": "Included — Its utility depends on being visually rendered and interpreted.",
    "Context-sensitive": "Included — Interpretation depends on the domain (software, logic, business modeling).",
    "Widely known": "Included — Commonly used across technical and educational fields."
  },
  "encoding_notes": "This corrected encoding positions the flowchart as a visual symbolic representation of logical processes. It is primarily abstract and social in nature, with a clear human interface. The updated UHT code reflects the full set of conceptual and social dependencies without introducing unjustified functional or physical traits.",
  "image": "images/flowchart.png"
}

,
{
  "entity": "If-Then Logic Rule",
  "uht_code": "4000FDDD",
  "image_url": "/validation_set/images/if_then_logic_rule.png",
  "traits": {
    "physical": [
      "Man-made / synthetic"
    ],
    "functional": [],
    "abstract": [
      "Symbolic / representational",
      "Communicative",
      "Logical / rule-based",
      "Hierarchical / modular",
      "Behavior-guiding",
      "Self-referential / meta-conceptual",
      "Contextual abstraction"
    ],
    "social": [
      "Socially / culturally constructed",
      "Defined by a group/system",
      "Regulated / governed",
      "Teachable / transmissible",
      "Visible",
      "Widely known"
    ]
  },
  "feedback": {
    "Physical object": "Excluded — The rule is a concept, not a tangible object. Its physical form is a representation of the concept.",
    "Man-made / synthetic": "Included — It is a human-created logical construct with a defined syntax and function.",
    "Biological or biologically-inspired": "Excluded — It does not mimic or derive from biological systems.",
    "Fixed/static": "Excluded — As a conceptual entity, it has no spatial immobility in the physical sense.",
    "Structural": "Excluded — Its structure is conceptual (syntax, grammar, nesting), not physically load-bearing.",
    "Perceptible": "Excluded — It is not perceived physically, but intellectually or semantically through its representation.",
    "Material form": "Excluded — It is a formal concept, not composed of matter.",
    "Passive": "Excluded — This trait is not meaningfully applicable to a conceptual entity.",
    "Purposeful / intentional": "Excluded — A rule is a statement of a relationship; its purpose is assigned by the system it is part of, not intrinsic to the rule itself.",
    "Emits output / produces effect": "Excluded — The rule itself does not generate output; it is a precondition for a result.",
    "Processes or regulates logic/signals": "Excluded — It is a representation of logic, but does not act or process autonomously.",
    "Transforms or modifies internal state": "Excluded — It is a static, timeless concept and does not have a dynamic internal state.",
    "Interacts with humans directly": "Excluded — It is a static concept, not an interactive interface.",
    "Part of a larger system": "Excluded — It is a building block of a system, but its identity is not system-bound.",
    "Autonomous in function": "Excluded — It requires an external system to evaluate and execute it.",
    "System-critical": "Excluded — It is a component, not an entire system itself, and thus not critical on its own.",
    "Symbolic / representational": "Included — It uses symbols (`if`, `then`, `x`, `y`) to represent a logical relationship.",
    "Communicative": "Included — Its primary purpose is to communicate a conditional relationship between concepts.",
    "Logical / rule-based": "Included — It is the fundamental building block of logical systems and is defined by strict logical rules.",
    "Hierarchical / modular": "Included — Rules can be nested within other rules and combined to form more complex systems.",
    "Behavior-guiding": "Included — Its primary purpose is to guide the behavior of a system or agent based on specific conditions.",
    "Self-referential / meta-conceptual": "Included — It can be used to describe or reference other rules or logical systems.",
    "Temporal": "Excluded — It is a timeless concept, even if it is used to describe time-based events.",
    "Contextual abstraction": "Included — Its meaning and validity are dependent on the context and domain of its application.",
    "Socially / culturally constructed": "Included — The concepts of formal logic and the symbols used are products of human development.",
    "Defined by a group/system": "Included — The rules of formal logic and the standards of its use are defined by the relevant community (e.g., computer science, philosophy).",
    "Linked to identity or role": "Excluded — It does not define the identity or role of a person or group.",
    "Regulated / governed": "Included — The use of a logic rule is governed by formal proof systems and a set of shared rules.",
    "Teachable / transmissible": "Included — The concept is a fundamental unit of knowledge that can be taught and transmitted.",
    "Visible": "Included — It is presented in a visual form to be read and understood.",
    "Context-sensitive": "Excluded — This trait is more aptly described by 'Contextual abstraction' in the abstract layer.",
    "Widely known": "Included — The basic concept of 'If-Then' is a globally recognized and foundational idea."
  },
  "encoding_notes": "This encoding captures the If-Then Logic Rule as a purely abstract, human-created conceptual entity. It is defined by its symbolic, logical, and social properties, and its core function is to guide behavior, a key distinction from other abstract entities. The resulting code reflects its lack of physical and functional traits, with high density in the abstract and social layers.",
  "image": "images/if_then_logic_rule.png"
}
,
{
  "entity": "Mathematical Equation",
  "uht_code": "408CF1DF",
  "image_url": "/validation_set/images/mathematical_equation.png",
  "traits": {
    "physical": [
      "Man-made / synthetic"
    ],
    "functional": [
      "Purposeful / intentional",
      "Interacts with humans directly",
      "Part of a larger system"
    ],
    "abstract": [
      "Symbolic / representational",
      "Communicative",
      "Logical / rule-based",
      "Hierarchical / modular",
      "Contextual abstraction"
    ],
    "social": [
      "Socially / culturally constructed",
      "Defined by a group/system",
      "Regulated / governed",
      "Teachable / transmissible",
      "Visible",
      "Context-sensitive",
      "Widely known"
    ]
  },
  "feedback": {
    "Physical object": "Excluded — The equation itself is not a tangible object; it exists abstractly.",
    "Man-made / synthetic": "Included — The form and structure of equations are human-constructed symbolic conventions.",
    "Biological or biologically-inspired": "Excluded — There is no bio-mimicry or organic origin involved.",
    "Fixed/static": "Excluded — Equations may represent dynamic systems and are not inherently fixed in form or implication.",
    "Structural": "Excluded — Not a load-bearing or physically structural element.",
    "Perceptible": "Excluded — Visibility arises from rendering (e.g., on paper), not intrinsic to the equation itself.",
    "Material form": "Excluded — It is not composed of matter; it is a conceptual structure.",
    "Passive": "Excluded — Not meaningfully applicable to abstract representations.",
    "Purposeful / intentional": "Included — Equations are intentionally designed to express relationships and constraints.",
    "Emits output / produces effect": "Excluded — An equation itself does not generate a signal or effect outside of its interpretation.",
    "Processes or regulates logic/signals": "Excluded — It represents logic, but does not act or process autonomously.",
    "Transforms or modifies internal state": "Excluded — Static by nature unless interpreted or manipulated externally.",
    "Interacts with humans directly": "Included — Created for and used by humans to convey or derive meaning.",
    "Part of a larger system": "Included — Exists within mathematical, scientific, or logical frameworks.",
    "Autonomous in function": "Excluded — Requires external interpretation or manipulation to be active.",
    "System-critical": "Excluded — While often important, it is not irreducibly essential to any one system.",
    "Symbolic / representational": "Included — Its function is explicitly symbolic; it stands in for relationships or models.",
    "Communicative": "Included — Equations convey formal meaning via symbolic language.",
    "Logical / rule-based": "Included — Their validity and interpretation are strictly governed by mathematical rules.",
    "Hierarchical / modular": "Included — Equations can contain nested expressions and subcomponents (modular structure).",
    "Behavior-guiding": "Excluded — Not designed to guide behavior directly (like laws or instructions).",
    "Self-referential / meta-conceptual": "Excluded — Some equations are, but this is not typical or essential.",
    "Temporal": "Excluded — Most equations are atemporal unless modeling time explicitly.",
    "Contextual abstraction": "Included — Meaning may change based on symbolic context, domain assumptions, or notation system.",
    "Socially / culturally constructed": "Included — The concept and notation of equations are created and maintained by cultures and disciplines.",
    "Defined by a group/system": "Included — Meaning and validity arise from being defined within formal systems (e.g., math, physics).",
    "Linked to identity or role": "Excluded — Not identity-bearing or role-specific in typical usage.",
    "Regulated / governed": "Included — Usage governed by syntactic and semantic rules of formal disciplines.",
    "Teachable / transmissible": "Included — Fundamental unit in mathematical and scientific education.",
    "Visible": "Included — Commonly represented in visual symbolic form.",
    "Context-sensitive": "Included — Interpretation depends on mathematical context (e.g., `x = y` in algebra vs. logic).",
    "Widely known": "Included — The idea of an equation is globally recognized and foundational."
  },
  "encoding_notes": "This encoding captures the equation as a symbolic, rule-based, communicative structure situated within formal systems and cultural transmission. It is not physical or agentive, but it plays a vital abstract and social role in human knowledge systems.",
  "image": "images/mathematical_equation.png"
}

,
{
  "entity": "Metadata Tag",
  "uht_code": "4080F9CF",
  "image_url": "/validation_set/images/metadata_tag.png",
  "traits": {
    "physical": [
      "Man-made / synthetic"
    ],
    "functional": [
      "Purposeful / intentional"
    ],
    "abstract": [
      "Symbolic / representational",
      "Communicative",
      "Logical / rule-based",
      "Hierarchical / modular",
      "Behavior-guiding",
      "Contextual abstraction"
    ],
    "social": [
      "Socially / culturally constructed",
      "Defined by a group/system",
      "Teachable / transmissible",
      "Visible",
      "Context-sensitive",
      "Widely known"
    ]
  },
  "feedback": {
    "Physical object": "Excluded — A metadata tag is not a tangible entity; it exists as an abstract label or marker.",
    "Man-made / synthetic": "Included — Tags are human-defined conventions.",
    "Biological or biologically-inspired": "Excluded — Not biologically modeled.",
    "Fixed/static": "Excluded — Tags can vary by context, application, or data.",
    "Structural": "Excluded — Logical structure only.",
    "Perceptible": "Excluded — Not inherently perceptible outside of representation.",
    "Material form": "Excluded — Exists in data structures, not physical materials.",
    "Passive": "Excluded — A tag itself doesn't exhibit passive physical behavior.",

    "Purposeful / intentional": "Included — Tags are created to classify, mark, or organize data intentionally.",
    "Emits output / produces effect": "Excluded — Does not generate output by itself.",
    "Processes or regulates logic/signals": "Excluded — Does not perform processing.",
    "Transforms or modifies internal state": "Excluded — Tags are descriptors, not state machines.",
    "Interacts with humans directly": "Excluded — Accessed through systems, not inherently interactive.",
    "Part of a larger system": "Excluded — While used in systems, the tag itself is a unit of abstraction, not a subsystem.",
    "Autonomous in function": "Excluded — Tags require context to function meaningfully.",
    "System-critical": "Excluded — Tags support metadata frameworks but are not critical individually.",

    "Symbolic / representational": "Included — Tags symbolically reference categories or attributes.",
    "Communicative": "Included — Tags convey meaning about data.",
    "Logical / rule-based": "Included — Tags often follow naming rules, schemas, or ontologies.",
    "Hierarchical / modular": "Included — Tags may be part of structured vocabularies or hierarchies.",
    "Behavior-guiding": "Included — Tags can guide system or user behavior (e.g., filtering, formatting, access).",
    "Self-referential / meta-conceptual": "Excluded — While related to metadata, the tag itself is not self-referential.",
    "Temporal": "Excluded — Tags are not inherently time-based.",
    "Contextual abstraction": "Included — Tags acquire meaning only within a given schema, system, or domain.",

    "Socially / culturally constructed": "Included — Metadata schemes and tagging vocabularies are socially negotiated.",
    "Defined by a group/system": "Included — Commonly established by institutions, platforms, or standards bodies.",
    "Linked to identity or role": "Excluded — Tags label data, not people.",
    "Regulated / governed": "Excluded — Rarely enforced legally, though schema adherence may be required.",
    "Teachable / transmissible": "Included — Standard tagging practices are teachable.",
    "Visible": "Included — Tags are visible to users, systems, or developers depending on access.",
    "Context-sensitive": "Included — The interpretation of a tag varies by system or domain.",
    "Widely known": "Included — The concept of tagging is pervasive across platforms and domains."
  },
  "encoding_notes": "A metadata tag is a symbolic abstraction used to structure and describe data. It is a communicative and behavior-guiding unit designed for context-dependent interpretation within data systems. Though essential to metadata infrastructure, it is not inherently physical or functional—it is an informational construct embedded in human-made logical and social frameworks.",
  "image": "images/metadata_tag.png"
}

,
{
  "entity": "Programming Language Syntax",
  "uht_code": "4000FDCF",
  "image_url": "/validation_set/images/programming_language_syntax.png",
  "traits": {
    "physical": [
      "Man-made / synthetic"
    ],
    "functional": [],
    "abstract": [
      "Symbolic / representational",
      "Communicative",
      "Logical / rule-based",
      "Hierarchical / modular",
      "Behavior-guiding",
      "Self-referential / meta-conceptual",
      "Contextual abstraction"
    ],
    "social": [
      "Socially / culturally constructed",
      "Defined by a group/system",
      "Teachable / transmissible",
      "Visible",
      "Context-sensitive",
      "Widely known"
    ]
  },
  "feedback": {
    "Physical object": "Excluded — Syntax is an abstract rule system, not a physical object.",
    "Man-made / synthetic": "Included — It is designed by humans through formal language engineering.",
    "Biological or biologically-inspired": "Excluded — Not based on biological principles.",
    "Fixed/static": "Excluded — Syntax changes between versions or dialects.",
    "Structural": "Excluded — Abstract structure only, not physical.",
    "Perceptible": "Excluded — It must be instantiated (e.g., in code) to be observed.",
    "Material form": "Excluded — Not made of matter.",
    "Passive": "Excluded — Does not operate or exist as a passive entity.",
    
    "Purposeful / intentional": "Excluded — It enables purpose but is not purposeful on its own.",
    "Emits output / produces effect": "Excluded — It does not produce output independently.",
    "Processes or regulates logic/signals": "Excluded — Syntax governs structure, not logic execution.",
    "Transforms or modifies internal state": "Excluded — Syntax has no state.",
    "Interacts with humans directly": "Excluded — Interaction is mediated through code, not with the syntax itself.",
    "Part of a larger system": "Excluded — Used in systems, but not structurally dependent.",
    "Autonomous in function": "Excluded — Inert until interpreted.",
    "System-critical": "Excluded — Foundational but not itself critical to system operation.",
    
    "Symbolic / representational": "Included — Uses symbols to represent meaning and structure.",
    "Communicative": "Included — Syntax communicates program logic to humans and machines.",
    "Logical / rule-based": "Included — Defined via formal grammars.",
    "Hierarchical / modular": "Included — Syntax trees and scoping models are modular.",
    "Behavior-guiding": "Included — Dictates allowable program forms.",
    "Self-referential / meta-conceptual": "Included — Syntax can describe itself in meta-grammars.",
    "Temporal": "Excluded — Syntax is structural, not time-based.",
    "Contextual abstraction": "Included — Meaning varies by local context (e.g., indentation, scope).",
    
    "Socially / culturally constructed": "Included — Developed by language communities and institutions.",
    "Defined by a group/system": "Included — Governed by language designers or standardization bodies.",
    "Linked to identity or role": "Excluded — Not identity-defining in itself.",
    "Regulated / governed": "Excluded — Not formally regulated (e.g., by law).",
    "Teachable / transmissible": "Included — Syntax is central in programming education.",
    "Visible": "Included — Realized visually in code, examples, and documentation.",
    "Context-sensitive": "Included — Depends on grammar scope, indentation, and semantic rules.",
    "Widely known": "Included — Ubiquitous in global software and education domains."
  },
  "encoding_notes": "This encoding defines programming language syntax as a symbolic, logical, and socially transmitted abstraction. It is not executable or perceptible by itself, but governs structure across all source code and is widely disseminated through education and tooling. Abstract and social layers are dominant, functional traits excluded by design.",
  "image": "images/programming_language_syntax.png"
}

,
{
  "entity": "Proof (in Logic)",
  "uht_code": "4080FFCF",
  "image_url": "/validation_set/images/proof_in_logic.png",
  "traits": {
    "physical": [
      "Man-made / synthetic"
    ],
    "functional": [
      "Purposeful / intentional"
    ],
    "abstract": [
      "Symbolic / representational",
      "Communicative",
      "Logical / rule-based",
      "Hierarchical / modular",
      "Behavior-guiding",
      "Self-referential / meta-conceptual",
      "Temporal",
      "Contextual abstraction"
    ],
    "social": [
      "Socially / culturally constructed",
      "Defined by a group/system",
      "Teachable / transmissible",
      "Visible",
      "Context-sensitive",
      "Widely known"
    ]
  },
  "feedback": {
    "Physical object": "Excluded — A proof is a formal abstraction, not a tangible thing.",
    "Man-made / synthetic": "Included — Formal proof is an invention of mathematical logic.",
    "Biological or biologically-inspired": "Excluded — Based on abstract reasoning, not biology.",
    "Fixed/static": "Excluded — Proofs are not fixed entities; they are composed and can be revised.",
    "Structural": "Excluded — Structure is logical, not material.",
    "Perceptible": "Excluded — Not inherently perceivable without representation.",
    "Material form": "Excluded — A proof exists independently of any physical medium.",
    "Passive": "Excluded — Does not exhibit passive physical qualities.",
    "Purposeful / intentional": "Included — Constructed to demonstrate or derive a logical conclusion.",
    "Emits output / produces effect": "Excluded — Does not autonomously produce effects.",
    "Processes or regulates logic/signals": "Excluded — Encodes logic but does not process it.",
    "Transforms or modifies internal state": "Excluded — Has no internal state.",
    "Interacts with humans directly": "Excluded — Interpreted by humans, but not interactive itself.",
    "Part of a larger system": "Excluded — While used in systems (e.g., math), it is not a subsystem itself.",
    "Autonomous in function": "Excluded — Requires an interpreter or context to operate.",
    "System-critical": "Excluded — Not inherently critical to any system operation.",
    "Symbolic / representational": "Included — Proofs rely on symbolic language (e.g., logic notation).",
    "Communicative": "Included — Designed to convey formal truth or deduction.",
    "Logical / rule-based": "Included — Derivation strictly follows logical rules.",
    "Hierarchical / modular": "Included — Structured into premises, lemmas, and conclusions.",
    "Behavior-guiding": "Included — Guides reasoning and deductive practices.",
    "Self-referential / meta-conceptual": "Included — Some proofs are about provability or logic itself.",
    "Temporal": "Included — Proofs follow a sequential logical progression.",
    "Contextual abstraction": "Included — Meaning depends on formal system, axioms, and symbols used.",
    "Socially / culturally constructed": "Included — The practice and validation of proof is socially defined.",
    "Defined by a group/system": "Included — Institutionalized in mathematics, philosophy, and CS.",
    "Linked to identity or role": "Excluded — Not inherently tied to identity.",
    "Regulated / governed": "Excluded — Not subject to legal or institutional enforcement.",
    "Teachable / transmissible": "Included — Taught and learned in formal education.",
    "Visible": "Included — Proofs are commonly represented visually or textually.",
    "Context-sensitive": "Included — Interpreted differently across logical systems.",
    "Widely known": "Included — Central to education, logic, and science."
  },
  "encoding_notes": "This encoding positions a logical proof as a fully abstract, intentional construct with formal structure and communicative purpose. It is symbolic, hierarchical, and deeply embedded in social and educational systems, but not a physical or functional actor on its own. The UHT code is identical to 'Concept of Zero' because both are fundamentally abstract tools with the same set of universal traits.",
  "image": "images/proof_in_logic.png"
}
,
{
  "entity": "Scientific Theory",
  "uht_code": "4000FFCF",
  "image_url": "/validation_set/images/scientific_theory.png",
  "traits": {
    "physical": [
      "Man-made / synthetic"
    ],
    "functional": [],
    "abstract": [
      "Symbolic / representational",
      "Communicative",
      "Logical / rule-based",
      "Hierarchical / modular",
      "Behavior-guiding",
      "Self-referential / meta-conceptual",
      "Temporal",
      "Contextual abstraction"
    ],
    "social": [
      "Socially / culturally constructed",
      "Defined by a group/system",
      "Teachable / transmissible",
      "Visible",
      "Context-sensitive",
      "Widely known"
    ]
  },
  "feedback": {
    "Physical object": "Excluded — A theory is not a tangible object but a conceptual structure.",
    "Man-made / synthetic": "Included — Theories are human-constructed explanatory models, even when describing natural phenomena.",
    "Biological or biologically-inspired": "Excluded — Theories are logical abstractions, not biologically derived systems.",
    "Fixed/static": "Excluded — Theories evolve with new evidence and paradigms.",
    "Structural": "Excluded — They have internal logical structure but no physical form.",
    "Perceptible": "Excluded — One cannot perceive a theory itself, only its representations.",
    "Material form": "Excluded — Theories are not composed of matter.",
    "Passive": "Excluded — Theories do not exhibit action or reactivity.",
    
    "Purposeful / intentional": "Excluded — Theories are results of intentional design but are not themselves acting entities.",
    "Emits output / produces effect": "Excluded — Theories describe and predict, but do not output or cause events.",
    "Processes or regulates logic/signals": "Excluded — Theories frame logic but do not execute or process it.",
    "Transforms or modifies internal state": "Excluded — Theories are static until revised by agents.",
    "Interacts with humans directly": "Excluded — The interaction is mediated through communication and application.",
    "Part of a larger system": "Excluded — Though used within scientific systems, theories are not embedded components.",
    "Autonomous in function": "Excluded — They require interpretation and application by humans.",
    "System-critical": "Excluded — A theory may be foundational but not structurally essential to system operation.",
    
    "Symbolic / representational": "Included — They represent knowledge using language, models, and diagrams.",
    "Communicative": "Included — Theories convey explanatory structures and predictions.",
    "Logical / rule-based": "Included — A theory must follow coherent, testable, and falsifiable logical rules.",
    "Hierarchical / modular": "Included — Theories are often composed of layered or component ideas (e.g., sub-theories).",
    "Behavior-guiding": "Included — They guide the design of experiments and interpretation of phenomena.",
    "Self-referential / meta-conceptual": "Included — Some theories reflect on the structure of theory itself (e.g., philosophy of science).",
    "Temporal": "Included — Many theories explain time-based processes (e.g., causality, evolution, motion).",
    "Contextual abstraction": "Included — The interpretation of theories depends on methodological, disciplinary, and historical context.",
    
    "Socially / culturally constructed": "Included — The content and acceptance of theories are shaped by historical and cultural frameworks.",
    "Defined by a group/system": "Included — Scientific communities and institutions define, refine, and accept theories.",
    "Linked to identity or role": "Excluded — Theories are not directly tied to individual or group identity.",
    "Regulated / governed": "Excluded — There is no legal or formal regulation of theory content.",
    "Teachable / transmissible": "Included — Core to education and scientific training.",
    "Visible": "Included — Theories are expressed through visual models, publications, and diagrams.",
    "Context-sensitive": "Included — The meaning and applicability of a theory depend on domain-specific assumptions.",
    "Widely known": "Included — Prominent theories are globally recognized in academic, educational, and cultural contexts."
  },
  "encoding_notes": "This encoding captures the Scientific Theory as an abstract, symbolic, and socially embedded framework for explaining phenomena. While it exhibits all abstract traits, its expression and adoption are deeply influenced by social systems. It does not perform functions on its own but guides epistemic and behavioral structures. The code reflects this abstraction-heavy, socially-defined essence with no functional traits.",
  "image": "images/scientific_theory.png"
}

,
{
  "entity": "Story Arc Diagram",
  "uht_code": "4488F9CF",
  "image_url": "/validation_set/images/story_arc_diagram.png",
  "traits": {
    "physical": [
      "Man-made / synthetic",
      "Perceptible"
    ],
    "functional": [
      "Purposeful / intentional",
      "Interacts with humans directly"
    ],
    "abstract": [
      "Symbolic / representational",
      "Communicative",
      "Logical / rule-based",
      "Hierarchical / modular",
      "Behavior-guiding",
      "Contextual abstraction"
    ],
    "social": [
      "Socially / culturally constructed",
      "Defined by a group/system",
      "Teachable / transmissible",
      "Visible",
      "Context-sensitive",
      "Widely known"
    ]
  },
  "feedback": {
    "Physical object": "Excluded — A diagram is not inherently a physical object, though it can be instantiated as one.",
    "Man-made / synthetic": "Included — It is a human-created conceptual and visual tool.",
    "Biological or biologically-inspired": "Excluded — It has no biological basis.",
    "Fixed/static": "Excluded — As a concept, it is not physically immobile or fixed in form.",
    "Structural": "Excluded — It has no material or physical structure.",
    "Perceptible": "Included — It is inherently visual; designed to be seen and interpreted.",
    "Material form": "Excluded — Exists conceptually and visually, not materially.",
    "Passive": "Excluded — This trait is not meaningfully applicable to an abstract entity.",
    "Purposeful / intentional": "Included — It was created for the specific purpose of organizing narrative progression.",
    "Emits output / produces effect": "Excluded — It does not generate any intrinsic output.",
    "Processes or regulates logic/signals": "Excluded — Not a logical processor, only a representational frame.",
    "Transforms or modifies internal state": "Excluded — Has no internal state or reactive function.",
    "Interacts with humans directly": "Included — Designed to be read, interpreted, and manipulated by humans.",
    "Part of a larger system": "Excluded — It may be used in systems (e.g., education), but is not structurally embedded.",
    "Autonomous in function": "Excluded — Requires external interpretation.",
    "System-critical": "Excluded — Not essential to any system’s operation.",
    "Symbolic / representational": "Included — Uses symbols and structure to represent a non-physical concept (narrative tension).",
    "Communicative": "Included — Communicates progression, climax, and resolution.",
    "Logical / rule-based": "Included — Follows a narrative logic (e.g., rising action precedes climax).",
    "Hierarchical / modular": "Included — Typically has nested structures like acts or beats.",
    "Behavior-guiding": "Included — Guides writers’ and analysts’ choices in structuring stories.",
    "Self-referential / meta-conceptual": "Excluded — It represents story structure but does not reflect on itself.",
    "Temporal": "Excluded — Represents temporal progression, but is not itself temporal.",
    "Contextual abstraction": "Included — Its meaning depends on the genre, medium, or narrative model.",
    "Socially / culturally constructed": "Included — Varies across cultures and eras; not a universal form.",
    "Defined by a group/system": "Included — Taught and maintained by literary communities.",
    "Linked to identity or role": "Excluded — Not tied to personal or social identity.",
    "Regulated / governed": "Excluded — No institutional enforcement.",
    "Teachable / transmissible": "Included — Taught in creative writing, media studies, and storytelling.",
    "Visible": "Included — Exists specifically as a visual schema.",
    "Context-sensitive": "Included — Interpretation shifts with genre or story type.",
    "Widely known": "Included — Freytag’s Pyramid, Hero’s Journey, etc. are broadly familiar."
  },
  "encoding_notes": "This encoding captures the Story Arc Diagram as a perceptual, symbolic structure that organizes narrative logic. It is not an active functional entity but rather an interpretive and context-shaped tool for human use. It is widely taught, seen, and socially maintained, making its abstract and social layers prominent.",
  "image": "images/story_arc_diagram.png"
}
,
{
  "entity": "Turing Machine",
  "uht_code": "40F3FFCF",
  "image_url": "/validation_set/images/turing_machine.png",
  "traits": {
    "physical": [
      "Man-made / synthetic"
    ],
    "functional": [
      "Purposeful / intentional",
      "Emits output / produces effect",
      "Processes or regulates logic/signals",
      "Transforms or modifies internal state",
      "Autonomous in function",
      "System-critical"
    ],
    "abstract": [
      "Symbolic / representational",
      "Communicative",
      "Logical / rule-based",
      "Hierarchical / modular",
      "Behavior-guiding",
      "Self-referential / meta-conceptual",
      "Temporal",
      "Contextual abstraction"
    ],
    "social": [
      "Socially / culturally constructed",
      "Defined by a group/system",
      "Teachable / transmissible",
      "Visible",
      "Context-sensitive",
      "Widely known"
    ]
  },
  "feedback": {
    "Physical object": "Excluded — The Turing Machine is a formal abstraction, not a tangible or instantiated object.",
    "Man-made / synthetic": "Included — It is a mathematical construct defined entirely by human design.",
    "Biological or biologically-inspired": "Excluded — It is based on formal computation, not biological models.",
    "Fixed/static": "Excluded — As a concept, it is not spatially constrained or physically fixed.",
    "Structural": "Excluded — Any structure it has is abstract and logical, not material.",
    "Perceptible": "Excluded — The abstract definition is not perceivable without a representation.",
    "Material form": "Excluded — A Turing Machine has no material instantiation unless simulated.",
    "Passive": "Excluded — Not applicable to symbolic or procedural constructs.",
    
    "Purposeful / intentional": "Included — Created to formalize the idea of mechanical computation.",
    "Emits output / produces effect": "Included — Output is intrinsic to its operation via symbols written on tape.",
    "Processes or regulates logic/signals": "Included — It embodies logical computation through defined transitions.",
    "Transforms or modifies internal state": "Included — The core model involves state transitions.",
    "Interacts with humans directly": "Excluded — It is not interactive except through simulations or models.",
    "Part of a larger system": "Excluded — It is conceptually foundational, not a subsystem.",
    "Autonomous in function": "Included — Once defined, it operates deterministically without external input.",
    "System-critical": "Included — It underpins the definition of algorithmic computation and computability theory.",
    
    "Symbolic / representational": "Included — Uses symbols and transition rules to represent logic and state.",
    "Communicative": "Included — It defines a language through accepted symbol manipulation.",
    "Logical / rule-based": "Included — Entirely defined through logical rules and state transitions.",
    "Hierarchical / modular": "Included — It can be extended into modular or multitape machines.",
    "Behavior-guiding": "Included — Guides how abstract machines or algorithms behave over inputs.",
    "Self-referential / meta-conceptual": "Included — Turing Machines can simulate other Turing Machines (universal machines).",
    "Temporal": "Included — Operates step by step across time as transitions progress.",
    "Contextual abstraction": "Included — Behavior and interpretation depend on symbol sets and defined transitions.",
    
    "Socially / culturally constructed": "Included — Formalized by Turing, shaped and maintained by mathematical communities.",
    "Defined by a group/system": "Included — Its definition is standardized in theoretical computer science.",
    "Linked to identity or role": "Excluded — It is not tied to personhood or role-based identity.",
    "Regulated / governed": "Excluded — Not subject to institutional or legal regulation.",
    "Teachable / transmissible": "Included — A foundational concept in computation theory curricula.",
    "Visible": "Included — Represented in textbooks, diagrams, or code for comprehension.",
    "Context-sensitive": "Included — Interpretation depends on the specific configuration and tape alphabet.",
    "Widely known": "Included — A canonical symbol of computation theory."
  },
  "encoding_notes": "This encoding recognizes the Turing Machine as a purely formal, symbolic, and logical system. Its purpose, outputs, internal transitions, and autonomy in execution qualify it for inclusion of several key functional traits, while all abstract traits are essential. It is not a physical object, but its social and educational significance is widely acknowledged. The corrected code reflects both theoretical fidelity and alignment with UHT’s minimalist encoding philosophy.",
  "image": "images/turing_machine.png"
}

,
{
  "entity": "3D Printer",
  "uht_code": "DEFE3205",
  "image_url": "/validation_set/images/3d_printer.png",
  "traits": {
    "physical": [
      "Physical object",
      "Man-made / synthetic",
      "Fixed/static",
      "Structural",
      "Perceptible",
      "Material form"
    ],
    "functional": [
      "Purposeful / intentional",
      "Emits output / produces effect",
      "Processes or regulates logic/signals",
      "Transforms or modifies internal state",
      "Interacts with humans directly",
      "Part of a larger system",
      "Autonomous in function"
    ],
    "abstract": [
      "Logical / rule-based",
      "Hierarchical / modular",
      "Temporal"
    ],
    "social": [
      "Visible",
      "Widely known"
    ]
  },
  "feedback": {
    "Physical object": "Included — A bounded physical device with motion systems, electronics, and a structural frame.",
    "Man-made / synthetic": "Included — Designed and assembled using engineered components and software.",
    "Biological or biologically-inspired": "Excluded — The device itself does not operate based on biological models.",
    "Fixed/static": "Included — Typically stationary during use and installed in a stable location.",
    "Structural": "Included — Print head motion and print bed alignment depend on mechanical structure.",
    "Perceptible": "Included — Operation is audible and visible, often observable through transparent casings.",
    "Material form": "Included — Constructed from durable components, including plastic, metal, and motors.",
    "Passive": "Excluded — Performs active mechanical and thermal operations.",
    
    "Purposeful / intentional": "Included — Designed specifically to fabricate objects from digital files.",
    "Emits output / produces effect": "Included — Produces physical objects through additive manufacturing.",
    "Processes or regulates logic/signals": "Included — Interprets and executes machine code (e.g., G-code).",
    "Transforms or modifies internal state": "Included — Updates progress state, adjusts heat and position dynamically.",
    "Interacts with humans directly": "Included — Users load files, calibrate, and monitor prints.",
    "Part of a larger system": "Included — Often integrated into digital design and fabrication workflows.",
    "Autonomous in function": "Included — Completes tasks once initiated without user involvement.",
    "System-critical": "Excluded — Important but not universally critical to broader infrastructures.",
    
    "Symbolic / representational": "Excluded — Its outputs are physical, not symbolic.",
    "Communicative": "Excluded — Not designed for message transmission.",
    "Logical / rule-based": "Included — Operations follow formal rules and structured code.",
    "Hierarchical / modular": "Included — Internally modular (print head, platform) and conceptually layered (files, layers, axes).",
    "Behavior-guiding": "Excluded — Doesn’t prescribe human action or decisions.",
    "Self-referential / meta-conceptual": "Excluded — No reflective or representational awareness.",
    "Temporal": "Included — Performs tasks over time with planned sequences.",
    "Contextual abstraction": "Excluded — Purpose remains consistent regardless of symbolic context.",
    
    "Socially / culturally constructed": "Excluded — Defined by function, not cultural category.",
    "Defined by a group/system": "Excluded — Standards exist, but not semantically defined by social consensus.",
    "Linked to identity or role": "Excluded — Not inherently tied to identity.",
    "Regulated / governed": "Excluded — Devices may be certified, but regulation is not intrinsic.",
    "Teachable / transmissible": "Excluded — Knowledge can be taught, but that is not a core trait of the machine.",
    "Visible": "Included — Designed for user visibility and monitoring.",
    "Context-sensitive": "Excluded — Functions uniformly regardless of social or environmental context.",
    "Widely known": "Included — Recognized broadly in consumer, educational, and industrial contexts."
  },
  "encoding_notes": "This encoding reflects the 3D printer as a digitally controlled, semi-autonomous fabrication machine that transforms formal instruction sets into physical output. Its traits emphasize mechanical structure, functional logic, and integration into larger design systems, while remaining grounded in practical, observable operation.",
  "image": "images/3d_printer.png"
}

,
{
  "entity": "Air Traffic Control Radar",
  "uht_code": "DEF52211",
  "image_url": "/validation_set/images/air_traffic_control_radar.png",
  "traits": {
    "physical": [
      "Physical object",
      "Man-made / synthetic",
      "Fixed/static",
      "Structural",
      "Perceptible",
      "Material form"
    ],
    "functional": [
      "Purposeful / intentional",
      "Emits output / produces effect",
      "Processes or regulates logic/signals",
      "Transforms or modifies internal state",
      "Part of a larger system",
      "System-critical"
    ],
    "abstract": [
      "Logical / rule-based",
      "Temporal"
    ],
    "social": [
      "Regulated / governed",
      "Widely known"
    ]
  },
  "feedback": {
    "Physical object": "Included — The radar system is a tangible installation composed of hardware like antennas, rotors, and enclosures.",
    "Man-made / synthetic": "Included — Fully engineered and constructed by humans for signal detection and tracking.",
    "Biological or biologically-inspired": "Excluded — It does not mimic or derive from biological forms or functions.",
    "Fixed/static": "Included — Typically mounted at permanent or semi-permanent locations like airports or control stations.",
    "Structural": "Included — Function depends on mechanical structure (e.g., parabolic dish or phased array orientation).",
    "Perceptible": "Included — The radar array and support structures are visible to observers.",
    "Material form": "Included — Constructed from physical materials like steel, composite, and electrical components.",
    "Passive": "Excluded — It actively transmits radio signals and processes returns.",
    "Purposeful / intentional": "Included — Specifically designed to monitor and guide aircraft through detection and tracking.",
    "Emits output / produces effect": "Included — Emits electromagnetic pulses and outputs data to controllers and systems.",
    "Processes or regulates logic/signals": "Included — Interprets echoes using signal-processing algorithms and tracking software.",
    "Transforms or modifies internal state": "Included — Continuously updates aircraft positions, headings, and tracking metadata.",
    "Interacts with humans directly": "Excluded — Operated by humans but not interacted with directly by general users (e.g., pilots, passengers).",
    "Part of a larger system": "Included — Integrated into national and international air traffic control infrastructure.",
    "Autonomous in function": "Excluded — Typically requires operator oversight and control.",
    "System-critical": "Included — A foundational component of aviation safety and airspace coordination.",
    "Symbolic / representational": "Excluded — It does not represent ideas or concepts symbolically.",
    "Communicative": "Excluded — It sends signals, but not for abstract or symbolic communication.",
    "Logical / rule-based": "Included — Operates under strict signal-processing rules and tracking logic.",
    "Hierarchical / modular": "Excluded — While built from subsystems, it is not semantically modular in identity.",
    "Behavior-guiding": "Excluded — Provides input to guide decisions but does not prescribe behavior itself.",
    "Self-referential / meta-conceptual": "Excluded — Does not model itself or operate at a meta-conceptual level.",
    "Temporal": "Included — Timing is essential to its operation (e.g., pulse repetition intervals, Doppler shifts).",
    "Contextual abstraction": "Excluded — Operates in fixed physical/logical contexts, not cultural or interpretive ones.",
    "Socially / culturally constructed": "Excluded — Its function is technical and regulatory, not socially symbolic.",
    "Defined by a group/system": "Excluded — Standardized, but not defined in its identity by group membership.",
    "Linked to identity or role": "Excluded — Does not inherently define or carry personal or group identity.",
    "Regulated / governed": "Included — Operation is strictly governed by aviation and communications authorities.",
    "Teachable / transmissible": "Excluded — It is not itself a teaching device or educational artifact.",
    "Visible": "Excluded — The structure is visible, but its function and semantics are not inherently visible.",
    "Context-sensitive": "Excluded — Operates based on signal logic, not social or semantic context.",
    "Widely known": "Included — The concept of 'radar' is broadly recognized across technical and public domains."
  },
  "encoding_notes": "Air Traffic Control Radar is encoded as a regulated, fixed-location signal system that emits, processes, and updates tracking data in real-time. It is part of a broader aviation safety infrastructure, uses formal timing logic, and is widely known but not symbolic or identity-linked. Autonomous and communicative traits are excluded due to operator control and lack of symbolic expression. Final UHT code DEF52211 correctly includes regulated and known status in the social layer.",
  "image": "images/air_traffic_control_radar.png"
}

,
{
  "entity": "Autonomous Drone",
  "uht_code": "CEF67217",
  "image_url": "/validation_set/images/autonomous_drone.png",
  "traits": {
    "physical": [
      "Physical object",
      "Man-made / synthetic",
      "Structural",
      "Perceptible",
      "Material form"
    ],
    "functional": [
      "Purposeful / intentional",
      "Emits output / produces effect",
      "Processes or regulates logic/signals",
      "Transforms or modifies internal state",
      "Part of a larger system",
      "Autonomous in function"
    ],
    "abstract": [
      "Communicative",
      "Logical / rule-based",
      "Hierarchical / modular",
      "Temporal"
    ],
    "social": [
      "Regulated / governed",
      "Visible",
      "Context-sensitive",
      "Widely known"
    ]
  },
  "feedback": {
    "Physical object": "Included — The drone has a tangible, embodied form with motors, frame, and sensors.",
    "Man-made / synthetic": "Included — Fully engineered and constructed using synthetic components.",
    "Biological or biologically-inspired": "Excluded — It does not mimic biological structure or behavior.",
    "Fixed/static": "Excluded — It is a mobile aerial system, not stationary.",
    "Structural": "Included — Rotor arm layout, center of mass, and frame design are essential to function.",
    "Perceptible": "Included — Visibly apparent and audible during flight.",
    "Material form": "Included — Made from plastics, metals, and composites.",
    "Passive": "Excluded — It is an active system that generates thrust and processes information.",
    "Purposeful / intentional": "Included — Designed to carry out defined tasks (e.g., surveillance, delivery).",
    "Emits output / produces effect": "Included — Produces lift, image data, signals, or environmental effects.",
    "Processes or regulates logic/signals": "Included — Uses onboard logic to interpret data and navigate.",
    "Transforms or modifies internal state": "Included — Adapts internal flight states and behaviors (e.g., hover, reroute).",
    "Interacts with humans directly": "Excluded — Indirect interaction only; not a human interface device.",
    "Part of a larger system": "Included — Often linked to fleet control, airspace systems, or data networks.",
    "Autonomous in function": "Included — Capable of independent operation without real-time human input.",
    "System-critical": "Excluded — Important but typically not indispensable in the overall system.",
    "Symbolic / representational": "Excluded — Not symbolic; used for function, not representation.",
    "Communicative": "Included — Sends telemetry, video, and status updates to human or system receivers.",
    "Logical / rule-based": "Included — Operates by programmed instructions, rules, or constraints.",
    "Hierarchical / modular": "Included — Composed of defined functional modules (e.g., flight control, camera, sensors).",
    "Behavior-guiding": "Excluded — Does not instruct or guide the behavior of others.",
    "Self-referential / meta-conceptual": "Excluded — Does not analyze or reflect on its own operation.",
    "Temporal": "Included — Flight operation and control loops are deeply time-dependent.",
    "Contextual abstraction": "Excluded — Adapts to physical environment but not abstract cultural context.",
    "Socially / culturally constructed": "Excluded — Primarily technical and not defined by cultural meaning.",
    "Defined by a group/system": "Excluded — Operates in systems but not semantically defined by group identity.",
    "Linked to identity or role": "Excluded — Not intrinsically tied to a personal or group role.",
    "Regulated / governed": "Included — Subject to aviation and UAV operation laws and airspace protocols.",
    "Teachable / transmissible": "Excluded — Not inherently educational or transmissible in itself.",
    "Visible": "Included — Visibly detectable when in use.",
    "Context-sensitive": "Included — Responds dynamically to environment (obstacles, GPS conditions, wind).",
    "Widely known": "Included — Publicly recognized and common in commercial, recreational, and security contexts."
  },
  "encoding_notes": "This encoding reflects the autonomous drone as a self-navigating, logic-driven electromechanical system embedded in physical and airspace environments. It outputs, senses, adapts, and communicates within operational and regulatory frameworks. While highly intelligent and visible, it is not symbolic or identity-linked, and is excluded from traits implying personal, cultural, or educational function.",
  "image": "images/autonomous_drone.png"
}

,
{
  "entity": "Blockchain Node",
  "uht_code": "44F7FFFB",
  "image_url": "/validation_set/images/blockchain_node.png",
  "traits": {
    "physical": [
      "Man-made / synthetic",
      "Perceptible"
    ],
    "functional": [
      "Purposeful / intentional",
      "Emits output / produces effect",
      "Processes or regulates logic/signals",
      "Transforms or modifies internal state",
      "Part of a larger system",
      "Autonomous in function",
      "System-critical"
    ],
    "abstract": [
      "Symbolic / representational",
      "Communicative",
      "Logical / rule-based",
      "Hierarchical / modular",
      "Behavior-guiding",
      "Self-referential / meta-conceptual",
      "Temporal",
      "Contextual abstraction"
    ],
    "social": [
      "Socially / culturally constructed",
      "Defined by a group/system",
      "Linked to identity or role",
      "Regulated / governed",
      "Teachable / transmissible",
      "Context-sensitive",
      "Widely known"
    ]
  },
  "feedback": {
    "Physical object": "Excluded — Encoded as a functional process, not the hardware it runs on.",
    "Man-made / synthetic": "Included — Fully engineered software role within distributed systems.",
    "Biological or biologically-inspired": "Excluded — Not modeled on or derived from biological principles.",
    "Fixed/static": "Excluded — Can migrate or be replicated across machines.",
    "Structural": "Excluded — Not physically assembled; structural qualities are abstract.",
    "Perceptible": "Included — Its outputs and logs are observable through tools and interfaces.",
    "Material form": "Excluded — The node is a logical agent, not a materially bounded entity.",
    "Passive": "Excluded — Continuously operates, validates, and communicates.",
    
    "Purposeful / intentional": "Included — Designed with the explicit goal of participating in a blockchain protocol.",
    "Emits output / produces effect": "Included — Contributes to network activity by broadcasting blocks and transactions.",
    "Processes or regulates logic/signals": "Included — Executes consensus and validation logic.",
    "Transforms or modifies internal state": "Included — Updates blockchain state, peer tables, and mempools.",
    "Interacts with humans directly": "Excluded — Interfaces may exist, but it's not designed for direct human interaction.",
    "Part of a larger system": "Included — Operates only within a distributed blockchain ecosystem.",
    "Autonomous in function": "Included — Functions continuously without direct oversight once configured.",
    "System-critical": "Included — The network requires nodes to maintain ledger integrity and consensus.",
    
    "Symbolic / representational": "Included — Represents the distributed ledger state.",
    "Communicative": "Included — Shares and relays protocol-encoded data.",
    "Logical / rule-based": "Included — Operates via strict validation and consensus logic.",
    "Hierarchical / modular": "Included — Includes networking, consensus, and storage modules.",
    "Behavior-guiding": "Included — Enforces protocol rules that constrain participant behavior.",
    "Self-referential / meta-conceptual": "Included — Tracks its own sync state, peers, and role in the network.",
    "Temporal": "Included — Functions across block intervals and uses timestamps.",
    "Contextual abstraction": "Included — Only meaningful within specific blockchain rulesets and topologies.",
    
    "Socially / culturally constructed": "Included — Emerges from and is embedded in socio-technical systems.",
    "Defined by a group/system": "Included — Exists per formal protocol definitions (e.g., Ethereum client).",
    "Linked to identity or role": "Included — Some nodes represent staking roles, validators, or organizational actors.",
    "Regulated / governed": "Included — Often subject to internal governance or legal scrutiny.",
    "Teachable / transmissible": "Included — Taught in educational and technical settings; implementations are open-source.",
    "Visible": "Excluded — Node operation is not inherently user-facing or visually present.",
    "Context-sensitive": "Included — Behavior shifts depending on role (e.g., archival, light, validator).",
    "Widely known": "Included — Well-recognized and discussed in technical and public discourse."
  },
  "encoding_notes": "This encoding treats the blockchain node as a logical and functional software entity within a decentralized system. Physical and visible traits are excluded to preserve distinction between software role and physical host. High trait density in functional, abstract, and social layers reflects the node’s role as a rule-enforcing, symbolic actor embedded in cultural and governance systems.",
  "image": "images/blockchain_node.png"
}

,
{
  "entity": "Car Ignition System",
  "uht_code": "DEFC2005",
  "image_url": "/validation_set/images/car_ignition_system.png",
  "traits": {
    "physical": [
      "Physical object",
      "Man-made / synthetic",
      "Fixed/static",
      "Structural",
      "Perceptible",
      "Material form"
    ],
    "functional": [
      "Purposeful / intentional",
      "Emits output / produces effect",
      "Processes or regulates logic/signals",
      "Transforms or modifies internal state",
      "Interacts with humans directly",
      "Part of a larger system"
    ],
    "abstract": [
      "Logical / rule-based"
    ],
    "social": [
      "Visible",
      "Widely known"
    ]
  },
  "feedback": {
    "Physical object": "Included — A tangible hardware assembly within the car's engine system.",
    "Man-made / synthetic": "Included — Designed and manufactured entirely by humans.",
    "Biological or biologically-inspired": "Excluded — Purely mechanical/electrical in design and function.",
    "Fixed/static": "Included — Installed in a permanent position within the vehicle.",
    "Structural": "Included — Composed of interconnected housing, switches, and wiring.",
    "Perceptible": "Included — User-facing interface elements such as key slot or start button.",
    "Material form": "Included — Constructed from metal, plastic, and electronic components.",
    "Passive": "Excluded — Actively engages the ignition and control circuitry.",
    
    "Purposeful / intentional": "Included — Built to initiate the engine's start sequence.",
    "Emits output / produces effect": "Included — Produces ignition spark and system activation signals.",
    "Processes or regulates logic/signals": "Included — Especially in modern cars with anti-theft and diagnostics.",
    "Transforms or modifies internal state": "Included — Transitions the engine and vehicle systems from 'off' to 'on'.",
    "Interacts with humans directly": "Included — Requires human input (turn key, press button, detect key fob).",
    "Part of a larger system": "Included — Functions within the broader vehicle electrical and mechanical system.",
    "Autonomous in function": "Excluded — Requires a deliberate user action to initiate.",
    "System-critical": "Excluded — Critical for start, but bypassable with overrides in some systems.",
    
    "Symbolic / representational": "Excluded — Not a representational or metaphorical device.",
    "Communicative": "Excluded — Interfaces with system but not designed to transmit symbolic messages.",
    "Logical / rule-based": "Included — Executes startup conditions and safety logic.",
    "Hierarchical / modular": "Excluded — Not abstractly modular beyond physical subcomponents.",
    "Behavior-guiding": "Excluded — Does not guide behavior directly.",
    "Self-referential / meta-conceptual": "Excluded — No self-monitoring or conceptual tracking.",
    "Temporal": "Excluded — Functions instantly; not defined by time management.",
    "Contextual abstraction": "Excluded — Role is consistent across vehicle contexts.",
    
    "Socially / culturally constructed": "Excluded — Functionally standardized across cultures.",
    "Defined by a group/system": "Excluded — Standardized by engineering, not semantically.",
    "Linked to identity or role": "Excluded — Not associated with personal or social roles.",
    "Regulated / governed": "Excluded — Subject to safety standards, but not an intrinsic regulatory artifact.",
    "Teachable / transmissible": "Excluded — Commonly taught, but not inherently educative.",
    "Visible": "Included — Interface components are user-facing.",
    "Context-sensitive": "Excluded — Performs the same function regardless of environment.",
    "Widely known": "Included — Well-known component of nearly all vehicles."
  },
  "encoding_notes": "This encoding treats the ignition system as a functional component embedded in a car's architecture. It scores strongly in the physical and functional layers due to its material presence, human interaction, and purposeful activation of electrical processes. A single abstract trait is included for its logical role in validating startup conditions. Social traits are limited to public recognizability and physical visibility.",
  "image": "images/car_ignition_system.png"
}

,
{
  "entity": "Coffee Machine",
  "uht_code": "DEFA2205",
  "image_url": "/validation_set/images/coffee_machine.png",
  "traits": {
    "physical": [
      "Physical object",
      "Man-made / synthetic",
      "Fixed/static",
      "Structural",
      "Perceptible",
      "Material form"
    ],
    "functional": [
      "Purposeful / intentional",
      "Emits output / produces effect",
      "Processes or regulates logic/signals",
      "Transforms or modifies internal state",
      "Interacts with humans directly",
      "Autonomous in function"
    ],
    "abstract": [
      "Logical / rule-based",
      "Temporal"
    ],
    "social": [
      "Visible",
      "Widely known"
    ]
  },
  "feedback": {
    "Physical object": "Included — A tangible appliance commonly placed on kitchen counters or office stations.",
    "Man-made / synthetic": "Included — Fully designed and manufactured using human-made materials and components.",
    "Biological or biologically-inspired": "Excluded — No reference to biological systems or processes.",
    "Fixed/static": "Included — Typically remains in a fixed location while in use.",
    "Structural": "Included — Internal layout (water tank, heater, brew chamber) is essential to its operation.",
    "Perceptible": "Included — Features visible buttons, displays, and output of aroma, sound, and liquid.",
    "Material form": "Included — Constructed from durable plastics, metals, and glass.",
    "Passive": "Excluded — Performs active operations like heating and pumping during brewing.",
    
    "Purposeful / intentional": "Included — Designed specifically to produce brewed coffee.",
    "Emits output / produces effect": "Included — Delivers hot liquid (coffee) as functional output.",
    "Processes or regulates logic/signals": "Included — Controls temperature, brewing cycle, and possibly programmable settings.",
    "Transforms or modifies internal state": "Included — Water is heated and transformed into brewed coffee; internal components track brewing stage.",
    "Interacts with humans directly": "Included — Operated via buttons or touchscreen; gives feedback via light, sound, or display.",
    "Part of a larger system": "Excluded — Typically functions independently, not networked or integrative.",
    "Autonomous in function": "Included — Can complete brewing cycles without human intervention after start.",
    "System-critical": "Excluded — Not essential to any broader infrastructure.",
    
    "Symbolic / representational": "Excluded — Its outputs and states are functional, not representational.",
    "Communicative": "Excluded — Does not convey symbolic or coded information.",
    "Logical / rule-based": "Included — Brewing behavior follows defined internal logic and sequences.",
    "Hierarchical / modular": "Excluded — While componentized, it's not abstractly modular in behavior.",
    "Behavior-guiding": "Excluded — May support routine, but doesn’t semantically guide behavior.",
    "Self-referential / meta-conceptual": "Excluded — No awareness or representation of its own function.",
    "Temporal": "Included — Brewing involves time tracking (preheat, brew, delay-start).",
    "Contextual abstraction": "Excluded — Function remains consistent across contexts.",
    
    "Socially / culturally constructed": "Excluded — Common across many cultures without culturally determined semantics.",
    "Defined by a group/system": "Excluded — Not defined or classified by social systems.",
    "Linked to identity or role": "Excluded — No intrinsic link to social roles.",
    "Regulated / governed": "Excluded — May conform to standards, but not semantically governed.",
    "Teachable / transmissible": "Excluded — Can be taught to use, but not itself a teaching object.",
    "Visible": "Included — Displayed prominently; design aesthetics often emphasize visibility.",
    "Context-sensitive": "Excluded — Operates the same across environments.",
    "Widely known": "Included — Recognized globally in both domestic and commercial spaces."
  },
  "encoding_notes": "This encoding captures the coffee machine as a semi-autonomous, user-facing appliance with clearly structured physical and logical behavior. Its traits emphasize function, perceptibility, and ubiquity, while abstract and social characteristics remain minimal due to its utilitarian purpose.",
  "image": "images/coffee_machine.png"
}

,
{
  "entity": "Digital Alarm Clock",
  "uht_code": "DEF82205",
  "image_url": "/validation_set/images/digital_alarm_clock.png",
  "traits": {
    "physical": [
      "Physical object",
      "Man-made / synthetic",
      "Fixed/static",
      "Structural",
      "Perceptible",
      "Material form"
    ],
    "functional": [
      "Purposeful / intentional",
      "Emits output / produces effect",
      "Processes or regulates logic/signals",
      "Transforms or modifies internal state",
      "Interacts with humans directly"
    ],
    "abstract": [
      "Logical / rule-based",
      "Temporal"
    ],
    "social": [
      "Visible",
      "Widely known"
    ]
  },
  "feedback": {
    "Physical object": "Included — A self-contained physical device typically placed on a surface.",
    "Man-made / synthetic": "Included — Fully designed and manufactured by humans.",
    "Biological or biologically-inspired": "Excluded — Not derived from or mimicking biological systems.",
    "Fixed/static": "Included — Intended to remain in a fixed location (e.g., nightstand).",
    "Structural": "Included — Display, buttons, and casing are mechanically integrated.",
    "Perceptible": "Included — User interacts with its sounds, lights, and visual time display.",
    "Material form": "Included — Composed of plastics, electronics, and visible screens.",
    "Passive": "Excluded — Outputs sounds and light, and performs logic-driven behavior.",
    
    "Purposeful / intentional": "Included — Engineered to track time and wake users.",
    "Emits output / produces effect": "Included — Produces audible alarms and visual indicators.",
    "Processes or regulates logic/signals": "Included — Follows programmed timing and alarm logic.",
    "Transforms or modifies internal state": "Included — Allows setting and changing alarm and time values.",
    "Interacts with humans directly": "Included — Requires user input to set and operate.",
    "Part of a larger system": "Excluded — Typically standalone, not integrated into broader systems.",
    "Autonomous in function": "Excluded — Needs initial setup and operates on schedule.",
    "System-critical": "Excluded — Auxiliary device, not essential for broader operations.",
    
    "Symbolic / representational": "Excluded — Displays numeric time but not symbolically expressive.",
    "Communicative": "Excluded — Delivers alerts, but not symbolic or dialogic communication.",
    "Logical / rule-based": "Included — Uses internal logic to trigger alarms and manage display.",
    "Hierarchical / modular": "Excluded — Simple architecture, not abstractly modular.",
    "Behavior-guiding": "Excluded — May shape routine, but not functionally guiding behavior.",
    "Self-referential / meta-conceptual": "Excluded — Does not reflect on its own operation.",
    "Temporal": "Included — Tracks and responds to linear time.",
    "Contextual abstraction": "Excluded — Operates uniformly regardless of environment.",
    
    "Socially / culturally constructed": "Excluded — Functionally consistent across contexts and not socially constructed.",
    "Defined by a group/system": "Excluded — Product-defined, not by social or institutional consensus.",
    "Linked to identity or role": "Excluded — Not socially identity-bearing.",
    "Regulated / governed": "Excluded — Minimal regulation beyond safety standards.",
    "Teachable / transmissible": "Excluded — Teachable, but not itself a transmissible semantic unit.",
    "Visible": "Included — Designed to be prominently displayed.",
    "Context-sensitive": "Excluded — Function unchanged by setting.",
    "Widely known": "Included — Universally recognized domestic object."
  },
  "encoding_notes": "This encoding captures the digital alarm clock as a physical, standalone device that fulfills timekeeping and alert functions. Its traits are concentrated in the physical and functional layers, with modest abstraction (rule-based and temporal) and socially relevant visibility. Social constructs and symbolic communication are excluded due to its direct, utilitarian design.",
  "image": "images/digital_alarm_clock.png"
}

,
{
  "entity": "Mechanical Clock",
  "uht_code": "DEF42205",
  "image_url": "/validation_set/images/mechanical_clock.png",
  "traits": {
    "physical": [
      "Physical object",
      "Man-made / synthetic",
      "Fixed/static",
      "Structural",
      "Perceptible",
      "Material form"
    ],
    "functional": [
      "Purposeful / intentional",
      "Emits output / produces effect",
      "Processes or regulates logic/signals",
      "Transforms or modifies internal state",
      "Part of a larger system"
    ],
    "abstract": [
      "Logical / rule-based",
      "Temporal"
    ],
    "social": [
      "Visible",
      "Widely known"
    ]
  },
  "feedback": {
    "Physical object": "Included — A tangible mechanical device composed of gears, hands, and casing.",
    "Man-made / synthetic": "Included — Designed and constructed by humans.",
    "Biological or biologically-inspired": "Excluded — Mechanisms are based on physics and engineering, not biology.",
    "Fixed/static": "Included — Generally stationary and not meant to be moved during operation.",
    "Structural": "Included — Its internal operation depends on precise physical structure (gears, springs, escapement).",
    "Perceptible": "Included — Meant to be seen and/or heard (e.g., ticking or chimes).",
    "Material form": "Included — Made from durable, manufactured materials (metal, glass, etc.).",
    "Passive": "Excluded — Actively moves through internal mechanical energy.",
    
    "Purposeful / intentional": "Included — Designed to keep and display time.",
    "Emits output / produces effect": "Included — Shows time visually and sometimes audibly.",
    "Processes or regulates logic/signals": "Included — Internal escapement mechanism regulates consistent time intervals.",
    "Transforms or modifies internal state": "Included — Winding modifies spring tension; mechanisms release energy over time.",
    "Interacts with humans directly": "Excluded — Users observe it but do not interact with it functionally.",
    "Part of a larger system": "Included — May synchronize or be integrated into broader timekeeping or architectural systems.",
    "Autonomous in function": "Excluded — Requires periodic winding or external energy input.",
    "System-critical": "Excluded — Timekeeping is often helpful but not mission-critical in most settings.",
    
    "Symbolic / representational": "Excluded — Not inherently symbolic or abstract.",
    "Communicative": "Excluded — Displays time but not in a communicative or coded way.",
    "Logical / rule-based": "Included — Internally operates on consistent, rule-based mechanical logic.",
    "Hierarchical / modular": "Excluded — Not composed of conceptual modules, only mechanical parts.",
    "Behavior-guiding": "Excluded — It provides information but doesn’t prescribe behavior.",
    "Self-referential / meta-conceptual": "Excluded — Does not reflect on itself or represent abstract systems.",
    "Temporal": "Included — Core function is to represent and track time.",
    "Contextual abstraction": "Excluded — Operates consistently regardless of symbolic or abstract context.",
    
    "Socially / culturally constructed": "Excluded — Functionally universal, not constructed by cultural consensus.",
    "Defined by a group/system": "Excluded — Exists across many systems but not semantically defined by any one.",
    "Linked to identity or role": "Excluded — Not tied to personal or social roles.",
    "Regulated / governed": "Excluded — Some clocks are certified, but the concept isn’t intrinsically governed.",
    "Teachable / transmissible": "Excluded — Can be taught, but this is not central to its form.",
    "Visible": "Included — Deliberately designed to be viewed (often publicly).",
    "Context-sensitive": "Excluded — Displays absolute time, not contextually altered.",
    "Widely known": "Included — Clocks are globally recognized and ubiquitous."
  },
  "encoding_notes": "This encoding reflects the mechanical clock as a traditional timekeeping apparatus, emphasizing its engineered structure, functional logic, and universal recognizability. Abstract traits are limited to its time-based logic, while social traits are included only when visually and culturally universal. It excludes interaction and autonomy due to its passive user interface and reliance on manual winding.",
  "image": "images/mechanical_clock.png"
}

,
{
  "entity": "Pacemaker",
  "uht_code": "FAF72231",
  "image_url": "/validation_set/images/pacemaker.png",
  "traits": {
    "physical": [
      "Physical object",
      "Man-made / synthetic",
      "Biological or biologically-inspired",
      "Fixed/static",
      "Structural",
      "Material form"
    ],
    "functional": [
      "Purposeful / intentional",
      "Emits output / produces effect",
      "Processes or regulates logic/signals",
      "Transforms or modifies internal state",
      "Part of a larger system",
      "Autonomous in function",
      "System-critical"
    ],
    "abstract": [
      "Logical / rule-based",
      "Temporal"
    ],
    "social": [
      "Linked to identity or role",
      "Regulated / governed",
      "Widely known"
    ]
  },
  "feedback": {
    "Physical object": "Included — A tangible, implantable device with distinct physical casing and electrodes.",
    "Man-made / synthetic": "Included — Fully engineered and fabricated using advanced manufacturing processes.",
    "Biological or biologically-inspired": "Included — Functionally replicates a core biological process (cardiac rhythm regulation); design mimics sinoatrial node logic.",
    "Fixed/static": "Included — Surgically implanted and remains in position.",
    "Structural": "Included — Functional integrity depends on its architecture and component placement.",
    "Perceptible": "Excluded — Typically not externally perceivable; embedded and non-sensory.",
    "Material form": "Included — Composed of durable encapsulated materials like titanium or polymer composites.",
    "Passive": "Excluded — Actively monitors cardiac signals and initiates stimulation when needed.",
    "Purposeful / intentional": "Included — Specifically designed to assist or take over cardiac pacing.",
    "Emits output / produces effect": "Included — Generates electrical pulses to stimulate the heart.",
    "Processes or regulates logic/signals": "Included — Senses heart activity and triggers output based on programmed logic.",
    "Transforms or modifies internal state": "Included — Adjusts behavior over time (adaptive pacing, mode changes).",
    "Interacts with humans directly": "Excluded — Functions autonomously without direct interaction.",
    "Part of a larger system": "Included — Integrates with and influences the cardiovascular system.",
    "Autonomous in function": "Included — Once implanted, operates independently under its own regulation.",
    "System-critical": "Included — May be essential for survival or basic health depending on condition.",
    "Symbolic / representational": "Excluded — Not a symbolic or metaphorical device.",
    "Communicative": "Excluded — Does not convey abstract messages; telemetry is secondary.",
    "Logical / rule-based": "Included — Operates on embedded timing and sensing algorithms.",
    "Hierarchical / modular": "Excluded — Has subsystems but not conceptually modular in semantic structure.",
    "Behavior-guiding": "Excluded — Does not prescribe or guide user behavior explicitly.",
    "Self-referential / meta-conceptual": "Excluded — Does not reflect on its own processes or abstract structure.",
    "Temporal": "Included — Timing is fundamental (e.g., refractory periods, pacing intervals).",
    "Contextual abstraction": "Excluded — Operates based on physical context, not abstract social/cultural cues.",
    "Socially / culturally constructed": "Excluded — Grounded in function, not socially defined semantics.",
    "Defined by a group/system": "Excluded — Standardized, but identity isn’t defined by collective system semantics.",
    "Linked to identity or role": "Included — Presence of device alters personal identity role (e.g., ID disclosures, medical protocols); this identity linkage persists structurally.",
    "Regulated / governed": "Included — Subject to strict medical device regulations and clinical protocols.",
    "Teachable / transmissible": "Excluded — Not a teaching tool or semantically transmissible system.",
    "Visible": "Excluded — Usually not externally visible after implantation.",
    "Context-sensitive": "Excluded — Behavior is physiological, not socially contextual.",
    "Widely known": "Included — Broadly recognized across medical, technical, and public domains."
  },
  "encoding_notes": "Encoding reflects the pacemaker as a critical biomedical cybernetic system that emulates natural cardiac rhythm via embedded logic. It is governed, widely recognized, and role-defining for its bearer. Excluded traits are ruled out due to lack of symbolic, communicative, or contextual abstraction functions. The hex code 'FAF72231' preserves alignment with the previously vetted encoding and upholds the minimal-yet-sufficient trait standard.",
  "image": "images/pacemaker.png"
}

,
{
  "entity": "Robotic Arm",
  "uht_code": "FEFE2005",
  "image_url": "/validation_set/images/robotic_arm.png",
  "traits": {
    "physical": [
      "Physical object",
      "Man-made / synthetic",
      "Biological or biologically-inspired",
      "Fixed/static",
      "Structural",
      "Perceptible",
      "Material form"
    ],
    "functional": [
      "Purposeful / intentional",
      "Emits output / produces effect",
      "Processes or regulates logic/signals",
      "Transforms or modifies internal state",
      "Interacts with humans directly",
      "Part of a larger system",
      "Autonomous in function"
    ],
    "abstract": [
      "Logical / rule-based"
    ],
    "social": [
      "Visible",
      "Widely known"
    ]
  },
  "feedback": {
    "Physical object": "Included — A tangible mechanical device occupying space.",
    "Man-made / synthetic": "Included — Fully engineered and constructed by humans.",
    "Biological or biologically-inspired": "Included — Modeled after human or animal limb structures.",
    "Fixed/static": "Included — Anchored in a workspace or robotic base.",
    "Structural": "Included — Mechanical frame and joints are essential to its function.",
    "Perceptible": "Included — Visibly present, often with motion and sound during operation.",
    "Material form": "Included — Made of physical components like actuators, sensors, and joints.",
    "Passive": "Excluded — Actively performs actions through powered control.",
    
    "Purposeful / intentional": "Included — Designed to execute precise tasks.",
    "Emits output / produces effect": "Included — Moves, manipulates, or activates tools.",
    "Processes or regulates logic/signals": "Included — Executes embedded or external control logic.",
    "Transforms or modifies internal state": "Included — Tracks joint angles, motion paths, and status.",
    "Interacts with humans directly": "Included — Especially in collaborative, surgical, or educational contexts.",
    "Part of a larger system": "Included — Often part of a manufacturing cell, lab setup, or robotic suite.",
    "Autonomous in function": "Included — Can execute preprogrammed tasks without live control.",
    "System-critical": "Excluded — Important but often modular or substitutable.",
    
    "Symbolic / representational": "Excluded — A functional tool, not a symbol or metaphor.",
    "Communicative": "Excluded — Does not convey symbolic information unless explicitly programmed to.",
    "Logical / rule-based": "Included — Operates under programmed instructions and constraints.",
    "Hierarchical / modular": "Excluded — Physically modular but not abstractly structured for hierarchy.",
    "Behavior-guiding": "Excluded — Executes behavior but does not guide it.",
    "Self-referential / meta-conceptual": "Excluded — Does not monitor itself conceptually.",
    "Temporal": "Excluded — Operates in time but not time-defined.",
    "Contextual abstraction": "Excluded — Concrete tool, not a contextual abstraction.",
    
    "Socially / culturally constructed": "Excluded — Functionally defined, not socially categorized.",
    "Defined by a group/system": "Excluded — Specification-driven, but not semantically defined by a group.",
    "Linked to identity or role": "Excluded — Not tied to social identity.",
    "Regulated / governed": "Excluded — Safety-regulated but not semantically governed.",
    "Teachable / transmissible": "Excluded — Can be taught about, but not a teaching artifact itself.",
    "Visible": "Included — Usually prominently placed and deliberately observable.",
    "Context-sensitive": "Excluded — Maintains identity across contexts.",
    "Widely known": "Included — Widely recognized as a component of robotics and automation."
  },
  "encoding_notes": "This encoding treats the robotic arm as a programmable, articulated mechanical agent within a functional and physical system. It is bio-inspired and interacts with humans in various domains but is not socially constructed or symbolically expressive. High representation in physical and functional layers reflects its engineered form and behavior.",
  "image": "images/robotic_arm.png"
}

,
{
  "entity": "Smart Thermometer",
  "uht_code": "EEFC2205",
  "image_url": "/validation_set/images/smart_thermometer.png",
  "traits": {
    "physical": [
      "Physical object",
      "Man-made / synthetic",
      "Biological or biologically-inspired",
      "Structural",
      "Perceptible",
      "Material form"
    ],
    "functional": [
      "Purposeful / intentional",
      "Emits output / produces effect",
      "Processes or regulates logic/signals",
      "Transforms or modifies internal state",
      "Interacts with humans directly",
      "Part of a larger system"
    ],
    "abstract": [
      "Logical / rule-based",
      "Temporal"
    ],
    "social": [
      "Visible",
      "Widely known"
    ]
  },
  "feedback": {
    "Physical object": "Included — A tangible, handheld or wearable sensing device.",
    "Man-made / synthetic": "Included — Designed and built entirely through human engineering.",
    "Biological or biologically-inspired": "Included — Often models biological thermoregulation or is used in human health contexts.",
    "Fixed/static": "Excluded — Designed for portability or wearable use.",
    "Structural": "Included — Its internal architecture (sensors, circuits, housing) supports sensing and communication.",
    "Perceptible": "Included — Displayed readings, tactile buttons, and sometimes sound or light alerts.",
    "Material form": "Included — Constructed with durable polymers, metal probes, and embedded electronics.",
    "Passive": "Excluded — Senses input and produces active digital feedback.",
    
    "Purposeful / intentional": "Included — Built to measure and transmit temperature data.",
    "Emits output / produces effect": "Included — Communicates readings via display or wireless connection.",
    "Processes or regulates logic/signals": "Included — Interprets sensor inputs and applies software logic.",
    "Transforms or modifies internal state": "Included — May store readings, update thresholds, or log user data.",
    "Interacts with humans directly": "Included — Displayed feedback, app integration, or direct input.",
    "Part of a larger system": "Included — Often integrated into health monitoring or environmental automation.",
    "Autonomous in function": "Excluded — Typically user-initiated or context-triggered.",
    "System-critical": "Excluded — Helpful but not generally essential for broader system survival.",
    
    "Symbolic / representational": "Excluded — Displays numerical data but not symbolically abstract.",
    "Communicative": "Excluded — Communicates data but not via symbolic or language-based systems.",
    "Logical / rule-based": "Included — Operates based on thresholds, timing, and rules (e.g., fever alerts).",
    "Hierarchical / modular": "Excluded — May contain components, but not semantically modular.",
    "Behavior-guiding": "Excluded — Suggests behavior (e.g., seek help) but does not encode guidance.",
    "Self-referential / meta-conceptual": "Excluded — Does not reflect on its own data or process.",
    "Temporal": "Included — Time-stamped data logging or historical trend tracking is common.",
    "Contextual abstraction": "Excluded — Operates on concrete measurement rather than symbolic context.",
    
    "Socially / culturally constructed": "Excluded — Defined by technical function, not cultural negotiation.",
    "Defined by a group/system": "Excluded — Not semantically defined by institutions.",
    "Linked to identity or role": "Excluded — Not inherently tied to social roles.",
    "Regulated / governed": "Excluded — May be subject to regulation, but not intrinsic to semantic identity.",
    "Teachable / transmissible": "Excluded — Use is teachable, but the device is not a teaching tool itself.",
    "Visible": "Included — Designed to display outputs and status visibly.",
    "Context-sensitive": "Excluded — Measurement behavior remains stable across settings.",
    "Widely known": "Included — Common in healthcare, parenting, and smart home contexts."
  },
  "encoding_notes": "This encoding reflects a smart thermometer as a biologically contextual, digitally enabled tool that senses, interprets, and communicates temperature. Physical and functional layers dominate due to its engineered and interactive role, while abstraction is limited to logic and temporality. Social traits are limited to visibility and general public familiarity.",
  "image": "images/smart_thermometer.png"
}

,
{
  "entity": "Smoke Detector",
  "uht_code": "DEF72215",
  "image_url": "/validation_set/images/smoke_detector.png",
  "traits": {
    "physical": [
      "Physical object",
      "Man-made / synthetic",
      "Fixed/static",
      "Structural",
      "Perceptible",
      "Material form"
    ],
    "functional": [
      "Purposeful / intentional",
      "Emits output / produces effect",
      "Processes or regulates logic/signals",
      "Transforms or modifies internal state",
      "Part of a larger system",
      "Autonomous in function",
      "System-critical"
    ],
    "abstract": [
      "Logical / rule-based",
      "Temporal"
    ],
    "social": [
      "Regulated / governed",
      "Visible",
      "Widely known"
    ]
  },
  "feedback": {
    "Physical object": "Included — A mounted, enclosed sensing unit occupying physical space.",
    "Man-made / synthetic": "Included — Fully engineered and mass-produced.",
    "Biological or biologically-inspired": "Excluded — Detection based on photoelectric or ionization physics, not biology.",
    "Fixed/static": "Included — Installed on ceilings or walls for permanent operation.",
    "Structural": "Included — Internal chamber and layout affect sensing performance.",
    "Perceptible": "Included — Alarms are loud and visible, with obvious device presence.",
    "Material form": "Included — Plastic housing and embedded electronics.",
    "Passive": "Excluded — Continuously monitors and emits alerts; not inert.",
    
    "Purposeful / intentional": "Included — Built for the specific task of smoke detection and alert.",
    "Emits output / produces effect": "Included — Produces audible (and often visual) alarm signals.",
    "Processes or regulates logic/signals": "Included — Uses logic to detect smoke density and decide threshold events.",
    "Transforms or modifies internal state": "Included — Tracks alarm states, test results, or battery conditions.",
    "Interacts with humans directly": "Excluded — Has minimal interaction beyond alarm sound and test button.",
    "Part of a larger system": "Included — May be networked with other detectors or security systems.",
    "Autonomous in function": "Included — Operates continuously without manual input.",
    "System-critical": "Included — Essential for life safety in many regulated spaces.",
    
    "Symbolic / representational": "Excluded — Operates functionally, not as a symbol.",
    "Communicative": "Excluded — Communicates alerts but not through symbolic content.",
    "Logical / rule-based": "Included — Triggers alarm only when predefined thresholds are exceeded.",
    "Hierarchical / modular": "Excluded — Usually not semantically modular, though hardware may be.",
    "Behavior-guiding": "Excluded — May prompt action but does not prescribe behavior.",
    "Self-referential / meta-conceptual": "Excluded — No reflective logic or awareness of self.",
    "Temporal": "Included — Constant time-based sensing, with potential logging features.",
    "Contextual abstraction": "Excluded — Operates independently of symbolic or social context.",
    
    "Socially / culturally constructed": "Excluded — Function defined by physics, not social meaning.",
    "Defined by a group/system": "Excluded — While manufactured to spec, not semantically group-defined.",
    "Linked to identity or role": "Excluded — Not identity-bearing.",
    "Regulated / governed": "Included — Subject to strict building codes and fire safety standards.",
    "Teachable / transmissible": "Excluded — Can be explained, but not designed for didactic use.",
    "Visible": "Included — Visibly present and designed for easy recognition.",
    "Context-sensitive": "Excluded — Operates the same across environments.",
    "Widely known": "Included — Universally recognized life safety device."
  },
  "encoding_notes": "This encoding reflects a smoke detector as a structurally fixed, perceptible, and autonomous safety device. It is defined by logical sensing and regulatory inclusion. Though not user-interactive or symbolic, its system-critical function and legal mandate justify inclusion of autonomy and governance traits.",
  "image": "images/smoke_detector.png"
}

,
{
  "entity": "Solar Charger",
  "uht_code": "DED60205",
  "image_url": "/validation_set/images/solar_charger.png",
  "traits": {
    "physical": [
      "Physical object",
      "Man-made / synthetic",
      "Fixed/static",
      "Structural",
      "Perceptible",
      "Material form"
    ],
    "functional": [
      "Purposeful / intentional",
      "Emits output / produces effect",
      "Transforms or modifies internal state",
      "Part of a larger system",
      "Autonomous in function"
    ],
    "abstract": [
      "Temporal"
    ],
    "social": [
      "Visible",
      "Widely known"
    ]
  },
  "feedback": {
    "Physical object": "Included — A tangible item consisting of solar panels, casing, and connectors.",
    "Man-made / synthetic": "Included — Engineered and assembled using synthetic materials like silicon, polymers, and metal.",
    "Biological or biologically-inspired": "Excluded — No modeling on biological systems, even if conceptually reminiscent of photosynthesis.",
    "Fixed/static": "Included — Operates from a stationary position while in use (mounted or positioned for sun exposure).",
    "Structural": "Included — Frame, cell layout, and orientation determine performance.",
    "Perceptible": "Included — Designed to be positioned and observed by the user.",
    "Material form": "Included — A physical apparatus built from durable materials.",
    "Passive": "Excluded — Converts solar energy to electrical output — an active energy transformation process.",
    
    "Purposeful / intentional": "Included — Created for the explicit function of charging batteries or devices using solar energy.",
    "Emits output / produces effect": "Included — Generates and delivers electrical current.",
    "Processes or regulates logic/signals": "Excluded — Basic models lack logical control or signal interpretation.",
    "Transforms or modifies internal state": "Included — Converts light energy into electrical energy; may involve tracking or storing charge.",
    "Interacts with humans directly": "Excluded — Typically has no interactive interface or real-time feedback.",
    "Part of a larger system": "Included — Can integrate with batteries, microgrids, or portable power banks.",
    "Autonomous in function": "Included — Functions automatically when exposed to sunlight, requiring no further user input.",
    "System-critical": "Excluded — May be important contextually, but not inherently critical to broader system operation.",
    
    "Symbolic / representational": "Excluded — Not designed to convey symbols or meaning.",
    "Communicative": "Excluded — Does not emit or receive coded communication.",
    "Logical / rule-based": "Excluded — Function is physically governed, not logically encoded.",
    "Hierarchical / modular": "Excluded — Typically a monolithic system without conceptual subsystems.",
    "Behavior-guiding": "Excluded — Does not instruct or influence user behavior semantically.",
    "Self-referential / meta-conceptual": "Excluded — No reflective or modeling capability.",
    "Temporal": "Included — Depends on time of day and duration of sunlight exposure for performance.",
    "Contextual abstraction": "Excluded — Function remains consistent regardless of symbolic or cultural context.",
    
    "Socially / culturally constructed": "Excluded — Grounded in physical utility, not cultural framing.",
    "Defined by a group/system": "Excluded — May be standardized, but not semantically defined by groups.",
    "Linked to identity or role": "Excluded — Not inherently identity-associated.",
    "Regulated / governed": "Excluded — Regulation may apply, but is not intrinsic to the object’s function.",
    "Teachable / transmissible": "Excluded — Use can be taught, but that’s not a defining trait.",
    "Visible": "Included — Often positioned in sunlight-exposed areas, visibility is intentional.",
    "Context-sensitive": "Excluded — Function doesn’t vary semantically with setting.",
    "Widely known": "Included — Recognized globally as a sustainable energy solution."
  },
  "encoding_notes": "This encoding treats the solar charger as a physical, autonomous energy transformation device with a time-dependent function and broad public familiarity. Logical, symbolic, or socially defined traits are excluded, reflecting the charger's grounded, passive-operating design.",
  "image": "images/solar_charger.png"
}

,
{
  "entity": "Thermostat",
  "uht_code": "DEFC2000",
  "image_url": "/validation_set/images/thermostat.png",
  "traits": {
    "physical": [
      "Physical object",
      "Man-made / synthetic",
      "Fixed/static",
      "Structural",
      "Perceptible",
      "Material form"
    ],
    "functional": [
      "Purposeful / intentional",
      "Emits output / produces effect",
      "Processes or regulates logic/signals",
      "Transforms or modifies internal state",
      "Interacts with humans directly",
      "Part of a larger system"
    ],
    "abstract": [
      "Logical / rule-based"
    ],
    "social": []
  },
  "feedback": {
    "Physical object": "Included — A tangible device typically mounted on walls or embedded in systems.",
    "Man-made / synthetic": "Included — Fully designed and manufactured by humans.",
    "Biological or biologically-inspired": "Excluded — Does not mimic or derive from biological systems.",
    "Fixed/static": "Included — Usually stationary once installed.",
    "Structural": "Included — Enclosed in a case that supports its interface, sensors, and logic board.",
    "Perceptible": "Included — Users can see and often interact with its screen, dial, or buttons.",
    "Material form": "Included — Composed of plastic, metal, glass, and circuitry.",
    "Passive": "Excluded — Actively reads, processes, and acts on temperature input.",
    
    "Purposeful / intentional": "Included — Created to regulate environmental temperature.",
    "Emits output / produces effect": "Included — Activates heating/cooling systems based on readings.",
    "Processes or regulates logic/signals": "Included — Executes internal logic based on programmed thresholds.",
    "Transforms or modifies internal state": "Included — Stores configuration settings and changes state depending on input.",
    "Interacts with humans directly": "Included — User interfaces allow setting temperature and modes.",
    "Part of a larger system": "Included — Integrated with HVAC or automation systems.",
    "Autonomous in function": "Excluded — Most require human configuration and lack fully autonomous adaptation.",
    "System-critical": "Excluded — System can function manually or with alternate input in many cases.",
    
    "Symbolic / representational": "Excluded — Not symbolic or representative in primary function.",
    "Communicative": "Excluded — Displays data but not for symbolic communication.",
    "Logical / rule-based": "Included — Follows defined logic such as threshold-based activation.",
    "Hierarchical / modular": "Excluded — May be part of a system but not composed of abstracted submodules.",
    "Behavior-guiding": "Excluded — Influences environment, not behavior directly.",
    "Self-referential / meta-conceptual": "Excluded — Not reflective or conceptual.",
    "Temporal": "Excluded — Time-related features are secondary or absent in standard models.",
    "Contextual abstraction": "Excluded — Operates in real-time, not abstracted or generalized conceptually.",
    
    "Socially / culturally constructed": "Excluded — Functional device, not socially defined.",
    "Defined by a group/system": "Excluded — Regulated design standards may exist, but not semantically defining.",
    "Linked to identity or role": "Excluded — Not linked to user roles or identity markers.",
    "Regulated / governed": "Excluded — Product standards exist but are external.",
    "Teachable / transmissible": "Excluded — Can be taught about, but not inherently an educational medium.",
    "Visible": "Excluded — Though seen, not semantically defining to its function.",
    "Context-sensitive": "Excluded — Its operation changes with context, but the object remains semantically stable.",
    "Widely known": "Excluded — Commonplace, but not included unless widespread recognition is core to identity."
  },
  "encoding_notes": "This encoding captures the thermostat as a standard environmental control device. It emphasizes its engineered form, rule-based logic, and role in functional systems. Social and abstract traits are excluded unless directly integral to its design or conceptual identity. Autonomous and critical roles are omitted due to reliance on preset input and replaceability in many systems.",
  "image": "images/thermostat.png"
}

,
{
  "entity": "Water Filtration Unit",
  "uht_code": "DFD60205",
  "image_url": "/validation_set/images/water_filtration_unit.png",
  "traits": {
    "physical": [
      "Physical object",
      "Man-made / synthetic",
      "Fixed/static",
      "Structural",
      "Perceptible",
      "Material form",
      "Passive"
    ],
    "functional": [
      "Purposeful / intentional",
      "Emits output / produces effect",
      "Transforms or modifies internal state",
      "Part of a larger system",
      "Autonomous in function"
    ],
    "abstract": [
      "Temporal"
    ],
    "social": [
      "Visible",
      "Widely known"
    ]
  },
  "feedback": {
    "Physical object": "Included — A tangible unit composed of housings, chambers, and filter media.",
    "Man-made / synthetic": "Included — Designed and manufactured by humans for a clear technical function.",
    "Biological or biologically-inspired": "Excluded — May mimic natural filtering effects, but not conceptually modeled on biology.",
    "Fixed/static": "Included — Typically remains stationary during use, whether installed or gravity-fed.",
    "Structural": "Included — Geometry and layering of materials directly determine filtration performance.",
    "Perceptible": "Included — User-visible, manually operated or replaceable.",
    "Material form": "Included — Constructed from durable solid-state materials.",
    "Passive": "Included — Most operate without active sensors, software, or external power.",
    
    "Purposeful / intentional": "Included — Built specifically to remove unwanted substances from water.",
    "Emits output / produces effect": "Included — Produces filtered water as output.",
    "Processes or regulates logic/signals": "Excluded — Operates mechanically, not by logical control.",
    "Transforms or modifies internal state": "Included — Filters accumulate contaminants over time.",
    "Interacts with humans directly": "Excluded — Generally no interactive UI or active feedback.",
    "Part of a larger system": "Included — Can be integrated with plumbing or broader water systems.",
    "Autonomous in function": "Included — Operates on its own during fluid flow; user not required to intervene mid-process.",
    "System-critical": "Excluded — May be important, but not semantically critical for broader system operation.",
    
    "Symbolic / representational": "Excluded — Functionally concrete, not symbolic.",
    "Communicative": "Excluded — No symbolic or signal-based communication.",
    "Logical / rule-based": "Excluded — Behavior arises from physical dynamics, not encoded logic.",
    "Hierarchical / modular": "Excluded — Internal construction does not imply modular semantic structure.",
    "Behavior-guiding": "Excluded — Does not guide user decisions or social behavior.",
    "Self-referential / meta-conceptual": "Excluded — No reflection or internal representation of function.",
    "Temporal": "Included — Filter degradation and replacement cycles are time-dependent.",
    "Contextual abstraction": "Excluded — Purpose and behavior do not change across social contexts.",
    
    "Socially / culturally constructed": "Excluded — Grounded in universal physical function.",
    "Defined by a group/system": "Excluded — Standards may exist, but not semantically defined by social systems.",
    "Linked to identity or role": "Excluded — Not associated with personal or group roles.",
    "Regulated / governed": "Excluded — Regulation may apply externally but does not define the device's nature.",
    "Teachable / transmissible": "Excluded — Use may be taught, but this is not a core semantic trait.",
    "Visible": "Included — Deliberately accessible and often user-facing for replacement or monitoring.",
    "Context-sensitive": "Excluded — Identity and behavior remain stable across different uses.",
    "Widely known": "Included — Commonly recognized and used in domestic and public contexts."
  },
  "encoding_notes": "This encoding treats the water filtration unit as a structurally fixed, passive physical mechanism with autonomous function and no symbolic or computational capacity. It includes time-dependence and broad recognizability while excluding overextensions into abstract or interactive domains.",
  "image": "images/water_filtration_unit.png"
}

,
{
  "entity": "Wind Turbine",
  "uht_code": "DEF62205",
  "image_url": "/validation_set/images/wind_turbine.png",
  "traits": {
    "physical": [
      "Physical object",
      "Man-made / synthetic",
      "Fixed/static",
      "Structural",
      "Perceptible",
      "Material form"
    ],
    "functional": [
      "Purposeful / intentional",
      "Emits output / produces effect",
      "Processes or regulates logic/signals",
      "Transforms or modifies internal state",
      "Part of a larger system",
      "Autonomous in function"
    ],
    "abstract": [
      "Logical / rule-based",
      "Temporal"
    ],
    "social": [
      "Visible",
      "Widely known"
    ]
  },
  "feedback": {
    "Physical object": "Included — A large, physically installed machine composed of mechanical and electronic components.",
    "Man-made / synthetic": "Included — Entirely engineered and manufactured by humans.",
    "Biological or biologically-inspired": "Excluded — Not modeled after biological systems or behaviors.",
    "Fixed/static": "Included — Stationary tower structure anchored in place.",
    "Structural": "Included — Load-bearing design critical to its mechanical function.",
    "Perceptible": "Included — Highly visible in landscape; audible in operation.",
    "Material form": "Included — Constructed from composite, steel, and other engineered materials.",
    "Passive": "Excluded — Actively converts wind into energy via motion and control logic.",

    "Purposeful / intentional": "Included — Designed explicitly for harvesting wind energy.",
    "Emits output / produces effect": "Included — Produces mechanical or electrical power output.",
    "Processes or regulates logic/signals": "Included — Embedded control systems manage rotation, yaw, and pitch.",
    "Transforms or modifies internal state": "Included — Adjusts settings and modes based on wind and system data.",
    "Interacts with humans directly": "Excluded — Operates remotely, not designed for user interaction.",
    "Part of a larger system": "Included — Integrated with wind farms and energy grids.",
    "Autonomous in function": "Included — Performs key operations without direct human input.",
    "System-critical": "Excluded — Can be taken offline or replaced without total system failure.",

    "Symbolic / representational": "Excluded — Functional rather than symbolic.",
    "Communicative": "Excluded — Not intended to transmit information symbolically.",
    "Logical / rule-based": "Included — Governed by programmed rules for safe and efficient operation.",
    "Hierarchical / modular": "Excluded — Has subsystems but not abstractly modular.",
    "Behavior-guiding": "Excluded — Does not influence human behavior directly.",
    "Self-referential / meta-conceptual": "Excluded — Not capable of reflective or conceptual modeling.",
    "Temporal": "Included — Continuously measures wind speed and reacts over time.",
    "Contextual abstraction": "Excluded — Interprets environment physically, not abstractly.",

    "Socially / culturally constructed": "Excluded — Recognized across cultures but not culturally defined.",
    "Defined by a group/system": "Excluded — Subject to regulations, but definition is technical, not semantic.",
    "Linked to identity or role": "Excluded — Not tied to social or personal identity.",
    "Regulated / governed": "Excluded — While regulated in use, regulation is external.",
    "Teachable / transmissible": "Excluded — Education about it is common, but not inherent to the device.",
    "Visible": "Included — Prominent in landscapes and often discussed in public discourse.",
    "Context-sensitive": "Excluded — Performs the same functional role across contexts.",
    "Widely known": "Included — A globally familiar renewable energy technology."
  },
  "encoding_notes": "This encoding treats the wind turbine as an industrial energy-generation mechanism. It emphasizes its engineered material form, functional automation, and logical control systems. While perceptible and visible, social traits are limited to public familiarity rather than culturally constructed meaning. Abstract traits reflect internal control logic and time-based operation, without symbolic or communicative intention.",
  "image": "images/wind_turbine.png"
}

,
{
  "entity": "Arrowhead (Stone Age)",
  "uht_code": "DF8C02C9",
  "image_url": "/validation_set/images/arrowhead_stone_age.png",
  "traits": {
    "physical": [
      "Physical object",
      "Man-made / synthetic",
      "Fixed/static",
      "Structural",
      "Perceptible",
      "Material form",
      "Passive"
    ],
    "functional": [
      "Purposeful / intentional",
      "Interacts with humans directly",
      "Part of a larger system"
    ],
    "abstract": [
      "Temporal"
    ],
    "social": [
      "Socially / culturally constructed",
      "Defined by a group/system",
      "Teachable / transmissible",
      "Widely known"
    ]
  },
  "feedback": {
    "Physical object": "Included — A tangible, bounded object made of stone.",
    "Man-made / synthetic": "Included — Crafted by early humans through intentional shaping.",
    "Biological or biologically-inspired": "Excluded — Not derived from or imitative of biological systems.",
    "Fixed/static": "Included — Holds a fixed shape post-manufacture.",
    "Structural": "Included — Designed with structural properties for penetration or cutting.",
    "Perceptible": "Included — Visible, touchable, and physically present.",
    "Material form": "Included — Made from stone or flint, a solid material.",
    "Passive": "Included — Has no active energy or behavior; function depends on use.",
    
    "Purposeful / intentional": "Included — Deliberately shaped for use in hunting or defense.",
    "Emits output / produces effect": "Excluded — Requires external force to function; not intrinsically active.",
    "Processes or regulates logic/signals": "Excluded — No signal processing capacity.",
    "Transforms or modifies internal state": "Excluded — Static and unchanging after creation.",
    "Interacts with humans directly": "Included — Used manually by humans in tasks like hunting.",
    "Part of a larger system": "Included — Typically affixed to a shaft to form a complete weapon.",
    "Autonomous in function": "Excluded — No independent activity or behavior.",
    "System-critical": "Excluded — Not inherently critical; depends on context.",
    
    "Symbolic / representational": "Excluded — Functional tool, not a symbol by design.",
    "Communicative": "Excluded — Not meant to convey information.",
    "Logical / rule-based": "Excluded — While crafted with skill, does not embody a formal logic.",
    "Hierarchical / modular": "Excluded — Not inherently modular, though used in multi-part tools.",
    "Behavior-guiding": "Excluded — Does not prescribe behavior; simply used in actions.",
    "Self-referential / meta-conceptual": "Excluded — Not reflective or conceptual in design.",
    "Temporal": "Included — Its identity is rooted in historical era; recognized as an ancient object.",
    "Contextual abstraction": "Excluded — Not an abstraction or model of a concept.",
    
    "Socially / culturally constructed": "Included — Arises from and reflects shared tool-making traditions.",
    "Defined by a group/system": "Included — Types/styles were defined by cultural groups or regions.",
    "Linked to identity or role": "Excluded — May have been used by hunters or warriors, but not identity-defining in itself.",
    "Regulated / governed": "Excluded — No formal rules governing its use in the prehistoric period.",
    "Teachable / transmissible": "Included — Skill of flint knapping was taught across generations.",
    "Visible": "Excluded — Not symbolically or performatively visible; visibility is physical only.",
    "Context-sensitive": "Excluded — Its identity and purpose are relatively stable regardless of context.",
    "Widely known": "Included — Recognized globally as a cultural and historical artifact."
  },
  "encoding_notes": "This encoding frames the arrowhead as a purposeful, prehistoric technological artifact — one designed by humans, embedded in cultural practices, and preserved in historical time. Abstract and symbolic traits are excluded unless directly embedded in the object’s structure or function. Social traits are carefully selected to reflect group-level crafting knowledge and recognition without overextending into metaphor.",
  "image": "images/arrowhead_stone_age.png"
}

,
{
  "entity": "Bone Conduction Headset",
  "uht_code": "FEEC40CD",
  "image_url": "/validation_set/images/bone_conduction_headset.png",
  "traits": {
    "physical": [
      "Physical object",
      "Man-made / synthetic",
      "Biological or biologically-inspired",
      "Fixed/static",
      "Structural",
      "Perceptible",
      "Material form"
    ],
    "functional": [
      "Purposeful / intentional",
      "Emits output / produces effect",
      "Processes or regulates logic/signals",
      "Interacts with humans directly",
      "Part of a larger system"
    ],
    "abstract": [
      "Communicative"
    ],
    "social": [
      "Socially / culturally constructed",
      "Defined by a group/system",
      "Teachable / transmissible",
      "Visible",
      "Widely known"
    ]
  },
  "feedback": {
    "Physical object": "Included — A tangible, bounded piece of hardware with clear physical presence.",
    "Man-made / synthetic": "Included — Designed and manufactured using artificial materials and processes.",
    "Biological or biologically-inspired": "Included — Mimics natural bone conduction pathways in the skull.",
    "Fixed/static": "Included — Maintains a stable form suitable for repeated physical use.",
    "Structural": "Included — Built with form and pressure-resistance to sit properly on the skull.",
    "Perceptible": "Included — Visibly and physically present, designed to be seen and worn.",
    "Material form": "Included — Made from plastic, silicone, metal; clearly material.",
    "Passive": "Excluded — Actively converts audio signals into vibrations and requires power.",
    
    "Purposeful / intentional": "Included — Designed with a specific function: delivering sound without obstructing the ear canal.",
    "Emits output / produces effect": "Included — Outputs vibrational energy as functional audio.",
    "Processes or regulates logic/signals": "Included — Internally processes electronic audio signals into mechanical form.",
    "Transforms or modifies internal state": "Excluded — Has no long-term state memory or adaptive internal configuration.",
    "Interacts with humans directly": "Included — Worn and experienced directly by human users.",
    "Part of a larger system": "Included — Often part of Bluetooth, audio, or accessibility ecosystems.",
    "Autonomous in function": "Excluded — Dependent on external signal and power sources.",
    "System-critical": "Excluded — Not essential to the operation of a system by default.",
    
    "Symbolic / representational": "Excluded — Not designed to convey symbolic meaning.",
    "Communicative": "Included — Its function is to enable auditory communication.",
    "Logical / rule-based": "Excluded — Operates within logic circuits, but not a logic entity itself.",
    "Hierarchical / modular": "Excluded — Not structurally modular or decomposed into logical subunits.",
    "Behavior-guiding": "Excluded — Allows or supports behavior but does not guide it by design.",
    "Self-referential / meta-conceptual": "Excluded — Not a reflective or recursive entity.",
    "Temporal": "Excluded — Functions in time but is not defined by temporal identity.",
    "Contextual abstraction": "Excluded — Not an abstract model or adaptable template.",
    
    "Socially / culturally constructed": "Included — Categorized and designed within cultural understandings of wearable tech.",
    "Defined by a group/system": "Included — Defined and standardized within audio tech and consumer electronics domains.",
    "Linked to identity or role": "Excluded — May support specific users (e.g., athletes, deaf users), but not inherently role-defining.",
    "Regulated / governed": "Excluded — Regulatory constraints exist externally (e.g., radio compliance), not inherently.",
    "Teachable / transmissible": "Included — Usage and function can be taught and transferred.",
    "Visible": "Included — Typically worn externally and intentionally designed for public visibility.",
    "Context-sensitive": "Excluded — Usage is relatively stable across environments.",
    "Widely known": "Included — Commonly recognized as a distinct class of consumer audio hardware."
  },
  "encoding_notes": "This encoding captures the bone conduction headset as a biologically inspired, socially embedded, and functionally communicative consumer device. Passive and regulated traits are excluded based on the standard that only traits intrinsic to the object itself, not context or external governance, are included. The correction from `02` to `40` in the Abstract layer reflects accurate placement of the 'Communicative' trait.",
  "image": "images/bone_conduction_headset.png"
}

,
{
  "entity": "Circuit Board",
  "uht_code": "DEE40002",
  "image_url": "/validation_set/images/circuit_board.png",
  "traits": {
    "physical": [
      "Physical object",
      "Man-made / synthetic",
      "Fixed/static",
      "Structural",
      "Perceptible",
      "Material form"
    ],
    "functional": [
      "Purposeful / intentional",
      "Emits output / produces effect",
      "Processes or regulates logic/signals",
      "Part of a larger system"
    ],
    "abstract": [],
    "social": [
      "Context-sensitive"
    ]
  },
  "feedback": {
    "Physical object": "Included — It is a tangible, bounded physical artifact.",
    "Man-made / synthetic": "Included — Designed and manufactured by humans.",
    "Biological or biologically-inspired": "Excluded — Not based on or mimicking biological systems.",
    "Fixed/static": "Included — The board’s form and structure do not change during normal operation.",
    "Structural": "Included — It provides physical mounting and layout structure for components.",
    "Perceptible": "Included — It is visible and detectable to human senses.",
    "Material form": "Included — Composed of copper, fiberglass, and other physical substances.",
    "Passive": "Excluded — Includes active elements; not inherently passive.",
    
    "Purposeful / intentional": "Included — Designed for routing, computation, or control.",
    "Emits output / produces effect": "Included — Outputs signals or voltages as a function.",
    "Processes or regulates logic/signals": "Included — Implements logic and signal routing via embedded circuits.",
    "Transforms or modifies internal state": "Excluded — The board itself is not intrinsically stateful; state comes from individual components.",
    "Interacts with humans directly": "Excluded — Not a user interface or direct interaction point.",
    "Part of a larger system": "Included — Typically operates within a larger electronic or mechanical system.",
    "Autonomous in function": "Excluded — Requires external power and instructions.",
    "System-critical": "Excluded — Criticality depends on system context, not universal.",
    
    "Symbolic / representational": "Excluded — Does not symbolize or represent concepts.",
    "Communicative": "Excluded — Transmits electrical signals, but not symbolic or human-language content.",
    "Logical / rule-based": "Excluded — While it supports logic, the board is not itself an abstract rule-based system.",
    "Hierarchical / modular": "Excluded — Can be modular in implementation, but not intrinsically defined that way.",
    "Behavior-guiding": "Excluded — Does not prescribe or shape behavior outside electrical function.",
    "Self-referential / meta-conceptual": "Excluded — Not self-modeling or reflective in function.",
    "Temporal": "Excluded — No inherent temporal logic or persistence.",
    "Contextual abstraction": "Excluded — Not an abstract generalization or symbolic context carrier.",
    
    "Socially / culturally constructed": "Excluded — Technological artifact, not socially defined.",
    "Defined by a group/system": "Excluded — Not institutionally defined as identity.",
    "Linked to identity or role": "Excluded — Not tied to social roles or identities.",
    "Regulated / governed": "Excluded — Standards exist but are external.",
    "Teachable / transmissible": "Excluded — Not a medium of instruction or knowledge carrier.",
    "Visible": "Excluded — Visibly perceptible, but not symbolically visible in a social sense.",
    "Context-sensitive": "Included — Meaning and function vary depending on system context.",
    "Widely known": "Excluded — Known to specialists, not widely recognized by the general public."
  },
  "encoding_notes": "This encoding treats a circuit board as a general-purpose hardware substrate, distinct from higher-order symbolic or interactive systems. Only traits that are structurally and functionally inherent to the board itself are included. State transformation, symbolism, and social significance are excluded unless intrinsic to the board’s identity.",
  "image": "images/circuit_board.png"
}

,
{
  "entity": "Coral Reef Fragment",
  "uht_code": "BF04000D",
  "image_url": "/validation_set/images/coral_reef_fragment.png",
  "traits": {
    "physical": [
      "Physical object",
      "Biological or biologically-inspired",
      "Fixed/static",
      "Structural",
      "Perceptible",
      "Material form",
      "Passive"
    ],
    "functional": [
      "Part of a larger system"
    ],
    "abstract": [],
    "social": [
      "Teachable / transmissible",
      "Visible",
      "Widely known"
    ]
  },
  "feedback": {
    "Physical object": "Included — Tangible material with defined shape and substance.",
    "Man-made / synthetic": "Excluded — Naturally grown by marine organisms.",
    "Biological or biologically-inspired": "Included — Formed by biological processes from coral polyps.",
    "Fixed/static": "Included — Immobile and stable in form after breakage.",
    "Structural": "Included — Provides physical support in marine environments.",
    "Perceptible": "Included — Visually and physically obvious.",
    "Material form": "Included — Calcareous structure, solid material.",
    "Passive": "Included — Does not act independently once broken off.",
    "Purposeful / intentional": "Excluded — Not designed or constructed with purpose.",
    "Emits output / produces effect": "Excluded — No active emission or transformation.",
    "Processes or regulates logic/signals": "Excluded — Not a signaling or computational object.",
    "Transforms or modifies internal state": "Excluded — No intrinsic state transformation.",
    "Interacts with humans directly": "Excluded — Not a direct interface object.",
    "Part of a larger system": "Included — Originally part of a coral reef ecosystem.",
    "Autonomous in function": "Excluded — Not functionally independent.",
    "System-critical": "Excluded — A fragment is not essential on its own.",
    "Symbolic / representational": "Excluded — May carry metaphor, but not inherent to identity.",
    "Communicative": "Excluded — Does not encode or transmit meaning.",
    "Logical / rule-based": "Excluded — Formation is natural, not rule-executing.",
    "Hierarchical / modular": "Excluded — Not composed of submodules.",
    "Behavior-guiding": "Excluded — Does not influence decisions.",
    "Self-referential / meta-conceptual": "Excluded — Not capable of recursive reference.",
    "Temporal": "Excluded — Does not inherently change with time.",
    "Contextual abstraction": "Excluded — Identity stable across settings.",
    "Socially / culturally constructed": "Excluded — Exists independently of culture.",
    "Defined by a group/system": "Excluded — Classification exists, but does not define its being.",
    "Linked to identity or role": "Excluded — Not used to signify identity.",
    "Regulated / governed": "Excluded — Laws may govern collection, but not object essence.",
    "Teachable / transmissible": "Included — Commonly studied in ecology and marine science.",
    "Visible": "Included — Visually striking and identifiable.",
    "Context-sensitive": "Excluded — Function and meaning remain stable.",
    "Widely known": "Included — Recognized globally, especially in environmental contexts."
  },
  "image": "images/coral_reef_fragment.png"
}

,
{
  "entity": "Dust Particle",
  "uht_code": "83000000",
  "image_url": "/validation_set/images/dust_particle.png",
  "traits": {
    "physical": [
      "Physical object",
      "Material form",
      "Passive"
    ],
    "functional": [],
    "abstract": [],
    "social": []
  },
  "feedback": {
    "Physical object": "Included — A dust particle is a tangible, bounded material entity that occupies space.",
    "Man-made / synthetic": "Excluded — Dust particles can be natural or artificial; synthetic origin is not intrinsic.",
    "Biological or biologically-inspired": "Excluded — Most dust is inorganic; even biological dust (e.g. dander) isn't inherently biological in identity.",
    "Fixed/static": "Excluded — Dust is typically mobile and easily disturbed.",
    "Structural": "Excluded — A dust particle has no load-bearing or designed structural role.",
    "Perceptible": "Excluded — An individual dust particle is usually below visual threshold without amplification.",
    "Material form": "Included — It consists of solid matter and occupies a specific form in space.",
    "Passive": "Included — It has no agency and only responds to external forces (e.g., wind, electrostatics).",
    
    "Purposeful / intentional": "Excluded — It is not designed or purposed by default.",
    "Emits output / produces effect": "Excluded — It doesn’t generate outputs unless in context (e.g., pollutant); not intrinsic.",
    "Processes or regulates logic/signals": "Excluded — It has no signaling or processing capability.",
    "Transforms or modifies internal state": "Excluded — No autonomous or inherent transformation occurs.",
    "Interacts with humans directly": "Excluded — Any interaction is incidental, not intrinsic to identity.",
    "Part of a larger system": "Excluded — May aggregate but not inherently systemic.",
    "Autonomous in function": "Excluded — No autonomy or function independent of environment.",
    "System-critical": "Excluded — Not essential to any defined system by nature.",
    
    "Symbolic / representational": "Excluded — Not used symbolically without imposed interpretation.",
    "Communicative": "Excluded — Does not inherently transmit or encode information.",
    "Logical / rule-based": "Excluded — Has no logic or structure governed by internal rules.",
    "Hierarchical / modular": "Excluded — Not composed of subsystems or organizational levels.",
    "Behavior-guiding": "Excluded — Does not guide or constrain actions.",
    "Self-referential / meta-conceptual": "Excluded — Not capable of referencing or representing itself.",
    "Temporal": "Excluded — Exists in time, but temporality is not abstracted into its identity.",
    "Contextual abstraction": "Excluded — It is a direct physical entity, not a conceptual construct.",
    
    "Socially / culturally constructed": "Excluded — Its identity does not derive from social convention.",
    "Defined by a group/system": "Excluded — Not framed by institutions or classifications by default.",
    "Linked to identity or role": "Excluded — Not tied to roles, identities, or functions.",
    "Regulated / governed": "Excluded — No rules govern its behavior by design.",
    "Teachable / transmissible": "Excluded — Not a unit of knowledge or transferrable concept.",
    "Visible": "Excluded — Not typically visible as an individual entity without tools.",
    "Context-sensitive": "Excluded — Exists independently of specific contextual frames.",
    "Widely known": "Excluded — Dust as a category is known, but an individual particle is not culturally salient."
  },
  "encoding_notes": "This encoding describes a generic, isolated dust particle, not a symbolic aggregate like 'dust' in literature or 'pollution' in policy. Perceptibility and social traits are excluded due to scale and lack of cultural framing. Passive is now correctly included, as a dust particle exhibits no agency or internal behavior.",
  "image": "images/dust_particle.png"
}

,
{
  "entity": "Fossil",
  "uht_code": "BF000201",
  "image_url": "/validation_set/images/fossil.png",
  "traits": {
    "physical": [
      "Physical object",
      "Biological or biologically-inspired",
      "Fixed/static",
      "Structural",
      "Perceptible",
      "Material form",
      "Passive"
    ],
    "functional": [],
    "abstract": [
      "Temporal"
    ],
    "social": [
      "Widely known"
    ]
  },
  "feedback": {
    "Physical object": "Included — A fossil is a discrete, tangible physical artifact preserved in matter.",
    "Man-made / synthetic": "Excluded — Fossils form through natural geological processes, not human design.",
    "Biological or biologically-inspired": "Included — It is a remnant of an organism; its form is biologically derived.",
    "Fixed/static": "Included — Its form is preserved and unchanging.",
    "Structural": "Included — Often preserves skeletal or external anatomical structure.",
    "Perceptible": "Included — Visible and tactile; observed in museums, collections, or nature.",
    "Material form": "Included — Composed of mineralized or petrified matter.",
    "Passive": "Included — Fossils have no active function or behavior.",
    
    "Purposeful / intentional": "Excluded — Not made with purpose; an incidental result of natural processes.",
    "Emits output / produces effect": "Excluded — Does not emit energy, data, or functional output.",
    "Processes or regulates logic/signals": "Excluded — No processing behavior.",
    "Transforms or modifies internal state": "Excluded — Static; no mutable internal condition.",
    "Interacts with humans directly": "Excluded — Observed or handled, but does not afford designed interaction.",
    "Part of a larger system": "Excluded — Once was part of a biological system, but no longer functionally embedded.",
    "Autonomous in function": "Excluded — No autonomous or active behavior.",
    "System-critical": "Excluded — Not critical to any system by default.",
    
    "Symbolic / representational": "Excluded — May be symbolically interpreted, but not inherently a symbol.",
    "Communicative": "Excluded — Does not encode or transmit communication.",
    "Logical / rule-based": "Excluded — Not an abstract logical system.",
    "Hierarchical / modular": "Excluded — Form may reflect organismal hierarchy, but the fossil is not a modular structure.",
    "Behavior-guiding": "Excluded — No influence on action or behavior.",
    "Self-referential / meta-conceptual": "Excluded — Not reflective or conceptual.",
    "Temporal": "Included — Its identity is bound to historical/geological time; it exists *as* a trace of the past.",
    "Contextual abstraction": "Excluded — Not an abstraction; it is a specific preserved object.",
    
    "Socially / culturally constructed": "Excluded — Not a human-made social concept.",
    "Defined by a group/system": "Excluded — Categorized post hoc, but not defined by collective agreement.",
    "Linked to identity or role": "Excluded — Not used to signify social roles.",
    "Regulated / governed": "Excluded — Collecting may be regulated, but the object itself is not defined by regulation.",
    "Teachable / transmissible": "Excluded — Can be used in education, but not a medium of instruction in itself.",
    "Visible": "Excluded — Perceptible physically, but not socially or symbolically 'visible' per UHT standard.",
    "Context-sensitive": "Excluded — Meaning is fairly stable regardless of setting.",
    "Widely known": "Included — Fossils are globally recognized and commonly understood objects."
  },
  "encoding_notes": "This encoding frames the fossil as a naturally formed physical remnant of past biological life. While it has educational and scientific significance, only intrinsic traits — not attributed meanings — are included. Temporal relevance is marked due to its preserved, ancient identity.",
  "image": "images/fossil.png"
}

,
{
  "entity": "Glass Bottle",
  "uht_code": "DF880001",
  "image_url": "/validation_set/images/glass_bottle.png",
  "traits": {
    "physical": [
      "Physical object",
      "Man-made / synthetic",
      "Fixed/static",
      "Structural",
      "Perceptible",
      "Material form",
      "Passive"
    ],
    "functional": [
      "Purposeful / intentional",
      "Interacts with humans directly"
    ],
    "abstract": [],
    "social": [
      "Widely known"
    ]
  },
  "feedback": {
    "Physical object": "Included — A glass bottle is a tangible, discrete physical entity.",
    "Man-made / synthetic": "Included — Manufactured using industrial or artisanal processes.",
    "Biological or biologically-inspired": "Excluded — Has no biological structure or mimicry.",
    "Fixed/static": "Included — Maintains a stable physical form.",
    "Structural": "Included — Provides shape and containment for fluids.",
    "Perceptible": "Included — Visually and tactilely apparent.",
    "Material form": "Included — Composed of solid matter (glass).",
    "Passive": "Included — Does not perform any active or powered function.",
    
    "Purposeful / intentional": "Included — Designed explicitly to contain and store liquids.",
    "Emits output / produces effect": "Excluded — Does not emit signals, energy, or material output autonomously.",
    "Processes or regulates logic/signals": "Excluded — No processing or logical operation occurs.",
    "Transforms or modifies internal state": "Excluded — Does not alter or store internal conditions independently.",
    "Interacts with humans directly": "Included — Used by people for drinking, pouring, storage.",
    "Part of a larger system": "Excluded — May be used in systems, but is not intrinsically a subsystem.",
    "Autonomous in function": "Excluded — Has no autonomous behavior or function.",
    "System-critical": "Excluded — Not inherently essential to any system's functioning.",
    
    "Symbolic / representational": "Excluded — Not intrinsically a symbol or representational form.",
    "Communicative": "Excluded — Does not convey information symbolically or intentionally.",
    "Logical / rule-based": "Excluded — No internal logic structure.",
    "Hierarchical / modular": "Excluded — Not built from modular subparts with structural roles.",
    "Behavior-guiding": "Excluded — Does not prescribe or guide behavior.",
    "Self-referential / meta-conceptual": "Excluded — Lacks any self-modeling or recursive identity.",
    "Temporal": "Excluded — Not defined by time or state transitions.",
    "Contextual abstraction": "Excluded — Not an abstract or generalized model.",
    
    "Socially / culturally constructed": "Excluded — Exists primarily as a physical utility object.",
    "Defined by a group/system": "Excluded — Not institutionally or group-defined.",
    "Linked to identity or role": "Excluded — Does not encode social identity.",
    "Regulated / governed": "Excluded — May be regulated in use (e.g. for food safety), but not as an intrinsic identity.",
    "Teachable / transmissible": "Excluded — Not a medium of instructional content.",
    "Visible": "Excluded — Perceptible, but not socially or symbolically visible.",
    "Context-sensitive": "Excluded — Function is generally stable across contexts.",
    "Widely known": "Included — Commonly recognized and understood across cultures."
  },
  "encoding_notes": "This encoding treats the glass bottle as a general-purpose physical container. Traits are limited to intrinsic structural and functional aspects. No symbolic, logical, or institutional roles are inferred, keeping the representation minimal and precise.",
  "image": "images/glass_bottle.png"
}

,
{
  "entity": "Human Femur",
  "uht_code": "9F000201",
  "image_url": "/validation_set/images/human_femur.png",
  "traits": {
    "physical": [
      "Physical object",
      "Biological or biologically-inspired",
      "Fixed/static",
      "Structural",
      "Perceptible",
      "Material form",
      "Passive"
    ],
    "functional": [],
    "abstract": [],
    "social": [
      "Visible"
    ]
  },
  "image": "images/human_femur.png",
  "feedback": {
    "Physical object": "Included — The femur is a tangible, discrete, material component of the human body.",
    "Man-made / synthetic": "Excluded — Naturally occurring anatomical structure, not synthetic.",
    "Biological or biologically-inspired": "Included — It is a biological organ derived from evolutionary processes.",
    "Fixed/static": "Included — Once formed, the femur maintains a fixed shape and position relative to the body.",
    "Structural": "Included — It is the primary load-bearing bone of the leg, contributing to bodily structure.",
    "Perceptible": "Included — While internal, it is visible in anatomical models, scans, and dissection.",
    "Material form": "Included — Made of calcified biological tissue, it has physical and chemical substance.",
    "Passive": "Included — It does not act or change behavior autonomously; function is determined externally.",
    "Purposeful / intentional": "Excluded — The femur has evolved utility but no intrinsic intention.",
    "Emits output / produces effect": "Excluded — Does not produce output by itself; part of mechanical leverage in the body but not active.",
    "Processes or regulates logic/signals": "Excluded — No role in cognitive, signal, or control processing.",
    "Transforms or modifies internal state": "Excluded — Does not undergo dynamic internal changes in ordinary use.",
    "Interacts with humans directly": "Excluded — Not externally interactive in its natural anatomical role.",
    "Part of a larger system": "Excluded — Although anatomically part of the musculoskeletal system, UHT minimalism excludes this unless essential to identity.",
    "Autonomous in function": "Excluded — Requires muscles, nerves, and intention to operate; no autonomy.",
    "System-critical": "Excluded — Important biologically, but not critical as a standalone object per UHT strict standards.",
    "Symbolic / representational": "Excluded — Not symbolic in default identity; only in anthropological or cultural contexts.",
    "Communicative": "Excluded — Does not convey information or participate in communication.",
    "Logical / rule-based": "Excluded — Biological formation has regularities, but not rules in the logical or computational sense.",
    "Hierarchical / modular": "Excluded — Not composed of subordinate modules; it is a single anatomical unit.",
    "Behavior-guiding": "Excluded — Does not affect behavior on its own.",
    "Self-referential / meta-conceptual": "Excluded — Not conceptually recursive or self-modelling.",
    "Temporal": "Excluded — Exists through time, but not defined by temporality in essence.",
    "Contextual abstraction": "Excluded — Its identity is stable across contexts; not abstracted differently depending on use.",
    "Socially / culturally constructed": "Excluded — Its existence precedes and is independent of social construction.",
    "Defined by a group/system": "Excluded — Definition is biological, not institutionally or socially imposed.",
    "Linked to identity or role": "Excluded — Does not indicate social identity, role, or function unless symbolically appropriated.",
    "Regulated / governed": "Excluded — Not regulated in itself; medical treatment might be, but that is contextual.",
    "Teachable / transmissible": "Excluded — While knowledge of it is taught, the object itself is not a teaching construct.",
    "Visible": "Included — While normally internal, it is clearly visible in imaging, models, and education.",
    "Context-sensitive": "Excluded — The object’s form and identity do not meaningfully shift across contexts.",
    "Widely known": "Excluded — Recognizable within anatomy or medicine, but not universally known like 'heart' or 'eye'."
  }
}

,
{
  "entity": "Lava Flow",
  "uht_code": "865A2207",
  "image_url": "/validation_set/images/lava_flow.png",
  "traits": {
    "physical": [
      "Physical object",
      "Perceptible",
      "Material form"
    ],
    "functional": [
      "Emits output / produces effect",
      "Transforms or modifies internal state",
      "Part of a larger system",
      "Autonomous in function"
    ],
    "abstract": [
      "Logical / rule-based",
      "Temporal"
    ],
    "social": [
      "Teachable / transmissible",
      "Visible",
      "Widely known"
    ]
  },
  "feedback": {
    "Physical object": "Included — Lava has tangible, spatially continuous material form.",
    "Man-made / synthetic": "Excluded — It is a naturally occurring geological event.",
    "Biological or biologically-inspired": "Excluded — Not derived from or imitative of biological systems.",
    "Fixed/static": "Excluded — It is dynamic and fluid by nature.",
    "Structural": "Excluded — It is not a load-bearing or support structure.",
    "Perceptible": "Included — Observable by sight, touch, and thermal sensors.",
    "Material form": "Included — Composed of molten rock, physically and chemically defined.",
    "Passive": "Excluded — It is an active, transformative physical process.",
    "Purposeful / intentional": "Excluded — Has no goal or design.",
    "Emits output / produces effect": "Included — Alters terrain, generates heat, and causes environmental changes.",
    "Processes or regulates logic/signals": "Excluded — Not informational or computational.",
    "Transforms or modifies internal state": "Included — Cools and solidifies, transitioning material phase.",
    "Interacts with humans directly": "Excluded — It affects humans, but not interactively or responsively.",
    "Part of a larger system": "Included — A component of volcanic/geological cycles.",
    "Autonomous in function": "Included — Operates according to physical principles without intervention.",
    "System-critical": "Excluded — While significant, it is not essential to Earth’s system functions.",
    "Symbolic / representational": "Excluded — May be metaphorically used, but not inherently symbolic.",
    "Communicative": "Excluded — Does not convey or encode information.",
    "Logical / rule-based": "Included — Governed by deterministic physical laws.",
    "Hierarchical / modular": "Excluded — Not composed of parts in a modular structure.",
    "Behavior-guiding": "Excluded — Does not instruct or guide action.",
    "Self-referential / meta-conceptual": "Excluded — Not capable of modeling itself.",
    "Temporal": "Included — Occurs over time and has distinct beginning and end phases.",
    "Contextual abstraction": "Excluded — Has consistent identity regardless of context.",
    "Socially / culturally constructed": "Excluded — Exists independently of human culture.",
    "Defined by a group/system": "Excluded — Not defined by institutional or cultural systems.",
    "Linked to identity or role": "Excluded — Not associated with roles or identity.",
    "Regulated / governed": "Excluded — Not subject to governance.",
    "Teachable / transmissible": "Included — Commonly taught in earth sciences.",
    "Visible": "Included — Highly visible and often dramatic in appearance.",
    "Context-sensitive": "Excluded — Meaning and function remain consistent across contexts.",
    "Widely known": "Included — Well-known natural event worldwide."
  }
}

,
{
  "entity": "Magnet",
  "uht_code": "D6CE200D",
  "image_url": "/validation_set/images/magnet.png",
  "traits": {
    "physical": [
      "Physical object",
      "Man-made / synthetic",
      "Fixed/static",
      "Perceptible",
      "Material form"
    ],
    "functional": [
      "Purposeful / intentional",
      "Emits output / produces effect",
      "Interacts with humans directly",
      "Part of a larger system",
      "Autonomous in function"
    ],
    "abstract": [
      "Logical / rule-based"
    ],
    "social": [
      "Teachable / transmissible",
      "Visible",
      "Widely known"
    ]
  },
  "feedback": {
    "Physical object": "Included — A tangible object occupying space and observable via its magnetic effects.",
    "Man-made / synthetic": "Included — Most magnets are industrially produced.",
    "Biological or biologically-inspired": "Excluded — Not derived from or imitative of biological systems.",
    "Fixed/static": "Included — Maintains polarity and shape unless physically altered.",
    "Structural": "Excluded — Not used as a load-bearing or architectural frame.",
    "Perceptible": "Included — Perceivable directly (shape, texture) and indirectly (magnetic force).",
    "Material form": "Included — Composed of ferromagnetic substances like iron or neodymium.",
    "Passive": "Excluded — Actively emits a magnetic field; not behaviorally inert.",
    "Purposeful / intentional": "Included — Designed or selected to attract, hold, or actuate objects.",
    "Emits output / produces effect": "Included — Emits a magnetic field with detectable force.",
    "Processes or regulates logic/signals": "Excluded — Not a logic processor or signal controller by itself.",
    "Transforms or modifies internal state": "Excluded — Magnetic state remains fixed unless externally altered.",
    "Interacts with humans directly": "Included — Grasped, used, or positioned by hand in everyday applications.",
    "Part of a larger system": "Included — Commonly found in motors, sensors, locks, or devices.",
    "Autonomous in function": "Included — Once magnetized, operates independently without further input.",
    "System-critical": "Excluded — Not universally critical to any system (e.g., not required in all machines).",
    "Symbolic / representational": "Excluded — Not inherently representative or metaphorical.",
    "Communicative": "Excluded — Does not transmit or encode meaning or information.",
    "Logical / rule-based": "Included — Magnetic behavior obeys deterministic physical laws (e.g., Maxwell’s equations).",
    "Hierarchical / modular": "Excluded — Not composed of distinct subunits or functional layers.",
    "Behavior-guiding": "Excluded — Does not alter human behavior in a directive or regulatory way.",
    "Self-referential / meta-conceptual": "Excluded — Lacks abstract recursion or self-modeling.",
    "Temporal": "Excluded — Magnetic fields are persistent; time plays no intrinsic role.",
    "Contextual abstraction": "Excluded — Its meaning and use are consistent across domains.",
    "Socially / culturally constructed": "Excluded — Exists independently of human classification systems.",
    "Defined by a group/system": "Excluded — Not defined or governed by collective human rules.",
    "Linked to identity or role": "Excluded — Magnets are not identity markers or social role indicators.",
    "Regulated / governed": "Excluded — Not regulated as a class of objects (though some uses might be).",
    "Teachable / transmissible": "Included — Magnetic theory is widely taught in science education.",
    "Visible": "Included — The magnet itself is visible, even if its field is not.",
    "Context-sensitive": "Excluded — Identity and function remain constant regardless of setting.",
    "Widely known": "Included — Universally recognized object with clear public familiarity."
  }
}

,
{
  "entity": "Mars Rock Sample",
  "uht_code": "87000000",
  "image_url": "/validation_set/images/mars_rock_sample.png",
  "traits": {
    "physical": [
      "Physical object",
      "Perceptible",
      "Material form",
      "Passive"
    ],
    "functional": [],
    "abstract": [],
    "social": []
  },
  "feedback": {
    "Physical object": "Included — A bounded, tangible geological object with discrete form.",
    "Man-made / synthetic": "Excluded — Naturally occurring; not fabricated or designed.",
    "Biological or biologically-inspired": "Excluded — Not inherently biological or derived from biological models.",
    "Fixed/static": "Excluded — Once extracted, it is mobile and not fixed in position.",
    "Structural": "Excluded — Plays no structural role in its isolated form.",
    "Perceptible": "Included — It can be seen and touched without tools; directly observable.",
    "Material form": "Included — It has physical substance, mass, and a coherent shape.",
    "Passive": "Included — Exhibits no agency or intrinsic behavior; only reacts under external forces.",
    
    "Purposeful / intentional": "Excluded — It was not designed or created for a purpose.",
    "Emits output / produces effect": "Excluded — It does not emit or produce effects independently.",
    "Processes or regulates logic/signals": "Excluded — No computational, regulatory, or signaling function.",
    "Transforms or modifies internal state": "Excluded — No autonomous state change; any reaction is passive.",
    "Interacts with humans directly": "Excluded — Any interaction is contextual, not a built-in interface.",
    "Part of a larger system": "Excluded — Once removed from geological context, it is isolated.",
    "Autonomous in function": "Excluded — Has no function, behavior, or system role.",
    "System-critical": "Excluded — Not essential to any defined system by default.",
    
    "Symbolic / representational": "Excluded — Not symbolic unless framed externally.",
    "Communicative": "Excluded — Does not carry or transmit information intrinsically.",
    "Logical / rule-based": "Excluded — Not governed by internal symbolic or operational logic.",
    "Hierarchical / modular": "Excluded — Lacks designed subsystems or modularity.",
    "Behavior-guiding": "Excluded — Does not influence behavior directly.",
    "Self-referential / meta-conceptual": "Excluded — It is not a model or concept about concepts.",
    "Temporal": "Excluded — Temporal existence is not abstracted into its identity.",
    "Contextual abstraction": "Excluded — It is a concrete material entity, not an abstraction.",
    
    "Socially / culturally constructed": "Excluded — Its meaning emerges from context, not construction.",
    "Defined by a group/system": "Excluded — Classification is extrinsic, not inherent.",
    "Linked to identity or role": "Excluded — Not tied to a role or personal identity.",
    "Regulated / governed": "Excluded — No rules or systems intrinsically govern it.",
    "Teachable / transmissible": "Excluded — It is not itself a semantic or symbolic unit.",
    "Visible": "Excluded — Subsumed by 'Perceptible'; not a socially visible role.",
    "Context-sensitive": "Excluded — Maintains identity across different contexts.",
    "Widely known": "Excluded — Known only in specialist or scientific domains."
  },
  "encoding_notes": "This encoding treats the Mars rock sample as a physical geological object, isolated from institutional, symbolic, or scientific contexts. Perceptible and Passive are now correctly included: it can be directly sensed and exhibits no agency or internal behavior. All functional, abstract, and social traits remain excluded under this narrow, intrinsic framing."
}

,
{
  "entity": "Paperclip",
  "uht_code": "D78800C5",
  "image_url": "/validation_set/images/paperclip.png",
  "traits": {
    "physical": [
      "Physical object",
      "Man-made / synthetic",
      "Fixed/static",
      "Perceptible",
      "Material form",
      "Passive"
    ],
    "functional": [
      "Purposeful / intentional",
      "Interacts with humans directly"
    ],
    "abstract": [],
    "social": [
      "Socially / culturally constructed",
      "Defined by a group/system",
      "Visible",
      "Widely known"
    ]
  },
  "feedback": {
    "Physical object": "Included — A tangible, discrete object occupying space.",
    "Man-made / synthetic": "Included — Designed and mass-produced by humans.",
    "Biological or biologically-inspired": "Excluded — No biological origin or mimicry.",
    "Fixed/static": "Included — Rigid in form and stable without external force.",
    "Structural": "Excluded — Not a load-bearing or framework element.",
    "Perceptible": "Included — Can be perceived by touch and sight.",
    "Material form": "Included — Has defined material composition (metal/plastic).",
    "Passive": "Included — Does not act or change autonomously.",
    "Purposeful / intentional": "Included — Designed for a clear function: binding paper.",
    "Emits output / produces effect": "Excluded — No emission or effect beyond holding by force.",
    "Processes or regulates logic/signals": "Excluded — Not a processing device.",
    "Transforms or modifies internal state": "Excluded — Does not dynamically alter itself.",
    "Interacts with humans directly": "Included — Intended for direct manual use.",
    "Part of a larger system": "Excluded — Not inherently system-bound or dependent.",
    "Autonomous in function": "Excluded — Requires external manipulation.",
    "System-critical": "Excluded — Not critical to any operational system.",
    "Symbolic / representational": "Excluded — Not inherently symbolic.",
    "Communicative": "Excluded — Does not transmit information.",
    "Logical / rule-based": "Excluded — Not based on logic operations.",
    "Hierarchical / modular": "Excluded — Not composed of modular subparts.",
    "Behavior-guiding": "Excluded — Does not influence behavior.",
    "Self-referential / meta-conceptual": "Excluded — Not conceptually recursive.",
    "Temporal": "Excluded — No intrinsic relation to time.",
    "Contextual abstraction": "Excluded — Identity remains stable across contexts.",
    "Socially / culturally constructed": "Included — Exists only due to human cultural systems.",
    "Defined by a group/system": "Included — Categorized and standardized within office/stationery domains.",
    "Linked to identity or role": "Excluded — Does not signal social role or identity.",
    "Regulated / governed": "Excluded — Not subject to meaningful regulation.",
    "Teachable / transmissible": "Excluded — Not taught as a concept; usage is intuitive.",
    "Visible": "Included — Commonly visible and recognizable.",
    "Context-sensitive": "Excluded — Maintains identity and function across settings.",
    "Widely known": "Included — Universally recognized object."
  }
}

,
{
  "entity": "Quartz Crystal",
  "uht_code": "9F002203",
  "image_url": "/validation_set/images/quartz_crystal.png",
  "traits": {
    "physical": [
      "Physical object",
      "Fixed/static",
      "Structural",
      "Perceptible",
      "Material form",
      "Passive"
    ],
    "functional": [],
    "abstract": [
      "Logical / rule-based",
      "Temporal"
    ],
    "social": [
      "Visible",
      "Widely known"
    ]
  },
  "feedback": {
    "Physical object": "Included — A quartz crystal is a tangible, spatially discrete physical object.",
    "Man-made / synthetic": "Excluded — Although sometimes synthesized, the default referent is a naturally occurring mineral.",
    "Biological or biologically-inspired": "Excluded — Quartz is entirely inorganic; no biological basis or biomimicry.",
    "Fixed/static": "Included — It is rigid, does not change form on its own, and is spatially fixed.",
    "Structural": "Included — Has an internal crystalline structure defined by a regular atomic lattice.",
    "Perceptible": "Included — Clearly perceptible through sight and touch.",
    "Material form": "Included — Possesses a definite material form composed of silicon dioxide.",
    "Passive": "Included — Does not emit, act, or self-modify; it is passively present.",
    "Purposeful / intentional": "Excluded — It has no inherent purpose unless used by external agents.",
    "Emits output / produces effect": "Excluded — While it can generate signals in devices, this is not intrinsic to the material itself.",
    "Processes or regulates logic/signals": "Excluded — It does not process information or signals by design.",
    "Transforms or modifies internal state": "Excluded — The object has no internal dynamics or state transformation under ordinary conditions.",
    "Interacts with humans directly": "Excluded — No direct interaction or responsiveness to human input.",
    "Part of a larger system": "Excluded — Quartz may be used in systems, but the entity alone is not system-bound.",
    "Autonomous in function": "Excluded — Has no autonomy or inherent function.",
    "System-critical": "Excluded — Not critical on its own to the operation of any system.",
    "Symbolic / representational": "Excluded — Not inherently symbolic or representative.",
    "Communicative": "Excluded — It conveys no messages or encoded communication.",
    "Logical / rule-based": "Included — Forms according to strict geometric and chemical rules; crystal symmetry is rule-based.",
    "Hierarchical / modular": "Excluded — Does not consist of modular or nested components.",
    "Behavior-guiding": "Excluded — Does not influence or prescribe behavior.",
    "Self-referential / meta-conceptual": "Excluded — Does not refer to or describe its own logic or concept.",
    "Temporal": "Included — Quartz's vibrational regularity enables timekeeping; temporal property is essential in applied contexts.",
    "Contextual abstraction": "Excluded — Its meaning does not flex based on context in a core material sense.",
    "Socially / culturally constructed": "Excluded — Exists independently of cultural designation.",
    "Defined by a group/system": "Excluded — Not defined by collective agreement or institutional designation.",
    "Linked to identity or role": "Excluded — Not tied to any identity or role unless metaphorically assigned.",
    "Regulated / governed": "Excluded — No regulation governs quartz itself; usage may be regulated but not the object.",
    "Teachable / transmissible": "Excluded — Not a transmissible cultural or educational artifact in and of itself.",
    "Visible": "Included — It is plainly visible and often visually recognized.",
    "Context-sensitive": "Excluded — The object’s identity is stable across contexts.",
    "Widely known": "Included — Widely known and recognized across global populations."
  }
}

,
{
  "entity": "Sandbag",
  "uht_code": "D3000000",
  "image_url": "/validation_set/images/sandbag.png",
  "traits": {
    "physical": [
      "Physical object",
      "Man-made / synthetic",
      "Fixed/static",
      "Material form",
      "Passive"
    ],
    "functional": [],
    "abstract": [],
    "social": []
  },
  "feedback": {
    "Physical object": "Included — A sandbag is a tangible, discrete object with physical boundaries.",
    "Man-made / synthetic": "Included — It is artificially constructed by humans; neither the sack nor the complete object exists naturally.",
    "Biological or biologically-inspired": "Excluded — It is neither living nor mimetic of biological systems.",
    "Fixed/static": "Included — Its use and identity rely on being stationary and heavy.",
    "Structural": "Excluded — It is not a load-bearing or framework-defining component.",
    "Perceptible": "Excluded — Visibility or detectability is not part of its intrinsic function.",
    "Material form": "Included — It consists of matter (e.g. sand and sack) and has solid, tangible form.",
    "Passive": "Included — It serves a passive role in resisting forces (e.g. impact, water) without transformation or output.",
    
    "Purposeful / intentional": "Excluded — It has no goal-directed function on its own.",
    "Emits output / produces effect": "Excluded — It does not emit signals or energy.",
    "Processes or regulates logic/signals": "Excluded — No processing or regulation capability.",
    "Transforms or modifies internal state": "Excluded — Its state does not change autonomously or functionally.",
    "Interacts with humans directly": "Excluded — It is handled but not interactive in any operational sense.",
    "Part of a larger system": "Excluded — Used within systems but not inherently part of one.",
    "Autonomous in function": "Excluded — It has no self-regulating or self-acting behavior.",
    "System-critical": "Excluded — It is not a core dependency in most systems.",
    
    "Symbolic / representational": "Excluded — It does not represent anything conceptually or symbolically by design.",
    "Communicative": "Excluded — It conveys no information.",
    "Logical / rule-based": "Excluded — Not governed by logic structures.",
    "Hierarchical / modular": "Excluded — Not composed of nested or structured modules.",
    "Behavior-guiding": "Excluded — It does not suggest or constrain behaviors inherently.",
    "Self-referential / meta-conceptual": "Excluded — Not conceptual or recursive.",
    "Temporal": "Excluded — It is not time-dependent.",
    "Contextual abstraction": "Excluded — Identity is not abstractly shifted by context.",
    
    "Socially / culturally constructed": "Excluded — Its meaning is not defined socially or symbolically.",
    "Defined by a group/system": "Excluded — It is not assigned a role by institutional systems.",
    "Linked to identity or role": "Excluded — It does not define any identity or affiliation.",
    "Regulated / governed": "Excluded — Not subject to formal rules or protocols by design.",
    "Teachable / transmissible": "Excluded — It is not a conceptual or procedural knowledge unit.",
    "Visible": "Excluded — Visibility is not functionally or socially defining.",
    "Context-sensitive": "Excluded — Its meaning does not change intrinsically across contexts.",
    "Widely known": "Excluded — Recognition does not define its core identity."
  },
  "encoding_notes": "This encoding reflects a standard sandbag as a physical object with no symbolic or functional abstraction. Traits included are intrinsic to its identity as a fabricated, heavy, passive object used to resist force or movement."
}

,
{
  "entity": "Snowflake",
  "uht_code": "9F000001",
  "image_url": "/validation_set/images/snowflake.png",
  "traits": {
    "physical": [
      "Physical object",
      "Fixed/static",
      "Structural",
      "Perceptible",
      "Material form",
      "Passive"
    ],
    "functional": [],
    "abstract": [],
    "social": [
      "Widely known"
    ]
  },
  "feedback": {
    "Physical object": "Included — A snowflake is a discrete, tangible entity with defined form.",
    "Man-made / synthetic": "Excluded — It occurs naturally through atmospheric processes.",
    "Biological or biologically-inspired": "Excluded — It is a physical crystal, not derived from or modeled on biology.",
    "Fixed/static": "Included — Once formed, its geometry is stable (until it melts).",
    "Structural": "Included — Exhibits a defined internal lattice structure (hexagonal symmetry).",
    "Perceptible": "Included — Can be seen with the naked eye or microscope.",
    "Material form": "Included — Made of condensed water in solid (ice) form.",
    "Passive": "Included — Has no active function or energy output; it simply exists.",
    
    "Purposeful / intentional": "Excluded — Not designed or built with intent; emerges from natural physics.",
    "Emits output / produces effect": "Excluded — Does not emit signals, energy, or produce active effects.",
    "Processes or regulates logic/signals": "Excluded — No capacity for processing information or signals.",
    "Transforms or modifies internal state": "Excluded — Does not change its own state intentionally or persistently.",
    "Interacts with humans directly": "Excluded — Can be touched or observed, but has no designed interaction.",
    "Part of a larger system": "Excluded — Not inherently a subsystem; exists independently in nature.",
    "Autonomous in function": "Excluded — Has no functional behavior or self-driven process.",
    "System-critical": "Excluded — Not essential to any operational system by itself.",
    
    "Symbolic / representational": "Excluded — May be used symbolically in culture, but this is external attribution.",
    "Communicative": "Excluded — Does not convey or encode information by design.",
    "Logical / rule-based": "Excluded — Its shape is governed by physical rules, but it is not itself a logic structure.",
    "Hierarchical / modular": "Excluded — Geometric symmetry exists, but it is not built as a modular hierarchy.",
    "Behavior-guiding": "Excluded — Has no influence on behavior.",
    "Self-referential / meta-conceptual": "Excluded — Does not model or reference itself or abstract concepts.",
    "Temporal": "Excluded — Exists over time, but time is not an identity-defining feature.",
    "Contextual abstraction": "Excluded — Not an abstraction or generalization.",
    
    "Socially / culturally constructed": "Excluded — Exists independently of human classification or invention.",
    "Defined by a group/system": "Excluded — It is a natural formation, not institutionally defined.",
    "Linked to identity or role": "Excluded — Not associated with personal or group identity.",
    "Regulated / governed": "Excluded — Not subject to social or legal regulation.",
    "Teachable / transmissible": "Excluded — It is a natural object, not an instructional medium.",
    "Visible": "Excluded — Perceptible in the physical sense, but not symbolically or socially visible.",
    "Context-sensitive": "Excluded — Its identity does not change based on social or functional context.",
    "Widely known": "Included — Snowflakes are globally recognized phenomena across cultures."
  },
  "encoding_notes": "This encoding treats the snowflake as a specific instance of a naturally formed ice crystal, not as a cultural or symbolic motif. Traits are limited strictly to physical structure and recognition. No symbolic, logical, or functional attributes are inferred beyond observable material properties."
}

,
{
  "entity": "Tungsten Filament",
  "uht_code": "DEC40045",
  "image_url": "/validation_set/images/tungsten_filament.png",
  "traits": {
    "physical": [
      "Physical object",
      "Man-made / synthetic",
      "Fixed/static",
      "Structural",
      "Perceptible",
      "Material form"
    ],
    "functional": [
      "Purposeful / intentional",
      "Emits output / produces effect",
      "Part of a larger system"
    ],
    "abstract": [],
    "social": [
      "Defined by a group/system",
      "Visible",
      "Widely known"
    ]
  },
  "feedback": {
    "Physical object": "Included — A tangible, bounded metallic component.",
    "Man-made / synthetic": "Included — Industrially manufactured using refined tungsten.",
    "Biological or biologically-inspired": "Excluded — Has no biological origin or mimicry.",
    "Fixed/static": "Included — Rigid and maintains its form under normal operating conditions.",
    "Structural": "Included — Designed to maintain coiled geometry under heat stress and to emit efficiently.",
    "Perceptible": "Included — Visible within clear bulbs and other open designs.",
    "Material form": "Included — Made from solid metallic tungsten.",
    "Passive": "Excluded — Requires electrical current to function and emits active output.",
    
    "Purposeful / intentional": "Included — Engineered to produce light via electrical resistance.",
    "Emits output / produces effect": "Included — Emits visible light and infrared heat.",
    "Processes or regulates logic/signals": "Excluded — No signal modulation or computation.",
    "Transforms or modifies internal state": "Excluded — Does not retain or change persistent internal conditions.",
    "Interacts with humans directly": "Excluded — Indirectly affects human environment but not interactive by design.",
    "Part of a larger system": "Included — Serves within the electrical and structural system of a bulb.",
    "Autonomous in function": "Excluded — Requires connection to power and structure.",
    "System-critical": "Excluded — Not inherently critical outside its specific design role.",
    
    "Symbolic / representational": "Excluded — Not a representational element.",
    "Communicative": "Excluded — Emits light but does not convey symbolic or coded information.",
    "Logical / rule-based": "Excluded — Behavior is governed by physics, not logical design.",
    "Hierarchical / modular": "Excluded — Not composed of logical subsystems.",
    "Behavior-guiding": "Excluded — Does not influence decisions or behavior directly.",
    "Self-referential / meta-conceptual": "Excluded — Not capable of reflective structure.",
    "Temporal": "Excluded — Lifespan exists but not identity-defining.",
    "Contextual abstraction": "Excluded — Not an abstraction or generalized concept.",
    
    "Socially / culturally constructed": "Excluded — A technical component, not a cultural category.",
    "Defined by a group/system": "Included — Categorized and specified by industrial design standards (e.g., wattage, filament type).",
    "Linked to identity or role": "Excluded — Not associated with identity or social roles.",
    "Regulated / governed": "Excluded — Bulb-level regulation may apply, but not intrinsic to the filament itself.",
    "Teachable / transmissible": "Excluded — Function is demonstrable, but the object is not a teaching medium.",
    "Visible": "Included — Often seen directly (especially in Edison-style bulbs), has a public-facing design component.",
    "Context-sensitive": "Excluded — Retains its identity and function regardless of environment.",
    "Widely known": "Included — Commonly recognized due to its legacy role in lighting technology."
  },
  "encoding_notes": "This encoding treats the tungsten filament as a standalone engineered component — distinct from the complete light bulb. It emphasizes physical form and engineered function while excluding abstract or symbolic associations. Social traits are selectively included based on industrial classification and public visibility, not metaphor or regulation."
}

,
{
  "entity": "Academic Citation",
  "uht_code": "0084C1FF",
  "image_url": "/validation_set/images/academic_citation.png",
  "traits": {
    "physical": [],
    "functional": [
      "Purposeful / intentional",
      "Part of a larger system"
    ],
    "abstract": [
      "Symbolic / representational",
      "Communicative",
      "Contextual abstraction"
    ],
    "social": [
      "Socially / culturally constructed",
      "Defined by a group/system",
      "Linked to identity or role",
      "Regulated / governed",
      "Teachable / transmissible",
      "Visible",
      "Context-sensitive",
      "Widely known"
    ]
  },
  "feedback": {
    "Physical object": "Excluded — A citation is a referential structure, not a tangible item.",
    "Man-made / synthetic": "Excluded — Though created, it is abstract and not fabricated.",
    "Biological or biologically-inspired": "Excluded — It has no biological or organic origin.",
    "Fixed/static": "Excluded — Citation formats and usages evolve.",
    "Structural": "Excluded — It is not a structural framework.",
    "Perceptible": "Excluded — Its visual form is perceptible, but the citation concept itself is abstract.",
    "Material form": "Excluded — Exists as formatted text, not a material entity.",
    "Passive": "Excluded — It carries active functional and referential intent.",

    "Purposeful / intentional": "Included — Citations are deliberate acts of attribution and reference.",
    "Emits output / produces effect": "Excluded — It does not produce output independently.",
    "Processes or regulates logic/signals": "Excluded — It is not a logical operator.",
    "Transforms or modifies internal state": "Excluded — It does not perform transformation.",
    "Interacts with humans directly": "Excluded — It is not an interface or tool.",
    "Part of a larger system": "Included — Citations are integral to academic writing and publication ecosystems.",
    "Autonomous in function": "Excluded — Requires human authorship and system context.",
    "System-critical": "Excluded — Though important, not singularly critical to knowledge systems.",

    "Symbolic / representational": "Included — Represents a source, credit, or intellectual lineage.",
    "Communicative": "Included — Communicates acknowledgment, provenance, and relationships.",
    "Logical / rule-based": "Excluded — Though governed by rules, it is not itself a logic structure.",
    "Hierarchical / modular": "Excluded — Not modular by design.",
    "Behavior-guiding": "Excluded — While it influences practices, that’s secondary to its referential role.",
    "Self-referential / meta-conceptual": "Excluded — Does not reference itself or model systems.",
    "Temporal": "Excluded — Although tied to time (publication date), that’s metadata not core identity.",
    "Contextual abstraction": "Included — Its meaning and function depend on the surrounding academic context.",

    "Socially / culturally constructed": "Included — Citation norms vary by discipline and culture.",
    "Defined by a group/system": "Included — Governed by academic style guides and institutions.",
    "Linked to identity or role": "Included — Citations directly associate content with authorship, linking to personal and professional identity.",
    "Regulated / governed": "Included — Subject to formal citation rules and formatting standards.",
    "Teachable / transmissible": "Included — Taught in educational settings as a fundamental scholarly practice.",
    "Visible": "Included — Rendered textually in documents.",
    "Context-sensitive": "Included — Meaning changes by context (discipline, genre, citation style).",
    "Widely known": "Included — Broadly understood in academic and publishing circles."
  },
  "encoding_notes": "The citation is treated here as an abstract-social artifact that functions symbolically and communicatively within the academic knowledge system. Its identity depends on institutional context, conventions, and referential purpose. The corrected code '0084C1FF' faithfully reflects its linked identity function and embedded social meaning."
}

,
{
  "entity": "Birth Certificate",
  "uht_code": "0084C1FF",
  "image_url": "/validation_set/images/birth_certificate.png",
  "traits": {
    "physical": [],
    "functional": [
      "Purposeful / intentional",
      "Part of a larger system"
    ],
    "abstract": [
      "Symbolic / representational",
      "Communicative",
      "Contextual abstraction"
    ],
    "social": [
      "Socially / culturally constructed",
      "Defined by a group/system",
      "Linked to identity or role",
      "Regulated / governed",
      "Teachable / transmissible",
      "Visible",
      "Context-sensitive",
      "Widely known"
    ]
  },
  "feedback": {
    "Physical object": "Excluded — The certificate is a document, but its semantic identity is informational and abstract.",
    "Man-made / synthetic": "Excluded — Though created by institutions, its essence is not that of a synthetic object.",
    "Biological or biologically-inspired": "Excluded — It pertains to biological facts but is not itself biological.",
    "Fixed/static": "Excluded — It may be amended (e.g., name or gender corrections).",
    "Structural": "Excluded — It is not a component of a physical or architectural structure.",
    "Perceptible": "Excluded — Its content is readable, but the birth certificate as an institutional construct is abstract.",
    "Material form": "Excluded — The physical form is incidental; its function lies in its encoded identity.",
    "Passive": "Excluded — It enables bureaucratic and legal action, so not purely passive.",

    "Purposeful / intentional": "Included — Issued deliberately to document and authorize a legal identity.",
    "Emits output / produces effect": "Excluded — Does not independently produce signals or data.",
    "Processes or regulates logic/signals": "Excluded — Not a processing system.",
    "Transforms or modifies internal state": "Excluded — While impactful, it does not enact change autonomously.",
    "Interacts with humans directly": "Excluded — It is not an interface or tool.",
    "Part of a larger system": "Included — Embedded in vital records, health, identity, and legal systems.",
    "Autonomous in function": "Excluded — Requires validation and use by external institutions.",
    "System-critical": "Excluded — A system can function even with incomplete record coverage.",

    "Symbolic / representational": "Included — Encodes personal identity and legal recognition.",
    "Communicative": "Included — Communicates certified information to institutions and individuals.",
    "Logical / rule-based": "Excluded — Structured by rules, but not itself a logic-executing object.",
    "Hierarchical / modular": "Excluded — Not decomposable into modular parts.",
    "Behavior-guiding": "Excluded — While influential, it does not prescribe behavior directly.",
    "Self-referential / meta-conceptual": "Excluded — It does not describe or encode its own function.",
    "Temporal": "Excluded — It records a date, but temporality is not its identity.",
    "Contextual abstraction": "Included — Its validity and interpretation depend entirely on legal and bureaucratic context.",

    "Socially / culturally constructed": "Included — Exists due to social conventions of identity tracking.",
    "Defined by a group/system": "Included — Created and authorized by legal or governmental institutions.",
    "Linked to identity or role": "Included — Defines a legal identity at birth.",
    "Regulated / governed": "Included — Subject to formal record-keeping laws and certification standards.",
    "Teachable / transmissible": "Included — Its role and function are taught through civic and bureaucratic systems.",
    "Visible": "Included — Used as proof in legal and bureaucratic contexts.",
    "Context-sensitive": "Included — The meaning and format vary across nations, jurisdictions, and historical periods.",
    "Widely known": "Included — Nearly universally recognized as an institutional category."
  },
  "encoding_notes": "The birth certificate is encoded as a symbolic, communicative, legally embedded construct that represents identity through institutional context. While instantiated in physical documents, its ontological role is abstract and systemic. The corrected code '0084C1FF' reflects its functional intent, referential role, and social regulation."
}

,
{
  "entity": "Copyright Law",
  "uht_code": "0000F9FF",
  "image_url": "/validation_set/images/copyright_law.png",
  "traits": {
    "physical": [],
    "functional": [],
    "abstract": [
      "Symbolic / representational",
      "Communicative",
      "Logical / rule-based",
      "Hierarchical / modular",
      "Behavior-guiding",
      "Contextual abstraction"
    ],
    "social": [
      "Socially / culturally constructed",
      "Defined by a group/system",
      "Linked to identity or role",
      "Regulated / governed",
      "Teachable / transmissible",
      "Visible",
      "Context-sensitive",
      "Widely known"
    ]
  },
  "feedback": {
    "Physical object": "Excluded — A law is an abstract construct with no inherent materiality.",
    "Man-made / synthetic": "Excluded — This trait is reserved for tangible, constructed entities.",
    "Biological or biologically-inspired": "Excluded — No relation to biology.",
    "Fixed/static": "Excluded — Laws evolve over time through amendments.",
    "Structural": "Excluded — The structure is conceptual, not physical.",
    "Perceptible": "Excluded — Perception occurs through its representations.",
    "Material form": "Excluded — The document is material, but the law is not.",
    "Passive": "Excluded — Not relevant for non-material entities.",
    
    "Purposeful / intentional": "Excluded — While created intentionally, the law itself is not a functioning agent.",
    "Emits output / produces effect": "Excluded — Enforcement causes effects, not the law intrinsically.",
    "Processes or regulates logic/signals": "Excluded — Law is referenced and interpreted, not autonomously processing anything.",
    "Transforms or modifies internal state": "Excluded — It does not possess a mutable state.",
    "Interacts with humans directly": "Excluded — It is intermediated through institutions or documents.",
    "Part of a larger system": "Excluded — Not a mechanistic subsystem.",
    "Autonomous in function": "Excluded — Requires agents for effect.",
    "System-critical": "Excluded — Fundamental to society, but not to a system in a functional engineering sense.",
    
    "Symbolic / representational": "Included — Expresses abstract rights, duties, and principles.",
    "Communicative": "Included — Written and broadcast to inform behavior and expectations.",
    "Logical / rule-based": "Included — Defines structured conditions for permission, prohibition, and enforcement.",
    "Hierarchical / modular": "Included — Legal systems organize laws into articles, sections, and precedence structures.",
    "Behavior-guiding": "Included — Explicitly intended to guide and constrain human action.",
    "Self-referential / meta-conceptual": "Excluded — A law does not inherently refer to itself.",
    "Temporal": "Excluded — While it has temporal conditions (e.g. durations), that is not intrinsic to all laws.",
    "Contextual abstraction": "Included — Applicability depends on jurisdiction, context, and interpretation.",
    
    "Socially / culturally constructed": "Included — Law is an institutional norm system.",
    "Defined by a group/system": "Included — Formally defined by governments or courts.",
    "Linked to identity or role": "Included — It governs authorship, ownership, and access.",
    "Regulated / governed": "Included — It is the codification of governance.",
    "Teachable / transmissible": "Included — A foundation of civic and legal education.",
    "Visible": "Included — Publicly documented and referenced.",
    "Context-sensitive": "Included — Application and enforcement vary by case and region.",
    "Widely known": "Included — Copyright is a well-known concept even among laypeople."
  },
  "encoding_notes": "This encoding captures Copyright Law as an abstract, symbolic, behavior-guiding system embedded in formal social regulation. It deliberately excludes all physical and functional traits, emphasizing law’s identity as a logical rule set that exists only through social consensus and institutional enforcement. The prior omission of hierarchical structure has been corrected to reflect legal modularity."
}

,
{
  "entity": "Corporate Org Chart",
  "uht_code": "0084B0FF",
  "image_url": "/validation_set/images/corporate_org_chart.png",
  "traits": {
    "physical": [],
    "functional": [
      "Purposeful / intentional",
      "Part of a larger system"
    ],
    "abstract": [
      "Symbolic / representational",
      "Logical / rule-based",
      "Hierarchical / modular"
    ],
    "social": [
      "Socially / culturally constructed",
      "Defined by a group/system",
      "Linked to identity or role",
      "Regulated / governed",
      "Teachable / transmissible",
      "Visible",
      "Context-sensitive",
      "Widely known"
    ]
  },
  "feedback": {
    "Physical object": "Excluded — The org chart is typically a visual or digital abstraction, not a tangible object itself.",
    "Man-made / synthetic": "Excluded — While created by humans, it has no synthetic material form.",
    "Biological or biologically-inspired": "Excluded — Its structure may echo biological hierarchies, but it is not biologically based.",
    "Fixed/static": "Excluded — Org charts evolve over time with company structure.",
    "Structural": "Excluded — It is not a physical structure but a conceptual one.",
    "Perceptible": "Excluded — Its depiction is perceptible, but the chart as a system is abstract.",
    "Material form": "Excluded — Exists in printed or digital forms, but not as intrinsic material entity.",
    "Passive": "Excluded — It plays an active role in communicating hierarchy and authority.",

    "Purposeful / intentional": "Included — Org charts are created to communicate organizational roles and authority.",
    "Emits output / produces effect": "Excluded — It does not independently generate effects.",
    "Processes or regulates logic/signals": "Excluded — It is not a signal processor.",
    "Transforms or modifies internal state": "Excluded — It does not autonomously alter system states.",
    "Interacts with humans directly": "Excluded — It is a reference diagram, not an interface.",
    "Part of a larger system": "Included — It reflects the formal structure of a corporate or institutional system.",
    "Autonomous in function": "Excluded — It must be updated and maintained by people.",
    "System-critical": "Excluded — Useful but not foundational to the existence of the organization.",

    "Symbolic / representational": "Included — Represents roles, reporting lines, and institutional hierarchy.",
    "Communicative": "Excluded — While it conveys information, it is not itself a communicative agent.",
    "Logical / rule-based": "Included — Encodes relationships based on organizational rules and policies.",
    "Hierarchical / modular": "Included — It is a direct representation of hierarchical structure.",
    "Behavior-guiding": "Excluded — It reflects roles rather than prescribes behavior.",
    "Self-referential / meta-conceptual": "Excluded — It does not describe itself or model model-making.",
    "Temporal": "Excluded — Though subject to change over time, it does not intrinsically express time.",
    "Contextual abstraction": "Excluded — It is specific to organizational context but not abstracted across contexts.",

    "Socially / culturally constructed": "Included — Reflects social and cultural norms about organization and hierarchy.",
    "Defined by a group/system": "Included — Created and maintained by the institution it represents.",
    "Linked to identity or role": "Included — Maps roles to people, embedding identity in structure.",
    "Regulated / governed": "Included — Conforms to HR policies and corporate governance standards.",
    "Teachable / transmissible": "Included — Used in training and orientation.",
    "Visible": "Included — Presented in public/internal documents, slide decks, and dashboards.",
    "Context-sensitive": "Included — Varies significantly across cultures and institutions.",
    "Widely known": "Included — The concept and format of org charts are broadly recognized across industries."
  },
  "encoding_notes": "The corporate org chart is modeled here as a symbolic-abstract-social artifact that encodes organizational structure and roles. It is intentionally designed, embedded in institutional logic, and governed by formal rules. While visually represented, it is not a physical object, but rather a model of social architecture. The corrected code '0084B0FF' faithfully reflects the selected traits."
}

,
{
  "entity": "Cultural Taboo",
  "uht_code": "000089FF",
  "image_url": "/validation_set/images/cultural_taboo.png",
  "traits": {
    "physical": [],
    "functional": [],
    "abstract": [
      "Symbolic / representational",
      "Behavior-guiding",
      "Contextual abstraction"
    ],
    "social": [
      "Socially / culturally constructed",
      "Defined by a group/system",
      "Linked to identity or role",
      "Regulated / governed",
      "Teachable / transmissible",
      "Visible",
      "Context-sensitive",
      "Widely known"
    ]
  },
  "feedback": {
    "Physical object": "Excluded — A taboo is not a tangible entity or object.",
    "Man-made / synthetic": "Excluded — It is socially emergent rather than synthetically designed.",
    "Biological or biologically-inspired": "Excluded — Taboos are not grounded in biological function or form.",
    "Fixed/static": "Excluded — They vary across cultures and time.",
    "Structural": "Excluded — Lacks physical or architectural structure.",
    "Perceptible": "Excluded — Not directly perceivable through the senses.",
    "Material form": "Excluded — Does not possess any material instantiation.",
    "Passive": "Excluded — Not an inert or reactive entity.",
    
    "Purposeful / intentional": "Excluded — While culturally enforced, a taboo is not a designed agent or tool.",
    "Emits output / produces effect": "Excluded — It influences behavior, but not through outputs in a functional system sense.",
    "Processes or regulates logic/signals": "Excluded — Not a logical or computational regulator.",
    "Transforms or modifies internal state": "Excluded — Not an active agent modifying its own state or others’ states.",
    "Interacts with humans directly": "Excluded — It exerts influence via norms, not through interface-like interaction.",
    "Part of a larger system": "Excluded — Though embedded in culture, it is not a technical system component.",
    "Autonomous in function": "Excluded — Relies on cultural context and enforcement.",
    "System-critical": "Excluded — Not a required subsystem of a formal system.",
    
    "Symbolic / representational": "Included — Taboos represent abstract boundaries or prohibitions.",
    "Communicative": "Excluded — A taboo is not itself a medium for transmission, even if its presence is communicated.",
    "Logical / rule-based": "Excluded — Often enforced without consistent logical rules.",
    "Hierarchical / modular": "Excluded — Not part of a nested or tiered structure.",
    "Behavior-guiding": "Included — Its primary role is to guide or constrain behavior.",
    "Self-referential / meta-conceptual": "Excluded — Does not model itself or reference its own logic.",
    "Temporal": "Excluded — Not intrinsically defined by time or temporal behavior.",
    "Contextual abstraction": "Included — Taboos are highly abstract and deeply dependent on social and cultural context.",
    
    "Socially / culturally constructed": "Included — By definition, taboos emerge from social norms and customs.",
    "Defined by a group/system": "Included — A taboo only exists through shared social agreement.",
    "Linked to identity or role": "Included — Observing or violating taboos can signify identity or role within a group.",
    "Regulated / governed": "Included — They are often enforced by implicit or explicit rules within communities.",
    "Teachable / transmissible": "Included — Passed on through socialization, instruction, and cultural norms.",
    "Visible": "Included — While abstract, the consequences or boundaries are usually visible through social reaction.",
    "Context-sensitive": "Included — What constitutes a taboo is dependent on culture, time, and situation.",
    "Widely known": "Included — A taboo must be broadly recognized within its group to function effectively."
  },
  "encoding_notes": "This encoding treats 'Cultural Taboo' as a **conceptual boundary or prohibition** that is culturally transmitted and behaviorally enforced. It avoids inclusion of any traits that rely on metaphor, physical embodiment, or enforcement mechanisms unless they are intrinsic to the definition of the taboo itself."
}

,
{
  "entity": "Employment Contract",
  "uht_code": "0084A9FF",
  "image_url": "/validation_set/images/employment_contract.png",
  "traits": {
    "physical": [],
    "functional": [
      "Purposeful / intentional",
      "Part of a larger system"
    ],
    "abstract": [
      "Symbolic / representational",
      "Logical / rule-based",
      "Behavior-guiding",
      "Contextual abstraction"
    ],
    "social": [
      "Socially / culturally constructed",
      "Defined by a group/system",
      "Linked to identity or role",
      "Regulated / governed",
      "Teachable / transmissible",
      "Visible",
      "Context-sensitive",
      "Widely known"
    ]
  },
  "feedback": {
    "Physical object": "Excluded — The contract is an abstract agreement, even if instantiated on paper or screen.",
    "Man-made / synthetic": "Excluded — While drafted by humans, its identity is not based on material fabrication.",
    "Biological or biologically-inspired": "Excluded — It is not derived from biological systems.",
    "Fixed/static": "Excluded — Terms can be amended or renegotiated.",
    "Structural": "Excluded — It is not a physical or architectural structure.",
    "Perceptible": "Excluded — The content can be read, but the contract as a semantic entity is abstract.",
    "Material form": "Excluded — Instantiated via documents, but not materially defined.",
    "Passive": "Excluded — It imposes obligations and grants rights; not passive.",

    "Purposeful / intentional": "Included — Created deliberately to define working relationships and obligations.",
    "Emits output / produces effect": "Excluded — It does not generate output directly, though it has legal effects.",
    "Processes or regulates logic/signals": "Excluded — Not computational or signal-based.",
    "Transforms or modifies internal state": "Excluded — Relies on parties for enforcement and interpretation.",
    "Interacts with humans directly": "Excluded — Not an interface, but a formalized agreement.",
    "Part of a larger system": "Included — Exists within legal, corporate, and labor systems.",
    "Autonomous in function": "Excluded — Dependent on recognition and enforcement.",
    "System-critical": "Excluded — Important, but not essential to the operation of all systems.",

    "Symbolic / representational": "Included — Encodes mutual obligations and roles.",
    "Communicative": "Excluded — Communicates indirectly through format, but not communicative in structure.",
    "Logical / rule-based": "Included — Expresses rules, obligations, and permissions.",
    "Hierarchical / modular": "Excluded — Often structured, but not intrinsically modular.",
    "Behavior-guiding": "Included — Directs permissible and expected actions.",
    "Self-referential / meta-conceptual": "Excluded — Not self-reflective or modeling higher-order concepts.",
    "Temporal": "Excluded — May reference durations but not inherently temporal.",
    "Contextual abstraction": "Included — Only meaningful within legal, cultural, and organizational context.",

    "Socially / culturally constructed": "Included — Rooted in societal norms and employment law.",
    "Defined by a group/system": "Included — Shaped and enforced by employers, legal institutions, and labor bodies.",
    "Linked to identity or role": "Included — Defines an individual’s formal occupational role.",
    "Regulated / governed": "Included — Subject to labor law, policy, and enforcement mechanisms.",
    "Teachable / transmissible": "Included — Understood through professional norms, training, and education.",
    "Visible": "Included — Formally shared, archived, or disclosed.",
    "Context-sensitive": "Included — Its interpretation depends on institutional, legal, and cultural setting.",
    "Widely known": "Included — Employment contracts are universally recognized structures."
  },
  "encoding_notes": "This encoding models the employment contract as an abstract, symbolic, rule-based social artifact situated within legal and institutional frameworks. It defines roles and behaviors without being a physical or autonomous agent. The corrected code '0084A9FF' reflects its rule-governed, identity-defining, and socially embedded nature."
}

,
{
  "entity": "Gender Pronoun Usage",
  "uht_code": "0084C9FF",
  "image_url": "/validation_set/images/gender_pronoun_usage.png",
  "traits": {
    "physical": [],
    "functional": [
      "Purposeful / intentional",
      "Part of a larger system"
    ],
    "abstract": [
      "Symbolic / representational",
      "Communicative",
      "Behavior-guiding",
      "Contextual abstraction"
    ],
    "social": [
      "Socially / culturally constructed",
      "Defined by a group/system",
      "Linked to identity or role",
      "Regulated / governed",
      "Teachable / transmissible",
      "Visible",
      "Context-sensitive",
      "Widely known"
    ]
  },
  "feedback": {
    "Physical object": "Excluded — Pronoun usage is a linguistic practice, not a tangible entity.",
    "Man-made / synthetic": "Excluded — It is a cultural-linguistic convention, not a fabricated object.",
    "Biological or biologically-inspired": "Excluded — While referring to biological identity, the usage itself is not biological.",
    "Fixed/static": "Excluded — Pronoun conventions evolve across time and cultures.",
    "Structural": "Excluded — It does not serve a structural role in the physical or architectural sense.",
    "Perceptible": "Excluded — Pronouns are perceptible in speech or text, but the usage convention is abstract.",
    "Material form": "Excluded — Pronoun usage is not inherently material.",
    "Passive": "Excluded — It plays an active role in social signaling and communication.",

    "Purposeful / intentional": "Included — Pronouns are intentionally selected in communication to reflect identity or context.",
    "Emits output / produces effect": "Excluded — While communicative, the usage does not produce output in the mechanistic sense.",
    "Processes or regulates logic/signals": "Excluded — It does not compute or regulate signals.",
    "Transforms or modifies internal state": "Excluded — It can affect perceptions but not internal states directly.",
    "Interacts with humans directly": "Excluded — Pronouns are part of language, not interactive agents.",
    "Part of a larger system": "Included — Usage is embedded within grammatical, cultural, and institutional systems.",
    "Autonomous in function": "Excluded — Pronoun meaning and usage rely on social interpretation.",
    "System-critical": "Excluded — Language functions without any one pronoun.",

    "Symbolic / representational": "Included — Pronouns stand in symbolically for individuals.",
    "Communicative": "Included — They are a fundamental tool for interpersonal reference.",
    "Logical / rule-based": "Excluded — Though grammar-based, their core identity is symbolic and social.",
    "Hierarchical / modular": "Excluded — Pronouns do not form modular or hierarchical systems.",
    "Behavior-guiding": "Included — Their correct or incorrect use signals social alignment or offense.",
    "Self-referential / meta-conceptual": "Excluded — Usage does not inherently refer to itself.",
    "Temporal": "Excluded — Usage adapts over time but does not intrinsically reference time.",
    "Contextual abstraction": "Included — Pronoun meaning shifts based on speaker, subject, and sociocultural frame.",

    "Socially / culturally constructed": "Included — Pronoun norms are built and enforced by social communities.",
    "Defined by a group/system": "Included — Grammar systems, institutions, and communities define proper use.",
    "Linked to identity or role": "Included — Pronouns are directly tied to personal and gender identity.",
    "Regulated / governed": "Included — Institutions and style guides enforce pronoun usage rules.",
    "Teachable / transmissible": "Included — Taught through language education and socialization.",
    "Visible": "Included — Appears in written and spoken communication.",
    "Context-sensitive": "Included — Usage depends heavily on situation, culture, and audience.",
    "Widely known": "Included — Pronoun conventions are broadly understood and debated."
  },
  "encoding_notes": "This encoding treats gender pronoun usage as a symbolic, communicative, identity-signaling system deeply embedded in sociolinguistic conventions. It avoids conflating material traits with linguistic functions. The corrected code '0084C9FF' reflects its purposive, referential, and socially governed nature."
}

,
{
  "entity": "Military Salute",
  "uht_code": "0084C8FF",
  "image_url": "/validation_set/images/military_salute.png",
  "traits": {
    "physical": [],
    "functional": [
      "Purposeful / intentional",
      "Part of a larger system"
    ],
    "abstract": [
      "Symbolic / representational",
      "Communicative",
      "Behavior-guiding"
    ],
    "social": [
      "Socially / culturally constructed",
      "Defined by a group/system",
      "Linked to identity or role",
      "Regulated / governed",
      "Teachable / transmissible",
      "Visible",
      "Context-sensitive",
      "Widely known"
    ]
  },
  "feedback": {
    "Physical object": "Excluded — The salute is not a discrete material object but a performative gesture.",
    "Man-made / synthetic": "Excluded — The gesture itself is not a fabricated artifact, but an enacted social signal.",
    "Biological or biologically-inspired": "Excluded — Not rooted in biological structure or inspiration.",
    "Fixed/static": "Excluded — It is temporally enacted, not spatially fixed.",
    "Structural": "Excluded — It does not exhibit internal components or organization.",
    "Perceptible": "Excluded — While observable, its perceptibility does not define its ontological status.",
    "Material form": "Excluded — It has no persistent material embodiment.",
    "Passive": "Excluded — It requires intentional human performance.",

    "Purposeful / intentional": "Included — Deliberate act of social ritual with codified intention.",
    "Emits output / produces effect": "Excluded — Produces no autonomous effect; signaling depends on interpretation.",
    "Processes or regulates logic/signals": "Excluded — Not a computational or signal-processing entity.",
    "Transforms or modifies internal state": "Excluded — It does not inherently track or update state.",
    "Interacts with humans directly": "Excluded — Enacted by humans, but not interactive in the UHT sense.",
    "Part of a larger system": "Included — Exists only within hierarchical institutions that define it.",
    "Autonomous in function": "Excluded — Requires human initiation and performance.",
    "System-critical": "Excluded — Culturally meaningful, but not infrastructurally essential.",

    "Symbolic / representational": "Included — The gesture stands for abstract values like respect, allegiance, and discipline.",
    "Communicative": "Included — Conveys nonverbal information about status, protocol, or recognition.",
    "Logical / rule-based": "Excluded — Though enacted according to rules, it does not itself embody logical structures.",
    "Hierarchical / modular": "Excluded — The concept is not built from separable internal parts.",
    "Behavior-guiding": "Included — Prescribes specific actions and responses according to role.",
    "Self-referential / meta-conceptual": "Excluded — The concept does not reference or model itself.",
    "Temporal": "Excluded — Executed in time, but not defined by temporal structuring.",
    "Contextual abstraction": "Excluded — Its meaning is socially fixed and not flexibly abstracted across domains.",

    "Socially / culturally constructed": "Included — Embedded in long-standing traditions and military culture.",
    "Defined by a group/system": "Included — Officially codified by institutions such as national militaries.",
    "Linked to identity or role": "Included — Reflects status, allegiance, and role within an organizational hierarchy.",
    "Regulated / governed": "Included — Specific procedures and interpretations governed by manuals and doctrine.",
    "Teachable / transmissible": "Included — Explicitly trained and transmitted through formal instruction.",
    "Visible": "Included — Publicly enacted for mutual recognition.",
    "Context-sensitive": "Included — Its meaning and appropriateness depend on situation and role.",
    "Widely known": "Included — Recognized across many societies and institutional systems."
  },
  "encoding_notes": "Revised to include symbolic and communicative functions intrinsic to the ritualized gesture. Exclusions strictly follow the non-object, non-autonomous, non-logical nature of the act. Represents a signal embedded in hierarchy and ceremony."
}

,
{
  "entity": "National Anthem",
  "uht_code": "0080C9FF",
  "image_url": "/validation_set/images/national_anthem.png",
  "traits": {
    "physical": [],
    "functional": [
      "Purposeful / intentional"
    ],
    "abstract": [
      "Symbolic / representational",
      "Communicative",
      "Behavior-guiding",
      "Contextual abstraction"
    ],
    "social": [
      "Socially / culturally constructed",
      "Defined by a group/system",
      "Linked to identity or role",
      "Regulated / governed",
      "Teachable / transmissible",
      "Visible",
      "Context-sensitive",
      "Widely known"
    ]
  },
  "feedback": {
    "Physical object": "Excluded — The anthem is a symbolic or auditory construct, not a tangible object.",
    "Man-made / synthetic": "Excluded — The focus is on the national anthem as a formalized cultural abstraction, not any individual recording.",
    "Biological or biologically-inspired": "Excluded — Entirely cultural in origin.",
    "Fixed/static": "Excluded — Anthems may be modified over time or reinterpreted.",
    "Structural": "Excluded — No material or spatial structure.",
    "Perceptible": "Excluded — The abstract anthem exists beyond any specific performance or hearing.",
    "Material form": "Excluded — Not made of matter; it is a conceptual designation.",
    "Passive": "Excluded — It has no reactivity or mechanistic behavior.",
    "Purposeful / intentional": "Included — National anthems are created deliberately to symbolize and represent nations.",
    "Emits output / produces effect": "Excluded — Requires human performance; the anthem itself is inert.",
    "Processes or regulates logic/signals": "Excluded — No inherent signal or logic processing.",
    "Transforms or modifies internal state": "Excluded — It does not evolve or update its own state.",
    "Interacts with humans directly": "Excluded — Interaction occurs through mediated performance.",
    "Part of a larger system": "Excluded — Though related to national protocols, it is not a system component.",
    "Autonomous in function": "Excluded — It does not operate on its own.",
    "System-critical": "Excluded — A nation functions without it.",
    "Symbolic / representational": "Included — It is fundamentally symbolic, often tied to historical narratives.",
    "Communicative": "Included — Conveys identity, values, and emotion.",
    "Logical / rule-based": "Excluded — Not governed by logical structure.",
    "Hierarchical / modular": "Excluded — While songs may have sections, this is not semantically modular.",
    "Behavior-guiding": "Included — Associated with ceremonial behaviors like standing or saluting.",
    "Self-referential / meta-conceptual": "Excluded — It does not comment on its own structure.",
    "Temporal": "Excluded — Although performed in time, its semantic identity is not intrinsically time-based.",
    "Contextual abstraction": "Included — Its significance and usage vary with political context, events, or rituals.",
    "Socially / culturally constructed": "Included — Defined within specific cultural or national contexts.",
    "Defined by a group/system": "Included — Officially designated by governments or national institutions.",
    "Linked to identity or role": "Included — Strongly tied to national and collective identity.",
    "Regulated / governed": "Included — Usage and performance often governed by official protocol.",
    "Teachable / transmissible": "Included — Passed down via school systems, media, and tradition.",
    "Visible": "Included — Often printed, displayed, or performed in public.",
    "Context-sensitive": "Included — Performance and interpretation shift depending on occasion (e.g., protest vs. sports event).",
    "Widely known": "Included — Recognized and often memorized nationally and internationally."
  },
  "encoding_notes": "This encoding captures the National Anthem as a behavior-guiding, communicative, and symbolic cultural construct, embedded in formal and informal structures of identity and ceremony. The inclusion of both Contextual Abstraction and Context-sensitive is critical for capturing its shifting meanings and uses across diverse settings. It is not a physical or functional object, but rather a dense node of symbolic and social meaning."
}

,
{
  "entity": "Passport",
  "uht_code": "40DCF9FF",
  "image_url": "/validation_set/images/passport.png",
  "traits": {
    "physical": [
      "Man-made / synthetic"
    ],
    "functional": [
      "Purposeful / intentional",
      "Emits output / produces effect",
      "Transforms or modifies internal state",
      "Interacts with humans directly",
      "Part of a larger system"
    ],
    "abstract": [
      "Symbolic / representational",
      "Communicative",
      "Logical / rule-based",
      "Hierarchical / modular",
      "Behavior-guiding",
      "Contextual abstraction"
    ],
    "social": [
      "Socially / culturally constructed",
      "Defined by a group/system",
      "Linked to identity or role",
      "Regulated / governed",
      "Teachable / transmissible",
      "Visible",
      "Context-sensitive",
      "Widely known"
    ]
  },
  "feedback": {
    "Physical object": "Excluded — This encoding refers to the conceptual function of a passport, not the physical booklet.",
    "Man-made / synthetic": "Included — A passport is a human-designed socio-legal construct.",
    "Biological or biologically-inspired": "Excluded — There is no biological origin or inspiration.",
    "Fixed/static": "Excluded — Passport data (e.g., validity) can change; not fixed.",
    "Structural": "Excluded — Lacks a physical load-bearing or spatial structure.",
    "Perceptible": "Excluded — The concept is known via representation, not directly perceived.",
    "Material form": "Excluded — The formal definition is informational, not material.",
    "Passive": "Excluded — Not a valid descriptor for a conceptual/legal artifact.",
    
    "Purposeful / intentional": "Included — Created to fulfill the function of identity verification and legal authorization.",
    "Emits output / produces effect": "Included — Triggers authorization, travel rights, or alerts in systems.",
    "Processes or regulates logic/signals": "Excluded — Verification is done by external systems, not by the passport itself.",
    "Transforms or modifies internal state": "Included — Legal state (e.g., valid, expired, revoked) is intrinsic to its function.",
    "Interacts with humans directly": "Included — Designed to be presented, inspected, and processed by people.",
    "Part of a larger system": "Included — Embedded in global immigration, governance, and identity systems.",
    "Autonomous in function": "Excluded — Requires external agents or systems to act upon it.",
    "System-critical": "Excluded — Essential in contexts, but not universally mission-critical as a system component.",
    
    "Symbolic / representational": "Included — Encodes a person’s national and legal status via symbols.",
    "Communicative": "Included — Conveys structured identity data across borders and institutions.",
    "Logical / rule-based": "Included — Operates under formal rules for issuance, validity, format, and use.",
    "Hierarchical / modular": "Included — Structured into information zones (e.g., machine-readable zone, visas, biometrics).",
    "Behavior-guiding": "Included — Directs action: access granted or denied based on presence/absence of valid passport.",
    "Self-referential / meta-conceptual": "Excluded — It does not refer to or describe its own system or structure.",
    "Temporal": "Excluded — Though it has an expiration date, the concept itself is not time-referential.",
    "Contextual abstraction": "Included — The meaning of its fields and authority vary by country and legal context.",
    
    "Socially / culturally constructed": "Included — Its significance and legitimacy are entirely socially determined.",
    "Defined by a group/system": "Included — Defined and issued by nation-states and international governance bodies.",
    "Linked to identity or role": "Included — Fundamentally encodes citizenship and personal identity.",
    "Regulated / governed": "Included — Strictly controlled by institutional frameworks and international law.",
    "Teachable / transmissible": "Included — Understanding and use of passports is learned through formal and informal instruction.",
    "Visible": "Included — Intended to be presented and visually examined.",
    "Context-sensitive": "Included — A passport’s utility and validity depend on political, geographic, and diplomatic context.",
    "Widely known": "Included — Recognized globally as a standard form of legal identification."
  },
  "encoding_notes": "This encoding reflects the passport not as a physical document but as a formal identity artifact — a functional, abstract, and socially defined construct. It communicates identity, guides legal access, and exists only within structured human institutions. It is not an autonomous actor, nor does it directly regulate logic, but it remains essential to a complex legal-social infrastructure."
}

,
{
  "entity": "Protest March",
  "uht_code": "008009FF",
  "image_url": "/validation_set/images/protest_march.png",
  "traits": {
    "physical": [],
    "functional": [
      "Purposeful / intentional"
    ],
    "abstract": [
      "Behavior-guiding",
      "Contextual abstraction"
    ],
    "social": [
      "Socially / culturally constructed",
      "Defined by a group/system",
      "Linked to identity or role",
      "Regulated / governed",
      "Teachable / transmissible",
      "Visible",
      "Context-sensitive",
      "Widely known"
    ]
  },
  "feedback": {
    "Physical object": "Excluded — A protest march is an emergent event, not a bounded material object.",
    "Man-made / synthetic": "Excluded — While human-organized, it is not a fabricated artifact.",
    "Biological or biologically-inspired": "Excluded — Not rooted in biological form or processes.",
    "Fixed/static": "Excluded — Defined by its transience and mobility.",
    "Structural": "Excluded — No persistent material structure.",
    "Perceptible": "Excluded — While observable, perception is not intrinsic to its definition.",
    "Material form": "Excluded — It is not a material object.",
    "Passive": "Excluded — A protest march is inherently active by design.",

    "Purposeful / intentional": "Included — A protest is a deliberative, goal-driven act.",
    "Emits output / produces effect": "Excluded — Any output is emergent or symbolic, not functional.",
    "Processes or regulates logic/signals": "Excluded — Not a system that interprets or transforms input signals.",
    "Transforms or modifies internal state": "Excluded — Lacks defined internal states.",
    "Interacts with humans directly": "Excluded — Participation is human-driven; not interaction in the UHT sense.",
    "Part of a larger system": "Excluded — Not modular or system-integrated in a technical sense.",
    "Autonomous in function": "Excluded — Requires human organization and action.",
    "System-critical": "Excluded — Non-essential to systemic function.",

    "Symbolic / representational": "Excluded — Symbolism may be present, but not inherent.",
    "Communicative": "Excluded — Message is implicit, not structurally defined.",
    "Logical / rule-based": "Excluded — Not governed by formal logic.",
    "Hierarchical / modular": "Excluded — May have structure, but not intrinsic modularity.",
    "Behavior-guiding": "Included — Participants adopt ritualized forms (e.g. chanting, route-following).",
    "Self-referential / meta-conceptual": "Excluded — Does not intrinsically refer to itself.",
    "Temporal": "Excluded — Time-bound but not temporally structured.",
    "Contextual abstraction": "Included — Interpretation depends on political, cultural, and spatial context.",

    "Socially / culturally constructed": "Included — Exists within and because of social frameworks.",
    "Defined by a group/system": "Included — Emerges from group coordination and collective will.",
    "Linked to identity or role": "Included — Frequently expresses collective or individual identity.",
    "Regulated / governed": "Included — Often subject to permits, surveillance, or legal regulation.",
    "Teachable / transmissible": "Included — Practices and tactics passed through activist traditions.",
    "Visible": "Included — Public visibility is core to its impact.",
    "Context-sensitive": "Included — Meaning and reception depend on socio-political environment.",
    "Widely known": "Included — Globally recognizable form of civil resistance."
  },
  "encoding_notes": "This encoding defines a protest march as a symbolic, identity-expressive, and purpose-driven social ritual. While not a physical or technological system, it guides behavior through cultural context and visible collective action. The UHT traits selected capture its emergent, contextual, and communicative nature without projecting systemic or technical properties."
}

,
{
  "entity": "Religious Holiday",
  "uht_code": "00848AFF",
  "image_url": "/validation_set/images/religious_holiday.png",
  "traits": {
    "physical": [],
    "functional": [
      "Purposeful / intentional",
      "Part of a larger system"
    ],
    "abstract": [
      "Symbolic / representational",
      "Behavior-guiding",
      "Temporal"
    ],
    "social": [
      "Socially / culturally constructed",
      "Defined by a group/system",
      "Linked to identity or role",
      "Regulated / governed",
      "Teachable / transmissible",
      "Visible",
      "Context-sensitive",
      "Widely known"
    ]
  },
  "feedback": {
    "Physical object": "Excluded — A holiday is a temporal and cultural construct, not a physical object.",
    "Man-made / synthetic": "Excluded — While culturally constructed, it is not a manufactured or synthetic entity.",
    "Biological or biologically-inspired": "Excluded — It has no biological properties.",
    "Fixed/static": "Excluded — The date or form may vary across calendars or traditions.",
    "Structural": "Excluded — A holiday does not form a physical or functional structure.",
    "Perceptible": "Excluded — Though associated events may be perceivable, the holiday itself is not inherently sensory.",
    "Material form": "Excluded — It does not exist as a tangible substance.",
    "Passive": "Excluded — It actively drives behavior and societal coordination.",

    "Purposeful / intentional": "Included — Religious holidays are intentionally created to fulfill spiritual, commemorative, or ritual purposes.",
    "Emits output / produces effect": "Excluded — It does not produce a measurable or signal-based output.",
    "Processes or regulates logic/signals": "Excluded — It is not a processing system.",
    "Transforms or modifies internal state": "Excluded — While it may influence mood or behavior, this is not its structural identity.",
    "Interacts with humans directly": "Excluded — It is not an interface or agent.",
    "Part of a larger system": "Included — Religious holidays are intrinsic components of religious systems and calendars.",
    "Autonomous in function": "Excluded — It requires observance and social structures to exist.",
    "System-critical": "Excluded — The religion can exist without a specific holiday, though holidays reinforce system structure.",

    "Symbolic / representational": "Included — Religious holidays represent key doctrines, historical events, or beliefs (e.g., resurrection, liberation, revelation).",
    "Communicative": "Excluded — It is not itself a channel of communication.",
    "Logical / rule-based": "Excluded — It is observed via rules, but the concept itself is not inherently logical.",
    "Hierarchical / modular": "Excluded — It is not composed of modular sub-parts in a structural way.",
    "Behavior-guiding": "Included — Holidays guide ritual behavior, abstention, celebration, or acts of devotion.",
    "Self-referential / meta-conceptual": "Excluded — It does not reference its own concept or model abstraction.",
    "Temporal": "Included — A holiday is, by definition, a temporally anchored occasion.",
    "Contextual abstraction": "Excluded — It is tightly bound to its contextual tradition.",

    "Socially / culturally constructed": "Included — Holidays are created and maintained by cultural and religious traditions.",
    "Defined by a group/system": "Included — A religious body or tradition defines the holiday.",
    "Linked to identity or role": "Included — Observance often expresses group identity and affiliation.",
    "Regulated / governed": "Included — Rituals, calendars, and authorities govern the holiday.",
    "Teachable / transmissible": "Included — It is passed down through generations and formal education.",
    "Visible": "Included — Celebrations are observable in public or ritual spaces.",
    "Context-sensitive": "Included — Its meaning depends entirely on cultural and religious context.",
    "Widely known": "Included — Major religious holidays are broadly recognized within or across cultures."
  },
  "encoding_notes": "This revision addresses prior conceptual underrepresentation by incorporating traits that are essential to the identity of a religious holiday. It now reflects its symbolic nature, temporality, and its embeddedness within larger religious systems. The corrected code '00848AFF' now faithfully matches the selected traits."
}

,
{
  "entity": "Tenure System",
  "uht_code": "00848DFF",
  "image_url": "/validation_set/images/tenure_system.png",
  "traits": {
    "physical": [],
    "functional": [
      "Purposeful / intentional",
      "Part of a larger system"
    ],
    "abstract": [
      "Symbolic / representational",
      "Behavior-guiding",
      "Self-referential / meta-conceptual",
      "Contextual abstraction"
    ],
    "social": [
      "Socially / culturally constructed",
      "Defined by a group/system",
      "Linked to identity or role",
      "Regulated / governed",
      "Teachable / transmissible",
      "Visible",
      "Context-sensitive",
      "Widely known"
    ]
  },
  "feedback": {
    "Physical object": "Excluded — The tenure system is a policy structure, not a tangible object.",
    "Man-made / synthetic": "Excluded — It is institutional, not materially fabricated.",
    "Biological or biologically-inspired": "Excluded — It is not derived from biological models.",
    "Fixed/static": "Excluded — Policies can evolve; tenure standards shift over time.",
    "Structural": "Excluded — It is not a material or physical structure.",
    "Perceptible": "Excluded — Its effects are visible, but the system itself is conceptual.",
    "Material form": "Excluded — It has no material embodiment.",
    "Passive": "Excluded — It functions through rules and decisions, not passive presence.",

    "Purposeful / intentional": "Included — Designed to ensure academic freedom and employment stability.",
    "Emits output / produces effect": "Excluded — It influences outcomes indirectly via roles and protections.",
    "Processes or regulates logic/signals": "Excluded — It is not a signal system.",
    "Transforms or modifies internal state": "Excluded — It does not autonomously transform.",
    "Interacts with humans directly": "Excluded — It is not an interface or agent.",
    "Part of a larger system": "Included — Embedded within academic governance and institutional policy frameworks.",
    "Autonomous in function": "Excluded — Relies on governance and enforcement to operate.",
    "System-critical": "Excluded — Important but not universally essential to the operation of an institution.",

    "Symbolic / representational": "Included — Tenure symbolizes institutional trust and professional status.",
    "Communicative": "Excluded — It is not inherently communicative, though it conveys status indirectly.",
    "Logical / rule-based": "Excluded — While implemented via rules, this trait reflects internal logic processing.",
    "Hierarchical / modular": "Excluded — It is not internally modularized as a concept.",
    "Behavior-guiding": "Included — Strongly shapes academic behaviors and career choices.",
    "Self-referential / meta-conceptual": "Included — The system reflects upon its own governance mechanisms.",
    "Temporal": "Excluded — Though time-bound in process (e.g., probationary periods), it is not intrinsically temporal.",
    "Contextual abstraction": "Included — The system only exists within institutional and sociocultural context.",

    "Socially / culturally constructed": "Included — Defined and maintained through academic culture.",
    "Defined by a group/system": "Included — Institutions formally define its rules.",
    "Linked to identity or role": "Included — It grants the role/status of 'tenured faculty'.",
    "Regulated / governed": "Included — Governed by policy documents, bylaws, and committees.",
    "Teachable / transmissible": "Included — Explained and handed down through policy, mentorship, and onboarding.",
    "Visible": "Included — Publicly recognized through announcements and directories.",
    "Context-sensitive": "Included — Varies dramatically by institution, discipline, and country.",
    "Widely known": "Included — Recognized across the academic world and often beyond."
  },
  "encoding_notes": "The tenure system is modeled as a deeply social and abstract construct with strong behavioral and identity-signaling functions. Though not a communicative or logical processor itself, it operates symbolically, structurally, and within complex institutional systems. The corrected code '00848DFF' now faithfully reflects the selected traits."
}

,
{
  "entity": "Twitter Handle",
  "uht_code": "00C4C1FF",
  "image_url": "/validation_set/images/twitter_handle.png", 
  "traits": {
    "physical": [],
    "functional": [
      "Purposeful / intentional",
      "Emits output / produces effect",
      "Part of a larger system"
    ],
    "abstract": [
      "Symbolic / representational",
      "Communicative",
      "Contextual abstraction"
    ],
    "social": [
      "Socially / culturally constructed",
      "Defined by a group/system",
      "Linked to identity or role",
      "Regulated / governed",
      "Teachable / transmissible",
      "Visible",
      "Context-sensitive",
      "Widely known"
    ]
  },
  "feedback": {
    "Physical object": "Excluded — A Twitter handle is not a tangible entity.",
    "Man-made / synthetic": "Excluded — It is a digital construct but not a synthetic object in material terms.",
    "Biological or biologically-inspired": "Excluded — It has no biological basis.",
    "Fixed/static": "Excluded — Handles can be changed by the user or system.",
    "Structural": "Excluded — It does not constitute part of a physical or architectural structure.",
    "Perceptible": "Excluded — The handle's representation (text) is perceivable, but the handle itself as an entity is abstract.",
    "Material form": "Excluded — It does not exist in material form.",
    "Passive": "Excluded — It functions as a pointer and can generate activity through tagging, mentions, etc.",

    "Purposeful / intentional": "Included — Twitter handles are created intentionally to represent users or entities online.",
    "Emits output / produces effect": "Included — Handles are used to direct mentions, trigger notifications, and represent accounts.",
    "Processes or regulates logic/signals": "Excluded — It does not perform computation or signal processing.",
    "Transforms or modifies internal state": "Excluded — It is not dynamic on its own.",
    "Interacts with humans directly": "Excluded — It is a reference to an account, not an interface.",
    "Part of a larger system": "Included — Twitter handles are integral to the platform's identity and tagging system.",
    "Autonomous in function": "Excluded — It requires a platform and user context to operate.",
    "System-critical": "Excluded — The platform can technically exist without any one specific handle.",

    "Symbolic / representational": "Included — It symbolically represents a user or entity.",
    "Communicative": "Included — It functions as a communicative handle through mentions and tags.",
    "Logical / rule-based": "Excluded — Its use is governed by conventions, but it is not a logic structure.",
    "Hierarchical / modular": "Excluded — It does not contain internal hierarchy.",
    "Behavior-guiding": "Excluded — It does not direct behavior intrinsically.",
    "Self-referential / meta-conceptual": "Excluded — It does not encode or reflect upon itself.",
    "Temporal": "Excluded — It does not inherently represent time.",
    "Contextual abstraction": "Included — It is an abstract pointer whose meaning depends entirely on social and platform context.",

    "Socially / culturally constructed": "Included — The concept and structure of handles are culturally constructed.",
    "Defined by a group/system": "Included — Twitter defines the naming conventions and usage.",
    "Linked to identity or role": "Included — It serves as an online identifier.",
    "Regulated / governed": "Included — Usage is governed by Twitter’s rules and policies.",
    "Teachable / transmissible": "Included — People are taught how to use and refer to handles.",
    "Visible": "Included — Handles are prominently displayed and searchable.",
    "Context-sensitive": "Included — Their meaning depends on who uses them, in what setting.",
    "Widely known": "Included — The convention of handles is well known in digital communication."
  },
  "encoding_notes": "The Twitter handle is modeled here as a symbolic, communicative, socially-defined pointer within a digital system. It lacks physical and autonomous properties but is deeply embedded in platform logic and online identity structures. The corrected code '00C4C1FF' faithfully reflects the selected traits."
}

,
{
  "entity": "University Degree",
  "uht_code": "0080C0E9",
  "image_url": "/validation_set/images/university_degree.png",
  "traits": {
    "physical": [],
    "functional": [
      "Purposeful / intentional"
    ],
    "abstract": [
      "Symbolic / representational",
      "Communicative"
    ],
    "social": [
      "Socially / culturally constructed",
      "Defined by a group/system",
      "Linked to identity or role",
      "Teachable / transmissible",
      "Widely known"
    ]
  },
  "feedback": {
    "Physical object": "Excluded — The encoding targets the credential as institutional recognition, not the physical diploma.",
    "Man-made / synthetic": "Excluded — It is not a fabricated or constructed object, but a symbolic role assignment.",
    "Biological or biologically-inspired": "Excluded — No biological basis.",
    "Fixed/static": "Excluded — A degree does not have physical fixity; its recognition persists independently of a medium.",
    "Structural": "Excluded — Not a structural system or form.",
    "Perceptible": "Excluded — The credential is abstract; perceptibility depends on instantiation (e.g., paper diploma).",
    "Material form": "Excluded — The concept itself is immaterial.",
    "Passive": "Excluded — Not meaningfully applicable to abstract status.",
    
    "Purposeful / intentional": "Included — It is granted deliberately to signify achievement and status.",
    "Emits output / produces effect": "Excluded — It does not generate or emit anything directly.",
    "Processes or regulates logic/signals": "Excluded — It does not involve transformation or control.",
    "Transforms or modifies internal state": "Excluded — It alters social standing, but not its own internal state.",
    "Interacts with humans directly": "Excluded — The recognition is socially interpreted, not interactive.",
    "Part of a larger system": "Excluded — While institutionally related, it is not a structural subsystem.",
    "Autonomous in function": "Excluded — It has no autonomous properties.",
    "System-critical": "Excluded — Not necessary for any system’s function.",
    
    "Symbolic / representational": "Included — It signifies completion of educational criteria.",
    "Communicative": "Included — Encodes information about field, level, and issuing institution.",
    "Logical / rule-based": "Excluded — Degrees result from a process governed by rules, but the degree itself is not a rule system.",
    "Hierarchical / modular": "Excluded — Does not consist of nested symbolic units.",
    "Behavior-guiding": "Excluded — It enables opportunity but does not dictate behavior.",
    "Self-referential / meta-conceptual": "Excluded — Not reflective of its own structure.",
    "Temporal": "Excluded — While time-dependent in issuance, the degree itself is not temporal.",
    "Contextual abstraction": "Excluded — Its interpretation is relatively stable and codified across contexts.",
    
    "Socially / culturally constructed": "Included — The degree is a cultural invention.",
    "Defined by a group/system": "Included — Institutions determine what it means and how it is granted.",
    "Linked to identity or role": "Included — Strongly tied to personal and professional identity.",
    "Regulated / governed": "Excluded — Institutions define and issue degrees, but there is no single governing body or legal framework enforcing meaning.",
    "Teachable / transmissible": "Included — Though it is a status, it results from formal instruction and is widely transmitted.",
    "Visible": "Excluded — The recognition is abstract; visibility applies only to physical instances (certificates, transcripts).",
    "Context-sensitive": "Excluded — Interpretation is relatively consistent across cultural and professional domains.",
    "Widely known": "Included — Universally recognized across academic and professional contexts."
  },
  "encoding_notes": "This encoding captures the degree as a symbolic, communicative social artifact, defined and transmitted by institutions but not intrinsically structured or perceptible. It has no active function but conveys highly consequential social identity."
}

,
{
  "entity": "Wedding Vow",
  "uht_code": "0080C8FF",
  "image_url": "/validation_set/images/wedding_vow.png",
  "traits": {
    "physical": [],
    "functional": [
      "Purposeful / intentional"
    ],
    "abstract": [
      "Symbolic / representational",
      "Communicative",
      "Behavior-guiding"
    ],
    "social": [
      "Socially / culturally constructed",
      "Defined by a group/system",
      "Linked to identity or role",
      "Regulated / governed",
      "Teachable / transmissible",
      "Visible",
      "Context-sensitive",
      "Widely known"
    ]
  },
  "feedback": {
    "Physical object": "Excluded — A wedding vow is not a tangible, physical entity.",
    "Man-made / synthetic": "Excluded — While culturally created, it lacks material or constructed form in itself.",
    "Biological or biologically-inspired": "Excluded — It has no biological characteristics.",
    "Fixed/static": "Excluded — A vow can be rephrased, modified, and varies between individuals.",
    "Structural": "Excluded — It does not serve as a physical or architectural structure.",
    "Perceptible": "Excluded — The spoken or written expression may be perceptible, but the vow itself as an abstract entity is not inherently so.",
    "Material form": "Excluded — It has no intrinsic material form.",
    "Passive": "Excluded — It actively expresses intent or commitment when performed.",

    "Purposeful / intentional": "Included — A vow is a deliberate commitment or promise.",
    "Emits output / produces effect": "Excluded — It does not generate a measurable output on its own.",
    "Processes or regulates logic/signals": "Excluded — It is not a processing entity.",
    "Transforms or modifies internal state": "Excluded — It does not autonomously cause internal transformation.",
    "Interacts with humans directly": "Excluded — It is a concept, not an agent or interface.",
    "Part of a larger system": "Excluded — While used within ceremonies, the vow itself is standalone as a semantic entity. [Consider revisiting]",
    "Autonomous in function": "Excluded — It requires a human agent to exist and be expressed.",
    "System-critical": "Excluded — Not structurally necessary for systems outside ritual/cultural framing.",

    "Symbolic / representational": "Included — A vow represents a personal and cultural promise.",
    "Communicative": "Included — It functions explicitly as speech or writing to convey intent.",
    "Logical / rule-based": "Excluded — Vows are often emotional, poetic, or idiosyncratic rather than rule-based.",
    "Hierarchical / modular": "Excluded — A vow is typically a single unit of meaning, not composed of subsystems.",
    "Behavior-guiding": "Included — It expresses and shapes future behavior or commitment.",
    "Self-referential / meta-conceptual": "Excluded — It does not refer to itself or model conceptual structures.",
    "Temporal": "Excluded — While performed in time, it is not intrinsically temporal in meaning.",
    "Contextual abstraction": "Excluded — Its abstract meaning is tightly coupled to social context, but not abstracted from it.",

    "Socially / culturally constructed": "Included — Vows arise from cultural traditions and social contracts.",
    "Defined by a group/system": "Included — Religious, legal, or cultural institutions define their typical structure.",
    "Linked to identity or role": "Included — Vows often signify relational roles such as 'spouse'.",
    "Regulated / governed": "Included — Ceremonial or legal standards often constrain the vow’s form.",
    "Teachable / transmissible": "Included — Vows are taught, modeled, and passed on in rituals.",
    "Visible": "Included — Often performed in public; expressed through language and gesture.",
    "Context-sensitive": "Included — A vow has meaning only within specific ceremonial or relational contexts.",
    "Widely known": "Included — The concept of a wedding vow is broadly recognized across cultures."
  },
  "encoding_notes": "This encoding treats the 'Wedding Vow' as a social-abstract construct: an intentional, symbolic commitment shaped and maintained by cultural systems. No physical traits are included, and only those functional traits intrinsic to its communicative and purposive nature are selected. The encoding avoids trait inflation by not attributing structural, temporal, or autonomous properties unless they are integral to the vow's semantic identity. The exclusion of 'Part of a larger system' is debatable and flagged for possible revision in future harmonization passes."
}

]