[
  {
    "id": 1,
    "name": "Rock",
    "hex": "9F000011",
    "baseline": true,
    "traits": [
      "Physical object",
      "Fixed/static",
      "Structural",
      "Perceptible",
      "Material form",
      "Passive",
      "Visible",
      "Widely known"
    ],
    "feedback": {
      "Physical object": "A rock exists physically and can be directly touched and observed.",
      "Man-made / synthetic": "Rocks are natural formations, not manufactured by humans.",
      "Biological or biologically-inspired": "Rocks are not living and do not exhibit biological characteristics.",
      "Fixed/static": "Rocks do not change position or form by themselves under normal conditions.",
      "Structural": "Rocks contribute to the structure of landscapes or built forms as foundational or supporting elements.",
      "Perceptible": "They are accessible to human senses — touch, sight, and sometimes sound (when struck).",
      "Material form": "Rocks are solid matter composed of minerals, not abstract or virtual.",
      "Passive": "They do not produce any effect or output intentionally.",
      "Purposeful / intentional": "Rocks have no intended function or goal — they are not designed or purposeful.",
      "Emits output / produces effect": "They do not inherently emit energy or effects, though they may passively affect surroundings (e.g., blocking wind).",
      "Processes or regulates logic/signals": "They do not participate in any logical, computational, or signaling activity.",
      "Transforms or modifies internal state": "They are generally inert and do not change form without external force.",
      "Interacts with humans directly": "Interaction is incidental — humans can use or touch rocks, but the rock itself does not engage.",
      "Part of a larger system": "Can be part of geological systems, but this encoding omits it unless foregrounded.",
      "Autonomous in function": "They have no function, autonomy, or internal behavior.",
      "System-critical": "No single rock is typically critical to a system’s operation or survival.",
      "Symbolic / representational": "Rocks may be symbolic in specific contexts (e.g., gravestones), but not generically.",
      "Communicative": "They do not convey messages or symbolic content inherently.",
      "Logical / rule-based": "They do not operate via logic or structure beyond physical properties.",
      "Hierarchical / modular": "They are undifferentiated masses, not composed of functional modules or parts.",
      "Behavior-guiding": "They do not instruct or guide behavior unless symbolically framed.",
      "Self-referential / meta-conceptual": "They have no conceptual or reflective quality.",
      "Temporal": "Though they exist through time, they do not track, express, or change with temporal structure.",
      "Contextual abstraction": "A rock is what it is — it does not change identity based on social or conceptual framing.",
      "Socially / culturally constructed": "Their existence does not rely on cultural consensus.",
      "Defined by a group/system": "They are not labeled or regulated by institutional systems inherently.",
      "Linked to identity or role": "They do not signify role or identity unless used in symbolic design.",
      "Regulated / governed": "Rocks are not subjects of governance or institutional control.",
      "Teachable / transmissible": "They are objects of study, but not themselves didactic.",
      "Visible": "They are typically observed visually — often noted for color, shape, and size.",
      "Context-sensitive": "They do not vary semantically across cultural or social settings in this encoding.",
      "Widely known": "Rocks are universally known and referenced in all cultures as basic natural objects."
    },
    "image": "assets/rock.png",
    "description": "A natural, solid aggregate of minerals — stable, perceptible, passive, and widely recognized across cultures."
  }
  ,
  {
    "id": 2,
    "name": "Bridge",
    "hex": "DF9B10DF",
    "baseline": true,
    "traits": [
      "Physical object",
      "Man-made / synthetic",
      "Fixed/static",
      "Structural",
      "Perceptible",
      "Material form",
      "Passive",
      "Purposeful / intentional",
      "Interacts with humans directly",
      "Part of a larger system",
      "System-critical",
      "Hierarchical / modular",
      "Socially / culturally constructed",
      "Defined by a group/system",
      "Regulated / governed",
      "Teachable / transmissible",
      "Visible",
      "Context-sensitive",
      "Widely known"
    ],
    "feedback": {
      "Physical object": "A bridge is a tangible structure occupying space and constructed from physical materials.",
      "Man-made / synthetic": "Bridges are engineered and built by humans using intentional design and artificial materials.",
      "Biological or biologically-inspired": "Although it may mimic natural forms, the bridge itself is not biological or derived from biological systems.",
      "Fixed/static": "A bridge is stationary and anchored to its environment, with no moving parts as part of its core identity.",
      "Structural": "It functions as a load-bearing structure designed to span space and connect locations.",
      "Perceptible": "It is visually and physically perceivable — one can walk on, touch, and observe it.",
      "Material form": "Made of materials such as concrete, steel, wood — it has a persistent and manipulable physical form.",
      "Passive": "It does not produce effects on its own — it enables other actions (e.g., crossing) but does not act autonomously.",
      "Purposeful / intentional": "It serves a clear human-defined function: enabling traversal over obstacles like rivers or roads.",
      "Emits output / produces effect": "Omitted — the bridge does not output energy, signal, or action directly.",
      "Processes or regulates logic/signals": "It contains no computational logic or signal processing inherent to its structure.",
      "Transforms or modifies internal state": "Its structure is stable and not dynamically altered in use — no transformative behavior.",
      "Interacts with humans directly": "Humans traverse and engage with it physically — walking, driving, building upon it.",
      "Part of a larger system": "It connects with roads, transit systems, or architectural networks — embedded within infrastructure.",
      "Autonomous in function": "It does not operate independently — it is static and non-autonomous.",
      "System-critical": "In many cases, it is essential infrastructure; failure could cause major disruption or danger.",
      "Symbolic / representational": "Omitted here — though metaphorically symbolic in some contexts, not inherently so in a baseline bridge.",
      "Communicative": "It does not intentionally transmit information or messages.",
      "Logical / rule-based": "While engineered with rules, it does not encode or process logic in operation.",
      "Hierarchical / modular": "Bridges often contain modular substructures (e.g., beams, trusses, spans), forming a functional hierarchy.",
      "Behavior-guiding": "Not inherently instructional — it guides motion physically but not symbolically or intentionally.",
      "Self-referential / meta-conceptual": "It does not reference itself or serve as a meta-concept.",
      "Temporal": "While it exists over time, it does not express or manage temporality as part of its identity.",
      "Contextual abstraction": "Its function is mostly consistent across contexts; minor variation exists but not enough to encode this trait.",
      "Socially / culturally constructed": "Its role and significance are defined by human society — bridges represent shared norms of transit and infrastructure.",
      "Defined by a group/system": "Governed and categorized by city, national, or engineering standards and institutions.",
      "Linked to identity or role": "Not encoded here — it doesn't signify role or personal/social identity in its baseline form.",
      "Regulated / governed": "Subject to inspection, maintenance, zoning, and engineering laws and codes.",
      "Teachable / transmissible": "Bridges are studied in architecture and civil engineering — their form and function are transmissible knowledge.",
      "Visible": "Bridges are visually prominent architectural features and navigational landmarks.",
      "Context-sensitive": "Their design and significance often vary by geography, climate, and urban context.",
      "Widely known": "Bridges are universally recognized structures with clear function across nearly all cultures and regions."
    },
    "image": "assets/bridge.png",
    "description": "A human-engineered structure that spans physical space to support passage, regulated and integrated into broader infrastructure — functional, structural, visible, and socially embedded."
  }
  ,
  {
    "id": 3,
    "name": "Oak Tree",
    "hex": "BF540000",
    "baseline": true,
    "traits": [
      "Physical object",
      "Biological or biologically-inspired",
      "Fixed/static",
      "Structural",
      "Perceptible",
      "Material form",
      "Passive",
      "Emits output / produces effect",
      "Transforms or modifies internal state",
      "Part of a larger system"
    ],
    "feedback": {
      "Physical object": "An oak tree occupies space and has a tangible, measurable physical presence — it is not conceptual or virtual.",
      "Man-made / synthetic": "It is a natural organism, not designed, fabricated, or constructed by humans.",
      "Biological or biologically-inspired": "It is a naturally occurring organism, governed by biological processes like growth, respiration, and reproduction.",
      "Fixed/static": "Though it changes over time, it is rooted in one place and does not locomote or change spatial position.",
      "Structural": "Its form supports weight, organizes internal components (e.g., trunk, branches), and serves as a scaffold for other entities (e.g., nests, vines).",
      "Perceptible": "It can be seen, touched, smelled, and heard (e.g., rustling), making it directly accessible to the senses.",
      "Material form": "Composed of organic matter — wood, bark, leaves — its identity is inseparable from its physical substance.",
      "Passive": "It does not act with intent; its behaviors arise from internal biology and environmental response without agency.",
      "Purposeful / intentional": "It does not have agency, goals, or designed intent — it acts only as biology dictates.",
      "Emits output / produces effect": "It affects its surroundings through byproducts and interactions — e.g., releasing oxygen, shedding leaves, casting shade.",
      "Processes or regulates logic/signals": "It does not handle logic, information, or signal processing — no circuitry or symbolic control.",
      "Transforms or modifies internal state": "It changes as it grows, responds to seasons, stores nutrients, and heals after damage.",
      "Interacts with humans directly": "It does not actively engage or interface with humans — any interaction is incidental or passive.",
      "Part of a larger system": "It is embedded within ecological networks — interacting with soil, water, fungi, insects, and climate in mutual dependence.",
      "Autonomous in function": "Although self-regulating biologically, it does not meet the threshold for functional autonomy (no goal-seeking behavior or system independence).",
      "System-critical": "Most oak trees are not keystone entities whose absence would collapse a system — they are contributive but not singularly essential.",
      "Symbolic / representational": "In this generic instance, 'Oak Tree' has no embedded symbolic role — symbolic meaning would require cultural framing or narrative context.",
      "Communicative": "It does not encode or transmit intentional signals or messages.",
      "Logical / rule-based": "It does not embody or operate on formal rules or systems of logic.",
      "Hierarchical / modular": "While it has parts, it is not a modular or explicitly hierarchical system in a designed or conceptual sense.",
      "Behavior-guiding": "It does not influence behavior via intention, symbolism, or instruction.",
      "Self-referential / meta-conceptual": "It does not represent itself, reflect on its nature, or express meta-level ideas.",
      "Temporal": "Excluded in this encoding due to lack of semantic emphasis in the name or framing; while trees change over time, this version omits it absent explicit focus on seasonality or lifecycle.",
      "Contextual abstraction": "Its meaning does not shift across contexts or require interpretive abstraction — it is a concrete biological entity.",
      "Socially / culturally constructed": "Its identity as an oak tree is based in biology, not social agreement or cultural fabrication.",
      "Defined by a group/system": "It is not defined or regulated by a group, institution, or classification system (beyond biological taxonomy, which is not identity-defining here).",
      "Linked to identity or role": "It does not signify a social role, profession, or identity-bearing function.",
      "Regulated / governed": "It is not subject to institutional rules or governance.",
      "Teachable / transmissible": "The object itself is not knowledge-bearing or educational in form — it can be studied, but it does not teach.",
      "Visible": "Subsumed under 'Perceptible' and excluded here for compression — perceptibility already covers visual salience.",
      "Context-sensitive": "Excluded under the minimalist rule — while oaks respond to environment, this version does not emphasize context-specific traits or dependencies.",
      "Widely known": "The label 'Oak Tree' does not indicate symbolic fame, widespread cultural meaning, or iconic recognition — so this is omitted in the absence of framing to support it."
    },
    "image": "assets/oak_tree.png",
    "description": "A rooted biological organism defined by passive structure, natural growth, and ecosystem participation — perceptible, material, and physically embedded without abstract or symbolic identity."
  },
  {
    "id": 4,
    "name": "Candle",
    "hex": "F6540007",
    "baseline": true,
    "traits": [
      "Physical object",
      "Man-made / synthetic",
      "Fixed/static",
      "Perceptible",
      "Material form",
      "Purposeful / intentional",
      "Emits output / produces effect",
      "Transforms or modifies internal state"
    ],
    "feedback": {
      "Physical object": "A candle has tangible form and mass and can be perceived through touch and sight.",
      "Man-made / synthetic": "Candles are created intentionally by humans, often from processed wax and wicks.",
      "Biological or biologically-inspired": "It is not a biological entity nor inspired by living systems.",
      "Fixed/static": "The base structure of a candle remains stationary during use, even as it burns down.",
      "Structural": "It does not provide structural support or serve as a load-bearing component.",
      "Perceptible": "It is experienced via multiple senses — light, smell, warmth, and sight.",
      "Material form": "Constructed of wax and wick, it has a consistent material identity.",
      "Passive": "It acts only when lit, producing light actively — so 'Passive' is excluded.",
      "Purposeful / intentional": "It is designed to produce light and atmosphere, often with ritual or practical intent.",
      "Emits output / produces effect": "Once lit, it emits light, heat, and sometimes scent — clear physical outputs.",
      "Processes or regulates logic/signals": "It performs no signal processing or logical operations.",
      "Transforms or modifies internal state": "As it burns, its form (wax) is consumed — a clear transformation over time.",
      "Interacts with humans directly": "Omitted — it is used by humans but does not respond or adapt.",
      "Part of a larger system": "Not required by identity, even if it may participate in rituals or grouped use.",
      "Autonomous in function": "It sustains combustion after ignition, but lacks control or active behavior.",
      "System-critical": "A candle is not essential to the functioning of any system.",
      "Symbolic / representational": "Symbolic uses are common but not inherent — omitted under baseline encoding.",
      "Communicative": "Does not encode or transmit messages intentionally.",
      "Logical / rule-based": "Obeys physics but does not express or follow logical rules.",
      "Hierarchical / modular": "It is a single object, not a system of subsystems.",
      "Behavior-guiding": "Does not direct behavior unless interpreted symbolically.",
      "Self-referential / meta-conceptual": "It is not reflective or recursive in meaning.",
      "Temporal": "Its change over time is visible, but this is not encoded without explicit temporal framing.",
      "Contextual abstraction": "Its identity remains consistent regardless of use case.",
      "Socially / culturally constructed": "Cultural meaning exists but is excluded here for compression.",
      "Defined by a group/system": "Not institutionally defined in its identity.",
      "Linked to identity or role": "It is not role-defining or identity-linked.",
      "Regulated / governed": "May be governed in use (e.g. fire safety), but not as part of intrinsic identity.",
      "Teachable / transmissible": "Its use is taught, but it does not carry information or teach inherently.",
      "Visible": "Omitted to avoid redundancy — included under 'Perceptible'.",
      "Context-sensitive": "Meaning may shift, but this is excluded in baseline encoding.",
      "Widely known": "Commonplace, but not sufficient for trait inclusion under strict encoding."
    },
    "image": "assets/candle.png",
    "description": "A human-made object that emits light and heat when ignited — functional, perceptible, and materially simple, without symbolic or social encoding in its baseline form."
  }
  ,
  {
    "id": 5,
    "name": "Clock",
    "hex": "F654880F",
    "baseline": true,
    "traits": [
      "Physical object",
      "Man-made / synthetic",
      "Fixed/static",
      "Perceptible",
      "Material form",
      "Purposeful / intentional",
      "Emits output / produces effect",
      "Processes or regulates logic/signals",
      "Transforms or modifies internal state",
      "Interacts with humans directly",
      "Symbolic / representational",
      "Temporal"
    ],
    "feedback": {
      "Physical object": "A clock is a physical, tangible device that exists in material space and can be observed or manipulated.",
      "Man-made / synthetic": "Clocks are designed, built, and maintained by humans using artificial materials and systems.",
      "Biological or biologically-inspired": "A clock is not a biological system nor modeled on one.",
      "Fixed/static": "While its internal components move, the device itself remains in a fixed position during typical use.",
      "Structural": "It is not used as a support structure and does not serve an architectural load-bearing purpose.",
      "Perceptible": "It is directly observable through sight and sound — e.g., ticking hands or digital displays.",
      "Material form": "It is built from solid materials such as metal, plastic, and glass — it is not conceptual.",
      "Passive": "Not passive — it actively emits time-based output and transforms over time.",
      "Purposeful / intentional": "Clocks are built with the specific function of tracking and signaling time.",
      "Emits output / produces effect": "They produce regular outputs: visual time displays, ticking, alarms, or light pulses.",
      "Processes or regulates logic/signals": "Internally, they regulate and measure signals — mechanical or electronic — to keep time accurately.",
      "Transforms or modifies internal state": "Their displays change continuously as time progresses.",
      "Interacts with humans directly": "Users set, read, or respond to the clock’s output frequently.",
      "Part of a larger system": "Clocks may be networked, but this is not necessary to their baseline identity.",
      "Autonomous in function": "They function continuously once started, but do not adapt or respond to their environment.",
      "System-critical": "Most clocks are not individually system-critical in a baseline sense.",
      "Symbolic / representational": "Clocks symbolize the passage of time — a concept — and represent it continuously and abstractly.",
      "Communicative": "They convey information but not via dialogue or syntax — excluded in compression.",
      "Logical / rule-based": "They follow mechanical or electronic logic internally, but are not used to express conceptual rules externally.",
      "Hierarchical / modular": "Some are modular internally, but modularity is not essential to their core identity.",
      "Behavior-guiding": "They influence behavior through time awareness, but not in a directive or instructional way.",
      "Self-referential / meta-conceptual": "Most clocks do not reference themselves or represent abstract models.",
      "Temporal": "Time is the very dimension a clock expresses — this trait is fundamental to its purpose and representation.",
      "Contextual abstraction": "Clocks vary little in identity across settings — timekeeping remains the same.",
      "Socially / culturally constructed": "Time systems are socially constructed, but the clock mechanism functions independently of culture.",
      "Defined by a group/system": "While time zones are defined by groups, the clock itself is not.",
      "Linked to identity or role": "Clocks do not signify social identity or roles.",
      "Regulated / governed": "Timekeeping may be standardized, but not all clocks are regulated instruments.",
      "Teachable / transmissible": "Reading a clock is taught, but the object does not teach itself.",
      "Visible": "Covered under 'Perceptible' — not separately encoded.",
      "Context-sensitive": "Clock function remains stable across usage contexts.",
      "Widely known": "Familiarity is not included under strict baseline unless iconic."
    },
    "image": "assets/clock.png",
    "description": "A human-crafted instrument that symbolizes and measures time through regulated, perceptible outputs — both functional and temporal in its core identity."
  }
  ,
  {
    "id": 6,
    "name": "Book",
    "hex": "F654000F",
    "baseline": true,
    "traits": [
      "Physical object",
      "Man-made / synthetic",
      "Fixed/static",
      "Perceptible",
      "Material form",
      "Purposeful / intentional",
      "Interacts with humans directly",
      "Symbolic / representational"
    ],
    "feedback": {
      "Physical object": "A book has a tangible presence and exists in physical space — it can be handled, stored, and transported.",
      "Man-made / synthetic": "Books are created by humans through deliberate design and production processes.",
      "Biological or biologically-inspired": "Books are not living systems nor based on biological models.",
      "Fixed/static": "Once printed or finalized, the content and structure of a book remain unchanged.",
      "Structural": "It is not load-bearing or architectural in nature.",
      "Perceptible": "It is readable through sight and touch; one can flip pages and view printed symbols.",
      "Material form": "Constructed from paper, ink, glue, and covers — clearly material and not virtual.",
      "Passive": "Books do not act on their own or emit effects unless interacted with — not included due to symbolic output.",
      "Purposeful / intentional": "Books are created with the intent to store, organize, and communicate specific content.",
      "Emits output / produces effect": "Omitted — any effects are interpretive or symbolic, not physical outputs like heat or light.",
      "Processes or regulates logic/signals": "The book contains logic in content but does not process or execute logic itself.",
      "Transforms or modifies internal state": "It does not change form or state autonomously.",
      "Interacts with humans directly": "Books are handled, read, and experienced directly by people.",
      "Part of a larger system": "Books may belong to libraries or curricula, but this is not required for the baseline form.",
      "Autonomous in function": "It cannot function or produce effect without human engagement.",
      "System-critical": "Books are important culturally but not typically critical to system survival.",
      "Symbolic / representational": "The essence of a book lies in its symbolic content — it encodes meaning through written language.",
      "Communicative": "Omitted under compression — communication is indirect via human interpretation.",
      "Logical / rule-based": "It may contain logic but does not embody or execute rules on its own.",
      "Hierarchical / modular": "Content may be structured, but the object itself is not modular.",
      "Behavior-guiding": "It may influence thoughts or behavior but not through built-in instruction.",
      "Self-referential / meta-conceptual": "Some books may be meta, but the object class 'book' is not inherently self-referential.",
      "Temporal": "It exists over time but does not represent or manage time inherently.",
      "Contextual abstraction": "Meaning varies by content, not the object form — excluded from the baseline.",
      "Socially / culturally constructed": "While books have social roles, this is excluded in baseline encoding unless specifically emphasized.",
      "Defined by a group/system": "Standards exist for publishing, but the identity of 'book' does not require institutional framing.",
      "Linked to identity or role": "Books do not define social roles themselves.",
      "Regulated / governed": "Publication may be governed, but not every book requires regulatory encoding.",
      "Teachable / transmissible": "While books convey knowledge, they are not intrinsically didactic in form.",
      "Visible": "Covered under 'Perceptible' — not redundantly encoded.",
      "Context-sensitive": "A book's physical form does not shift meaning across contexts.",
      "Widely known": "Books are common but not encoded unless cultural prominence is central to identity."
    },
    "image": "assets/book.png",
    "description": "A human-made physical object that stores symbolic content in static material form — readable, perceptible, and intentionally crafted for meaning transmission."
  },
  {
    "id": 7,
    "name": "Dragon (Mythical)",
    "hex": "A4AA91FC",
    "baseline": true,
    "traits": [
      "Physical object",
      "Biological or biologically-inspired",
      "Perceptible",
      "Purposeful / intentional",
      "Emits output / produces effect",
      "Interacts with humans directly",
      "Autonomous in function",
      "Symbolic / representational",
      "Communicative",
      "Behavior-guiding",
      "Contextual abstraction",
      "Socially / culturally constructed",
      "Defined by a group/system",
      "Linked to identity or role",
      "Teachable / transmissible",
      "Context-sensitive",
      "Widely known"
    ],
    "feedback": {
      "Physical object": "Though fictional, dragons are consistently represented with a tangible, physical form across myths — winged, scaled, and physically active.",
      "Man-made / synthetic": "Not included — dragons are not constructed artifacts but imagined biological entities.",
      "Biological or biologically-inspired": "Their anatomy borrows heavily from real-world animals (reptiles, bats, large predators).",
      "Fixed/static": "Omitted — dragons are described as dynamic, living beings.",
      "Structural": "Not applicable — they are not structural elements or architectural components.",
      "Perceptible": "Highly visual and often audible; dragons are depicted in art, film, and literature as sensory-rich beings.",
      "Material form": "Excluded — as mythical entities, dragons lack actual material instantiation despite being imagined in physical terms.",
      "Passive": "Dragons are active agents in myths, often aggressive or vigilant — not passive.",
      "Purposeful / intentional": "They are portrayed as having motives: guarding treasure, attacking villages, or testing heroes.",
      "Emits output / produces effect": "Fire-breathing, flight, roar — dragons produce clear fictional outputs within stories.",
      "Processes or regulates logic/signals": "Not included — dragons do not symbolize logical or computational behavior.",
      "Transforms or modifies internal state": "Omitted — dragons may undergo narrative arcs but not biologically internal transformation as core identity.",
      "Interacts with humans directly": "They frequently engage with heroes, villagers, or gods — forming pivotal narrative roles.",
      "Part of a larger system": "Excluded — while they appear in myth systems, the entity of 'dragon' is typically standalone.",
      "Autonomous in function": "Act independently, often as powerful solitary figures with no master.",
      "System-critical": "Not essential to any real-world or fictional ecosystem's continuity.",
      "Symbolic / representational": "Dragons represent many things: chaos, wisdom, greed, power — essential to their mythic function.",
      "Communicative": "They may speak, issue challenges, or serve as allegorical devices — communication is central in many depictions.",
      "Logical / rule-based": "Dragons do not embody systems of logic or formal reasoning.",
      "Hierarchical / modular": "Not modular — typically singular beings, not composed of interchangeable subsystems.",
      "Behavior-guiding": "Used in stories to shape moral lessons, courage, and taboo — they test or catalyze behavior.",
      "Self-referential / meta-conceptual": "Not inherently meta; they exist within narrative frames rather than as commentary.",
      "Temporal": "Time is not essential to their identity — omitted.",
      "Contextual abstraction": "The meaning of a dragon shifts drastically between cultures (e.g., European = evil; Chinese = wise and noble).",
      "Socially / culturally constructed": "Dragons are invented and sustained through cultural imagination and storytelling.",
      "Defined by a group/system": "Their characteristics are dictated by shared mythological conventions within societies.",
      "Linked to identity or role": "Symbolically tied to kingship, power, national identity (e.g., dragons in flags, houses, heraldry).",
      "Regulated / governed": "No governance applies; not a codified or official construct.",
      "Teachable / transmissible": "Stories of dragons are passed down, taught to children, and embedded in curricula and folklore.",
      "Visible": "Excluded — their visual representation is covered under 'Perceptible'.",
      "Context-sensitive": "A dragon’s moral role or behavior changes dramatically based on cultural setting or time period.",
      "Widely known": "Dragons are among the most globally recognized mythic beings — spanning continents and centuries."
    },
    "image": "assets/dragon.png",
    "description": "A legendary creature with biological features and symbolic roles — autonomous, powerful, and deeply embedded in cultural myths across societies. Acts as both a narrative force and moral device in human storytelling."
  },
  {
    "id": 8,
    "name": "Dragon (Actual)",
    "hex": "C6F40003",
    "baseline": true,
    "traits": [
      "Physical object",
      "Biological or biologically-inspired",
      "Perceptible",
      "Material form",
      "Purposeful / intentional",
      "Emits output / produces effect",
      "Transforms or modifies internal state",
      "Interacts with humans directly",
      "Part of a larger system",
      "Autonomous in function",
      "Visible",
      "Widely known"
    ],
    "feedback": {
      "Physical object": "As a corporeal creature, a real dragon would have spatial presence, mass, and form — it occupies the physical world.",
      "Man-made / synthetic": "Omitted — a naturally evolved species, not artificially constructed.",
      "Biological or biologically-inspired": "Fully biological, exhibiting traits of respiration, metabolism, and organic structure.",
      "Fixed/static": "Not applicable — real dragons would move, hunt, and interact with their environment.",
      "Structural": "Does not serve as a structure or load-bearing element — it is an autonomous lifeform.",
      "Perceptible": "Would be observable through sensory input — sight, sound, and possibly smell (e.g., wings, roar, fire).",
      "Material form": "Has a definite, tangible body composed of biological tissues and systems.",
      "Passive": "Excluded — an active predator or intelligent species, not inert.",
      "Purposeful / intentional": "Exhibits behavior suggesting intent — seeking food, defending territory, reproducing.",
      "Emits output / produces effect": "Produces fire, sound, or flight — active outputs consistent with myth but grounded in biology.",
      "Processes or regulates logic/signals": "Not included — does not imply computational or signaling architecture beyond basic nervous systems.",
      "Transforms or modifies internal state": "Biological creatures metabolize energy, regulate heat, and adapt to stimuli.",
      "Interacts with humans directly": "Assuming such a creature exists in human space, direct encounters (hostile or neutral) would be likely.",
      "Part of a larger system": "Would function as part of an ecosystem — predator, apex species, or environmental influence.",
      "Autonomous in function": "Self-sustaining in movement, hunting, and other life functions.",
      "System-critical": "Not essential to ecosystem function on a global level — excluded.",
      "Symbolic / representational": "Not included — this version is not a metaphor but a literal creature.",
      "Communicative": "Omitted — unless language or signal behavior is proven, it is not a primary trait.",
      "Logical / rule-based": "Biological behavior is instinctual, not governed by logic rules — excluded.",
      "Hierarchical / modular": "Not modular in any abstract structural sense.",
      "Behavior-guiding": "Does not guide human behavior symbolically or ideologically.",
      "Self-referential / meta-conceptual": "Does not model itself or understand abstract categories.",
      "Temporal": "Exists in time, but temporality is not central to identity.",
      "Contextual abstraction": "Not an abstract or shifting symbol — physical identity is stable.",
      "Socially / culturally constructed": "It exists independently of human culture or stories.",
      "Defined by a group/system": "Identity does not depend on cultural definitions or frameworks.",
      "Linked to identity or role": "Not used as a symbol of identity in this literal biological framing.",
      "Regulated / governed": "No political or legal governance defines its existence.",
      "Teachable / transmissible": "Not a story or idea to be taught — it is an organism.",
      "Visible": "Can be directly observed in the environment — this is distinct from being symbolically 'known'.",
      "Context-sensitive": "Its meaning does not shift with context — identity is biologically fixed.",
      "Widely known": "If real, it would be world-famous — appearing in science, media, and global consciousness."
    },
    "image": "assets/dragon.png",
    "description": "A real, biological organism exhibiting traits like flight, fire-breathing, and autonomous behavior. Not symbolic or mythic — a physical apex creature known for its powerful outputs and ecological role."
  }
  
   
]